; ModuleID = 'sign.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.br_rsa_private_key = type { i32, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64 }
%struct.smack_value = type { i8* }

; Function Attrs: noinline nounwind uwtable
define dso_local void @br_ccopy(i32 %0, i8* %1, i8* %2, i64 %3) #0 !dbg !69 {
  call void @llvm.dbg.value(metadata i32 %0, metadata !74, metadata !DIExpression()), !dbg !75
  call void @llvm.dbg.value(metadata i8* %1, metadata !76, metadata !DIExpression()), !dbg !75
  call void @llvm.dbg.value(metadata i8* %2, metadata !77, metadata !DIExpression()), !dbg !75
  call void @llvm.dbg.value(metadata i64 %3, metadata !78, metadata !DIExpression()), !dbg !75
  call void @llvm.dbg.value(metadata i8* %1, metadata !79, metadata !DIExpression()), !dbg !75
  call void @llvm.dbg.value(metadata i8* %2, metadata !80, metadata !DIExpression()), !dbg !75
  br label %5, !dbg !83

5:                                                ; preds = %8, %4
  %.02 = phi i64 [ %3, %4 ], [ %6, %8 ]
  %.01 = phi i8* [ %1, %4 ], [ %16, %8 ], !dbg !75
  %.0 = phi i8* [ %2, %4 ], [ %9, %8 ], !dbg !75
  call void @llvm.dbg.value(metadata i8* %.0, metadata !80, metadata !DIExpression()), !dbg !75
  call void @llvm.dbg.value(metadata i8* %.01, metadata !79, metadata !DIExpression()), !dbg !75

!1543 = !DILocalVariable(name: "j", scope: !1542, file: !52, line: 40, type: !285)
!1544 = !DILocation(line: 0, scope: !1542)
!1545 = !DILocation(line: 44, column: 11, scope: !1542)
!1546 = !DILocation(line: 44, column: 23, scope: !1542)
!1547 = !DILocation(line: 44, column: 17, scope: !1542)
!1548 = !DILocalVariable(name: "w", scope: !1542, file: !52, line: 41, type: !6)
!1549 = !DILocation(line: 45, column: 9, scope: !1542)
!1550 = !DILocation(line: 45, column: 24, scope: !1542)
!1551 = !DILocation(line: 45, column: 18, scope: !1542)
!1552 = !DILocalVariable(name: "ctl", scope: !1542, file: !52, line: 41, type: !6)
!1553 = !DILocation(line: 46, column: 12, scope: !1542)
!1554 = !DILocation(line: 46, column: 17, scope: !1542)
!1555 = !DILocalVariable(name: "hi2", scope: !1542, file: !52, line: 41, type: !6)
!1556 = !DILocation(line: 47, column: 17, scope: !1542)
!1557 = !DILocation(line: 47, column: 12, scope: !1542)
!1558 = !DILocalVariable(name: "lo2", scope: !1542, file: !52, line: 41, type: !6)
!1559 = !DILocation(line: 48, column: 8, scope: !1542)
!1560 = !DILocation(line: 49, column: 8, scope: !1542)
!1561 = !DILocation(line: 50, column: 12, scope: !1542)
!1562 = !DILocation(line: 50, column: 5, scope: !1542)
!1563 = !DILocation(line: 51, column: 2, scope: !1542)
!1564 = !DILocation(line: 39, column: 24, scope: !1539)
!1565 = !DILocation(line: 39, column: 2, scope: !1539)
!1566 = distinct !{!1566, !1540, !1567, !98}
!1567 = !DILocation(line: 51, column: 2, scope: !1536)
!1568 = !DILocation(line: 52, column: 7, scope: !1522)
!1569 = !DILocation(line: 52, column: 17, scope: !1522)
!1570 = !DILocalVariable(name: "cf", scope: !1522, file: !52, line: 33, type: !6)
!1571 = !DILocation(line: 53, column: 4, scope: !1522)
!1572 = !DILocation(line: 54, column: 18, scope: !1522)
!1573 = !DILocation(line: 54, column: 7, scope: !1522)
!1574 = !DILocation(line: 54, column: 5, scope: !1522)
!1575 = !DILocation(line: 55, column: 2, scope: !1522)
!1576 = distinct !DISubprogram(name: "EQ", scope: !101, file: !101, line: 779, type: !193, scopeLine: 780, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, retainedNodes: !2)
!1577 = !DILocalVariable(name: "x", arg: 1, scope: !1576, file: !101, line: 779, type: !6)
!1578 = !DILocation(line: 0, scope: !1576)
!1579 = !DILocalVariable(name: "y", arg: 2, scope: !1576, file: !101, line: 779, type: !6)
!1580 = !DILocation(line: 783, column: 8, scope: !1576)
!1581 = !DILocalVariable(name: "q", scope: !1576, file: !101, line: 781, type: !6)
!1582 = !DILocation(line: 784, column: 18, scope: !1576)
!1583 = !DILocation(line: 784, column: 16, scope: !1576)
!1584 = !DILocation(line: 784, column: 22, scope: !1576)
!1585 = !DILocation(line: 784, column: 9, scope: !1576)
!1586 = !DILocation(line: 784, column: 2, scope: !1576)
!1587 = distinct !DISubprogram(name: "MUX", scope: !101, file: !101, line: 770, type: !102, scopeLine: 771, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, retainedNodes: !2)
!1588 = !DILocalVariable(name: "ctl", arg: 1, scope: !1587, file: !101, line: 770, type: !6)
!1589 = !DILocation(line: 0, scope: !1587)
!1590 = !DILocalVariable(name: "x", arg: 2, scope: !1587, file: !101, line: 770, type: !6)
!1591 = !DILocalVariable(name: "y", arg: 3, scope: !1587, file: !101, line: 770, type: !6)
!1592 = !DILocation(line: 772, column: 14, scope: !1587)
!1593 = !DILocation(line: 772, column: 24, scope: !1587)
!1594 = !DILocation(line: 772, column: 19, scope: !1587)
!1595 = !DILocation(line: 772, column: 11, scope: !1587)
!1596 = !DILocation(line: 772, column: 2, scope: !1587)
!1597 = distinct !DISubprogram(name: "GT", scope: !101, file: !101, line: 803, type: !193, scopeLine: 804, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, retainedNodes: !2)
!1598 = !DILocalVariable(name: "x", arg: 1, scope: !1597, file: !101, line: 803, type: !6)
!1599 = !DILocation(line: 0, scope: !1597)
!1600 = !DILocalVariable(name: "y", arg: 2, scope: !1597, file: !101, line: 803, type: !6)
!1601 = !DILocation(line: 819, column: 8, scope: !1597)
!1602 = !DILocalVariable(name: "z", scope: !1597, file: !101, line: 817, type: !6)
!1603 = !DILocation(line: 820, column: 18, scope: !1597)
!1604 = !DILocation(line: 820, column: 28, scope: !1597)
!1605 = !DILocation(line: 820, column: 23, scope: !1597)
!1606 = !DILocation(line: 820, column: 12, scope: !1597)
!1607 = !DILocation(line: 820, column: 35, scope: !1597)
!1608 = !DILocation(line: 820, column: 2, scope: !1597)
!1609 = distinct !DISubprogram(name: "NOT", scope: !101, file: !101, line: 761, type: !216, scopeLine: 762, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !51, retainedNodes: !2)
!1610 = !DILocalVariable(name: "ctl", arg: 1, scope: !1609, file: !101, line: 761, type: !6)
!1611 = !DILocation(line: 0, scope: !1609)
!1612 = !DILocation(line: 763, column: 13, scope: !1609)
!1613 = !DILocation(line: 763, column: 2, scope: !1609)
!1614 = distinct !DISubprogram(name: "br_rsa_i31_pkcs1_sign", scope: !54, file: !54, line: 29, type: !1615, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !53, retainedNodes: !2)
!1615 = !DISubroutineType(types: !1616)
!1616 = !{!6, !81, !81, !34, !1617, !20}
!1617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1618, size: 64)
!1618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1619)
!1619 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_rsa_private_key", file: !1620, line: 205, baseType: !1621)
!1620 = !DIFile(filename: "../BearSSL/inc/bearssl_rsa.h", directory: "/home/luwei/bech-back/BearSSL/RSA_i31_pkcs1")
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1620, line: 182, size: 704, elements: !1622)
!1622 = !{!1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "n_bitlen", scope: !1621, file: !1620, line: 184, baseType: !6, size: 32)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1621, file: !1620, line: 186, baseType: !20, size: 64, offset: 64)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !1621, file: !1620, line: 188, baseType: !34, size: 64, offset: 128)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1621, file: !1620, line: 190, baseType: !20, size: 64, offset: 192)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !1621, file: !1620, line: 192, baseType: !34, size: 64, offset: 256)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "dp", scope: !1621, file: !1620, line: 194, baseType: !20, size: 64, offset: 320)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "dplen", scope: !1621, file: !1620, line: 196, baseType: !34, size: 64, offset: 384)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "dq", scope: !1621, file: !1620, line: 198, baseType: !20, size: 64, offset: 448)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "dqlen", scope: !1621, file: !1620, line: 200, baseType: !34, size: 64, offset: 512)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "iq", scope: !1621, file: !1620, line: 202, baseType: !20, size: 64, offset: 576)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "iqlen", scope: !1621, file: !1620, line: 204, baseType: !34, size: 64, offset: 640)
!1634 = !DILocalVariable(name: "hash_oid", arg: 1, scope: !1614, file: !54, line: 29, type: !81)
!1635 = !DILocation(line: 0, scope: !1614)
!1636 = !DILocalVariable(name: "hash", arg: 2, scope: !1614, file: !54, line: 30, type: !81)
!1637 = !DILocalVariable(name: "hash_len", arg: 3, scope: !1614, file: !54, line: 30, type: !34)
!1638 = !DILocalVariable(name: "sk", arg: 4, scope: !1614, file: !54, line: 31, type: !1617)
!1639 = !DILocalVariable(name: "x", arg: 5, scope: !1614, file: !54, line: 31, type: !20)
!1640 = !DILocation(line: 33, column: 58, scope: !1641)
!1641 = distinct !DILexicalBlock(scope: !1614, file: !54, line: 33, column: 6)
!1642 = !DILocation(line: 33, column: 7, scope: !1641)
!1643 = !DILocation(line: 33, column: 6, scope: !1614)
!1644 = !DILocation(line: 34, column: 3, scope: !1645)
!1645 = distinct !DILexicalBlock(scope: !1641, file: !54, line: 33, column: 72)
!1646 = !DILocation(line: 36, column: 9, scope: !1614)
!1647 = !DILocation(line: 36, column: 2, scope: !1614)
!1648 = !DILocation(line: 37, column: 1, scope: !1614)
!1649 = distinct !DISubprogram(name: "br_rsa_i31_private", scope: !56, file: !56, line: 32, type: !1650, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !2)
!1650 = !DISubroutineType(types: !1651)
!1651 = !{!6, !20, !1652}
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1653, size: 64)
!1653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1654)
!1654 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_rsa_private_key", file: !1620, line: 205, baseType: !1655)
!1655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1620, line: 182, size: 704, elements: !1656)
!1656 = !{!1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "n_bitlen", scope: !1655, file: !1620, line: 184, baseType: !6, size: 32)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1655, file: !1620, line: 186, baseType: !20, size: 64, offset: 64)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !1655, file: !1620, line: 188, baseType: !34, size: 64, offset: 128)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1655, file: !1620, line: 190, baseType: !20, size: 64, offset: 192)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !1655, file: !1620, line: 192, baseType: !34, size: 64, offset: 256)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "dp", scope: !1655, file: !1620, line: 194, baseType: !20, size: 64, offset: 320)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "dplen", scope: !1655, file: !1620, line: 196, baseType: !34, size: 64, offset: 384)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "dq", scope: !1655, file: !1620, line: 198, baseType: !20, size: 64, offset: 448)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "dqlen", scope: !1655, file: !1620, line: 200, baseType: !34, size: 64, offset: 512)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "iq", scope: !1655, file: !1620, line: 202, baseType: !20, size: 64, offset: 576)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "iqlen", scope: !1655, file: !1620, line: 204, baseType: !34, size: 64, offset: 640)
!1668 = !DILocalVariable(name: "x", arg: 1, scope: !1649, file: !56, line: 32, type: !20)
!1669 = !DILocation(line: 0, scope: !1649)
!1670 = !DILocalVariable(name: "sk", arg: 2, scope: !1649, file: !56, line: 32, type: !1652)
!1671 = !DILocalVariable(name: "tmp", scope: !1649, file: !56, line: 39, type: !1672)
!1672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 17952, elements: !1673)
!1673 = !{!1674}
!1674 = !DISubrange(count: 561)
!1675 = !DILocation(line: 39, column: 11, scope: !1649)
!1676 = !DILocation(line: 49, column: 10, scope: !1649)
!1677 = !DILocalVariable(name: "p", scope: !1649, file: !56, line: 34, type: !81)
!1678 = !DILocation(line: 50, column: 13, scope: !1649)
!1679 = !DILocalVariable(name: "plen", scope: !1649, file: !56, line: 35, type: !34)
!1680 = !DILocation(line: 51, column: 2, scope: !1649)
!1681 = !DILocation(line: 51, column: 14, scope: !1649)
!1682 = !DILocation(line: 51, column: 18, scope: !1649)
!1683 = !DILocation(line: 51, column: 21, scope: !1649)
!1684 = !DILocation(line: 51, column: 24, scope: !1649)
!1685 = !DILocation(line: 52, column: 5, scope: !1686)
!1686 = distinct !DILexicalBlock(scope: !1649, file: !56, line: 51, column: 30)
!1687 = !DILocation(line: 53, column: 8, scope: !1686)
!1688 = distinct !{!1688, !1680, !1689, !98}
!1689 = !DILocation(line: 54, column: 2, scope: !1649)
!1690 = !DILocation(line: 55, column: 10, scope: !1649)
!1691 = !DILocalVariable(name: "q", scope: !1649, file: !56, line: 34, type: !81)
!1692 = !DILocation(line: 56, column: 13, scope: !1649)
!1693 = !DILocalVariable(name: "qlen", scope: !1649, file: !56, line: 35, type: !34)
!1694 = !DILocation(line: 57, column: 2, scope: !1649)
!1695 = !DILocation(line: 57, column: 14, scope: !1649)
!1696 = !DILocation(line: 57, column: 18, scope: !1649)
!1697 = !DILocation(line: 57, column: 21, scope: !1649)
!1698 = !DILocation(line: 57, column: 24, scope: !1649)
!1699 = !DILocation(line: 58, column: 5, scope: !1700)
!1700 = distinct !DILexicalBlock(scope: !1649, file: !56, line: 57, column: 30)
!1701 = !DILocation(line: 59, column: 8, scope: !1700)
!1702 = distinct !{!1702, !1694, !1703, !98}
!1703 = !DILocation(line: 60, column: 2, scope: !1649)
!1704 = !DILocation(line: 65, column: 18, scope: !1649)
!1705 = !DILocation(line: 65, column: 13, scope: !1649)
!1706 = !DILocation(line: 65, column: 40, scope: !1649)
!1707 = !DILocalVariable(name: "z", scope: !1649, file: !56, line: 40, type: !58)
!1708 = !DILocalVariable(name: "fwlen", scope: !1649, file: !56, line: 36, type: !34)
!1709 = !DILocation(line: 67, column: 2, scope: !1649)
!1710 = !DILocation(line: 67, column: 11, scope: !1649)
!1711 = !DILocation(line: 68, column: 5, scope: !1712)
!1712 = distinct !DILexicalBlock(scope: !1649, file: !56, line: 67, column: 16)
!1713 = !DILocation(line: 69, column: 9, scope: !1712)
!1714 = distinct !{!1714, !1709, !1715, !98}
!1715 = !DILocation(line: 70, column: 2, scope: !1649)
!1716 = !DILocation(line: 75, column: 18, scope: !1649)
!1717 = !DILocation(line: 75, column: 8, scope: !1649)
!1718 = !DILocation(line: 80, column: 8, scope: !1719)
!1719 = distinct !DILexicalBlock(scope: !1649, file: !56, line: 80, column: 6)
!1720 = !DILocation(line: 80, column: 16, scope: !1719)
!1721 = !DILocation(line: 80, column: 6, scope: !1649)
!1722 = !DILocation(line: 81, column: 3, scope: !1723)
!1723 = distinct !DILexicalBlock(scope: !1719, file: !56, line: 80, column: 24)
!1724 = !DILocation(line: 87, column: 14, scope: !1649)
!1725 = !DILocation(line: 87, column: 23, scope: !1649)
!1726 = !DILocation(line: 87, column: 28, scope: !1649)
!1727 = !DILocation(line: 87, column: 9, scope: !1649)
!1728 = !DILocalVariable(name: "xlen", scope: !1649, file: !56, line: 38, type: !34)
!1729 = !DILocation(line: 92, column: 7, scope: !1649)
!1730 = !DILocalVariable(name: "mq", scope: !1649, file: !56, line: 41, type: !116)
!1731 = !DILocation(line: 93, column: 2, scope: !1649)
!1732 = !DILocation(line: 98, column: 10, scope: !1649)
!1733 = !DILocalVariable(name: "t1", scope: !1649, file: !56, line: 41, type: !116)
!1734 = !DILocation(line: 99, column: 2, scope: !1649)
!1735 = !DILocation(line: 106, column: 14, scope: !1649)
!1736 = !DILocation(line: 106, column: 10, scope: !1649)
!1737 = !DILocalVariable(name: "t2", scope: !1649, file: !56, line: 41, type: !116)
!1738 = !DILocation(line: 107, column: 18, scope: !1649)
!1739 = !DILocation(line: 107, column: 2, scope: !1649)
!1740 = !DILocation(line: 108, column: 2, scope: !1649)
!1741 = !DILocation(line: 119, column: 14, scope: !1649)
!1742 = !DILocation(line: 119, column: 10, scope: !1649)
!1743 = !DILocalVariable(name: "t3", scope: !1649, file: !56, line: 41, type: !116)
!1744 = !DILocation(line: 120, column: 16, scope: !1649)
!1745 = !DILocation(line: 120, column: 2, scope: !1649)
!1746 = !DILocalVariable(name: "u", scope: !1649, file: !56, line: 38, type: !34)
!1747 = !DILocalVariable(name: "r", scope: !1649, file: !56, line: 42, type: !6)
!1748 = !DILocation(line: 123, column: 2, scope: !1649)
!1749 = !DILocation(line: 123, column: 11, scope: !1649)
!1750 = !DILocation(line: 126, column: 5, scope: !1751)
!1751 = distinct !DILexicalBlock(scope: !1649, file: !56, line: 123, column: 16)
!1752 = !DILocation(line: 127, column: 8, scope: !1751)
!1753 = !DILocalVariable(name: "wn", scope: !1751, file: !56, line: 124, type: !6)
!1754 = !DILocation(line: 0, scope: !1751)
!1755 = !DILocation(line: 128, column: 8, scope: !1751)
!1756 = !DILocalVariable(name: "wx", scope: !1751, file: !56, line: 124, type: !6)
!1757 = !DILocation(line: 129, column: 18, scope: !1751)
!1758 = !DILocation(line: 129, column: 12, scope: !1751)
!1759 = !DILocation(line: 129, column: 24, scope: !1751)
!1760 = !DILocation(line: 129, column: 30, scope: !1751)
!1761 = distinct !{!1761, !1748, !1762, !98}
!1762 = !DILocation(line: 130, column: 2, scope: !1649)
!1763 = !DILocation(line: 135, column: 14, scope: !1649)
!1764 = !DILocation(line: 135, column: 10, scope: !1649)
!1765 = !DILocalVariable(name: "mp", scope: !1649, file: !56, line: 41, type: !116)
!1766 = !DILocation(line: 136, column: 2, scope: !1649)
!1767 = !DILocation(line: 136, column: 24, scope: !1649)
!1768 = !DILocation(line: 141, column: 22, scope: !1649)
!1769 = !DILocation(line: 141, column: 8, scope: !1649)
!1770 = !DILocalVariable(name: "q0i", scope: !1649, file: !56, line: 37, type: !6)
!1771 = !DILocation(line: 142, column: 10, scope: !1649)
!1772 = !DILocalVariable(name: "s2", scope: !1649, file: !56, line: 41, type: !116)
!1773 = !DILocation(line: 143, column: 2, scope: !1649)
!1774 = !DILocation(line: 144, column: 33, scope: !1649)
!1775 = !DILocation(line: 144, column: 41, scope: !1649)
!1776 = !DILocation(line: 145, column: 10, scope: !1649)
!1777 = !DILocation(line: 145, column: 6, scope: !1649)
!1778 = !DILocation(line: 145, column: 28, scope: !1649)
!1779 = !DILocation(line: 145, column: 24, scope: !1649)
!1780 = !DILocation(line: 144, column: 7, scope: !1649)
!1781 = !DILocation(line: 144, column: 4, scope: !1649)
!1782 = !DILocation(line: 150, column: 22, scope: !1649)
!1783 = !DILocation(line: 150, column: 8, scope: !1649)
!1784 = !DILocalVariable(name: "p0i", scope: !1649, file: !56, line: 37, type: !6)
!1785 = !DILocation(line: 151, column: 14, scope: !1649)
!1786 = !DILocation(line: 151, column: 10, scope: !1649)
!1787 = !DILocalVariable(name: "s1", scope: !1649, file: !56, line: 41, type: !116)
!1788 = !DILocation(line: 152, column: 2, scope: !1649)
!1789 = !DILocation(line: 153, column: 33, scope: !1649)
!1790 = !DILocation(line: 153, column: 41, scope: !1649)
!1791 = !DILocation(line: 154, column: 10, scope: !1649)
!1792 = !DILocation(line: 154, column: 6, scope: !1649)
!1793 = !DILocation(line: 154, column: 28, scope: !1649)
!1794 = !DILocation(line: 154, column: 24, scope: !1649)
!1795 = !DILocation(line: 153, column: 7, scope: !1649)
!1796 = !DILocation(line: 153, column: 4, scope: !1649)
!1797 = !DILocation(line: 169, column: 14, scope: !1649)
!1798 = !DILocation(line: 169, column: 10, scope: !1649)
!1799 = !DILocation(line: 170, column: 14, scope: !1649)
!1800 = !DILocation(line: 170, column: 10, scope: !1649)
!1801 = !DILocation(line: 171, column: 2, scope: !1649)
!1802 = !DILocation(line: 172, column: 21, scope: !1649)
!1803 = !DILocation(line: 172, column: 2, scope: !1649)
!1804 = !DILocation(line: 173, column: 2, scope: !1649)
!1805 = !DILocation(line: 174, column: 31, scope: !1649)
!1806 = !DILocation(line: 174, column: 39, scope: !1649)
!1807 = !DILocation(line: 174, column: 2, scope: !1649)
!1808 = !DILocation(line: 175, column: 2, scope: !1649)
!1809 = !DILocation(line: 190, column: 2, scope: !1649)
!1810 = !DILocation(line: 196, column: 2, scope: !1649)
!1811 = !DILocation(line: 202, column: 13, scope: !1649)
!1812 = !DILocation(line: 202, column: 19, scope: !1649)
!1813 = !DILocation(line: 202, column: 2, scope: !1649)
!1814 = !DILocation(line: 203, column: 1, scope: !1649)
!1815 = distinct !DISubprogram(name: "br_i31_zero", scope: !101, file: !101, line: 1383, type: !410, scopeLine: 1384, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !2)
!1816 = !DILocalVariable(name: "x", arg: 1, scope: !1815, file: !101, line: 1383, type: !116)
!1817 = !DILocation(line: 0, scope: !1815)
!1818 = !DILocalVariable(name: "bit_len", arg: 2, scope: !1815, file: !101, line: 1383, type: !6)
!1819 = !DILocation(line: 1385, column: 5, scope: !1815)
!1820 = !DILocation(line: 1385, column: 8, scope: !1815)
!1821 = !DILocation(line: 1386, column: 2, scope: !1815)
!1822 = !DILocation(line: 1386, column: 25, scope: !1815)
!1823 = !DILocation(line: 1386, column: 31, scope: !1815)
!1824 = !DILocation(line: 1386, column: 15, scope: !1815)
!1825 = !DILocation(line: 1386, column: 37, scope: !1815)
!1826 = !DILocation(line: 1387, column: 1, scope: !1815)
!1827 = distinct !DISubprogram(name: "br_rsa_pkcs1_sig_pad", scope: !60, file: !60, line: 29, type: !1828, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !59, retainedNodes: !2)
!1828 = !DISubroutineType(types: !1829)
!1829 = !{!6, !81, !81, !34, !6, !20}
!1830 = !DILocalVariable(name: "hash_oid", arg: 1, scope: !1827, file: !60, line: 29, type: !81)
!1831 = !DILocation(line: 0, scope: !1827)
!1832 = !DILocalVariable(name: "hash", arg: 2, scope: !1827, file: !60, line: 30, type: !81)
!1833 = !DILocalVariable(name: "hash_len", arg: 3, scope: !1827, file: !60, line: 30, type: !34)
!1834 = !DILocalVariable(name: "n_bitlen", arg: 4, scope: !1827, file: !60, line: 31, type: !6)
!1835 = !DILocalVariable(name: "x", arg: 5, scope: !1827, file: !60, line: 31, type: !20)
!1836 = !DILocation(line: 60, column: 19, scope: !1827)
!1837 = !DILocation(line: 60, column: 24, scope: !1827)
!1838 = !DILocation(line: 60, column: 9, scope: !1827)
!1839 = !DILocalVariable(name: "xlen", scope: !1827, file: !60, line: 33, type: !34)
!1840 = !DILocation(line: 62, column: 15, scope: !1841)
!1841 = distinct !DILexicalBlock(scope: !1827, file: !60, line: 62, column: 6)
!1842 = !DILocation(line: 62, column: 6, scope: !1827)
!1843 = !DILocation(line: 63, column: 23, scope: !1844)
!1844 = distinct !DILexicalBlock(scope: !1845, file: !60, line: 63, column: 7)
!1845 = distinct !DILexicalBlock(scope: !1841, file: !60, line: 62, column: 24)
!1846 = !DILocation(line: 63, column: 12, scope: !1844)
!1847 = !DILocation(line: 63, column: 7, scope: !1845)
!1848 = !DILocation(line: 64, column: 4, scope: !1849)
!1849 = distinct !DILexicalBlock(scope: !1844, file: !60, line: 63, column: 29)
!1850 = !DILocation(line: 66, column: 3, scope: !1845)
!1851 = !DILocation(line: 66, column: 8, scope: !1845)
!1852 = !DILocation(line: 67, column: 3, scope: !1845)
!1853 = !DILocation(line: 67, column: 8, scope: !1845)
!1854 = !DILocation(line: 68, column: 12, scope: !1845)
!1855 = !DILocalVariable(name: "u", scope: !1827, file: !60, line: 33, type: !34)
!1856 = !DILocation(line: 69, column: 12, scope: !1845)
!1857 = !DILocation(line: 69, column: 25, scope: !1845)
!1858 = !DILocation(line: 69, column: 3, scope: !1845)
!1859 = !DILocation(line: 70, column: 7, scope: !1845)
!1860 = !DILocation(line: 70, column: 3, scope: !1845)
!1861 = !DILocation(line: 70, column: 12, scope: !1845)
!1862 = !DILocation(line: 71, column: 2, scope: !1845)
!1863 = !DILocation(line: 72, column: 8, scope: !1864)
!1864 = distinct !DILexicalBlock(scope: !1841, file: !60, line: 71, column: 9)
!1865 = !DILocalVariable(name: "x3", scope: !1827, file: !60, line: 33, type: !34)
!1866 = !DILocation(line: 78, column: 18, scope: !1867)
!1867 = distinct !DILexicalBlock(scope: !1864, file: !60, line: 78, column: 7)
!1868 = !DILocation(line: 78, column: 29, scope: !1867)
!1869 = !DILocation(line: 78, column: 12, scope: !1867)
!1870 = !DILocation(line: 78, column: 7, scope: !1864)
!1871 = !DILocation(line: 79, column: 4, scope: !1872)
!1872 = distinct !DILexicalBlock(scope: !1867, file: !60, line: 78, column: 36)
!1873 = !DILocation(line: 81, column: 3, scope: !1864)
!1874 = !DILocation(line: 81, column: 8, scope: !1864)
!1875 = !DILocation(line: 82, column: 3, scope: !1864)
!1876 = !DILocation(line: 82, column: 8, scope: !1864)
!1877 = !DILocation(line: 83, column: 12, scope: !1864)
!1878 = !DILocation(line: 83, column: 17, scope: !1864)
!1879 = !DILocation(line: 83, column: 28, scope: !1864)
!1880 = !DILocation(line: 84, column: 12, scope: !1864)
!1881 = !DILocation(line: 84, column: 25, scope: !1864)
!1882 = !DILocation(line: 84, column: 3, scope: !1864)
!1883 = !DILocation(line: 85, column: 3, scope: !1864)
!1884 = !DILocation(line: 85, column: 8, scope: !1864)
!1885 = !DILocation(line: 86, column: 7, scope: !1864)
!1886 = !DILocation(line: 86, column: 3, scope: !1864)
!1887 = !DILocation(line: 86, column: 12, scope: !1864)
!1888 = !DILocation(line: 87, column: 17, scope: !1864)
!1889 = !DILocation(line: 87, column: 28, scope: !1864)
!1890 = !DILocation(line: 87, column: 14, scope: !1864)
!1891 = !DILocation(line: 87, column: 7, scope: !1864)
!1892 = !DILocation(line: 87, column: 3, scope: !1864)
!1893 = !DILocation(line: 87, column: 12, scope: !1864)
!1894 = !DILocation(line: 88, column: 7, scope: !1864)
!1895 = !DILocation(line: 88, column: 3, scope: !1864)
!1896 = !DILocation(line: 88, column: 12, scope: !1864)
!1897 = !DILocation(line: 89, column: 17, scope: !1864)
!1898 = !DILocation(line: 89, column: 14, scope: !1864)
!1899 = !DILocation(line: 89, column: 7, scope: !1864)
!1900 = !DILocation(line: 89, column: 3, scope: !1864)
!1901 = !DILocation(line: 89, column: 12, scope: !1864)
!1902 = !DILocation(line: 90, column: 7, scope: !1864)
!1903 = !DILocation(line: 90, column: 3, scope: !1864)
!1904 = !DILocation(line: 90, column: 12, scope: !1864)
!1905 = !DILocation(line: 91, column: 12, scope: !1864)
!1906 = !DILocation(line: 91, column: 16, scope: !1864)
!1907 = !DILocation(line: 91, column: 34, scope: !1864)
!1908 = !DILocation(line: 91, column: 3, scope: !1864)
!1909 = !DILocation(line: 92, column: 11, scope: !1864)
!1910 = !DILocation(line: 92, column: 5, scope: !1864)
!1911 = !DILocation(line: 93, column: 7, scope: !1864)
!1912 = !DILocation(line: 93, column: 3, scope: !1864)
!1913 = !DILocation(line: 93, column: 11, scope: !1864)
!1914 = !DILocation(line: 94, column: 7, scope: !1864)
!1915 = !DILocation(line: 94, column: 3, scope: !1864)
!1916 = !DILocation(line: 94, column: 11, scope: !1864)
!1917 = !DILocation(line: 95, column: 7, scope: !1864)
!1918 = !DILocation(line: 95, column: 3, scope: !1864)
!1919 = !DILocation(line: 95, column: 11, scope: !1864)
!1920 = !DILocation(line: 96, column: 13, scope: !1864)
!1921 = !DILocation(line: 96, column: 7, scope: !1864)
!1922 = !DILocation(line: 96, column: 3, scope: !1864)
!1923 = !DILocation(line: 96, column: 11, scope: !1864)
!1924 = !DILocation(line: 0, scope: !1841)
!1925 = !DILocation(line: 98, column: 11, scope: !1827)
!1926 = !DILocation(line: 98, column: 2, scope: !1827)
!1927 = !DILocation(line: 99, column: 2, scope: !1827)
!1928 = !DILocation(line: 100, column: 1, scope: !1827)
!1929 = distinct !DISubprogram(name: "sign_wrapper", scope: !64, file: !64, line: 3, type: !1930, scopeLine: 5, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !2)
!1930 = !DISubroutineType(types: !1931)
!1931 = !{null, !81, !81, !34, !1932, !20}
!1932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1933, size: 64)
!1933 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1934)
!1934 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_rsa_private_key", file: !1620, line: 205, baseType: !1935)
!1935 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1620, line: 182, size: 704, elements: !1936)
!1936 = !{!1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947}
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "n_bitlen", scope: !1935, file: !1620, line: 184, baseType: !6, size: 32)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1935, file: !1620, line: 186, baseType: !20, size: 64, offset: 64)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !1935, file: !1620, line: 188, baseType: !34, size: 64, offset: 128)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1935, file: !1620, line: 190, baseType: !20, size: 64, offset: 192)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !1935, file: !1620, line: 192, baseType: !34, size: 64, offset: 256)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "dp", scope: !1935, file: !1620, line: 194, baseType: !20, size: 64, offset: 320)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "dplen", scope: !1935, file: !1620, line: 196, baseType: !34, size: 64, offset: 384)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "dq", scope: !1935, file: !1620, line: 198, baseType: !20, size: 64, offset: 448)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "dqlen", scope: !1935, file: !1620, line: 200, baseType: !34, size: 64, offset: 512)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "iq", scope: !1935, file: !1620, line: 202, baseType: !20, size: 64, offset: 576)
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "iqlen", scope: !1935, file: !1620, line: 204, baseType: !34, size: 64, offset: 640)
!1948 = !DILocalVariable(name: "hash_oid", arg: 1, scope: !1929, file: !64, line: 3, type: !81)
!1949 = !DILocation(line: 0, scope: !1929)
!1950 = !DILocalVariable(name: "hash", arg: 2, scope: !1929, file: !64, line: 4, type: !81)
!1951 = !DILocalVariable(name: "hash_len", arg: 3, scope: !1929, file: !64, line: 4, type: !34)
!1952 = !DILocalVariable(name: "sk", arg: 4, scope: !1929, file: !64, line: 5, type: !1932)
!1953 = !DILocalVariable(name: "x", arg: 5, scope: !1929, file: !64, line: 5, type: !20)
!1954 = !DILocation(line: 6, column: 12, scope: !1929)
!1955 = !DILocation(line: 6, column: 2, scope: !1929)
!1956 = !DILocation(line: 7, column: 12, scope: !1929)
!1957 = !DILocation(line: 7, column: 2, scope: !1929)
!1958 = !DILocation(line: 8, column: 12, scope: !1929)
!1959 = !DILocation(line: 8, column: 2, scope: !1929)
!1960 = !DILocation(line: 9, column: 12, scope: !1929)
!1961 = !DILocation(line: 9, column: 2, scope: !1929)
!1962 = !DILocation(line: 10, column: 12, scope: !1929)
!1963 = !DILocation(line: 10, column: 2, scope: !1929)
!1964 = !DILocation(line: 12, column: 30, scope: !1929)
!1965 = !DILocation(line: 12, column: 12, scope: !1929)
!1966 = !DILocation(line: 12, column: 2, scope: !1929)
!1967 = !DILocation(line: 13, column: 30, scope: !1929)
!1968 = !DILocation(line: 13, column: 12, scope: !1929)
!1969 = !DILocation(line: 13, column: 2, scope: !1929)
!1970 = !DILocation(line: 14, column: 30, scope: !1929)
!1971 = !DILocation(line: 14, column: 12, scope: !1929)
!1972 = !DILocation(line: 14, column: 2, scope: !1929)
!1973 = !DILocation(line: 15, column: 30, scope: !1929)
!1974 = !DILocation(line: 15, column: 12, scope: !1929)
!1975 = !DILocation(line: 15, column: 2, scope: !1929)
!1976 = !DILocation(line: 16, column: 30, scope: !1929)
!1977 = !DILocation(line: 16, column: 12, scope: !1929)
!1978 = !DILocation(line: 16, column: 2, scope: !1929)
!1979 = !DILocation(line: 18, column: 30, scope: !1929)
!1980 = !DILocation(line: 18, column: 12, scope: !1929)
!1981 = !DILocation(line: 18, column: 2, scope: !1929)
!1982 = !DILocation(line: 19, column: 30, scope: !1929)
!1983 = !DILocation(line: 19, column: 12, scope: !1929)
!1984 = !DILocation(line: 19, column: 2, scope: !1929)
!1985 = !DILocation(line: 20, column: 30, scope: !1929)
!1986 = !DILocation(line: 20, column: 12, scope: !1929)
!1987 = !DILocation(line: 20, column: 2, scope: !1929)
!1988 = !DILocation(line: 21, column: 30, scope: !1929)
!1989 = !DILocation(line: 21, column: 12, scope: !1929)
!1990 = !DILocation(line: 21, column: 2, scope: !1929)
!1991 = !DILocation(line: 22, column: 30, scope: !1929)
!1992 = !DILocation(line: 22, column: 12, scope: !1929)
!1993 = !DILocation(line: 22, column: 2, scope: !1929)
!1994 = !DILocation(line: 23, column: 30, scope: !1929)
!1995 = !DILocation(line: 23, column: 12, scope: !1929)
!1996 = !DILocation(line: 23, column: 2, scope: !1929)
!1997 = !DILocation(line: 25, column: 12, scope: !1929)
!1998 = !DILocation(line: 25, column: 2, scope: !1929)
!1999 = !DILocation(line: 26, column: 12, scope: !1929)
!2000 = !DILocation(line: 26, column: 2, scope: !1929)
!2001 = !DILocation(line: 27, column: 12, scope: !1929)
!2002 = !DILocation(line: 27, column: 2, scope: !1929)
!2003 = !DILocation(line: 30, column: 2, scope: !1929)
!2004 = !DILocation(line: 31, column: 1, scope: !1929)
!2005 = distinct !DISubprogram(name: "sign_wrapper_t", scope: !64, file: !64, line: 50, type: !2006, scopeLine: 50, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !2)
!2006 = !DISubroutineType(types: !2007)
!2007 = !{null}
!2008 = !DILocation(line: 52, column: 33, scope: !2005)
!2009 = !DILocalVariable(name: "hash_oid", scope: !2005, file: !64, line: 52, type: !81)
!2010 = !DILocation(line: 0, scope: !2005)
!2011 = !DILocation(line: 53, column: 30, scope: !2005)
