; ModuleID = 'api_mul.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.br_ec_impl = type { i32, i8* (i32, i64*)*, i8* (i32, i64*)*, i64 (i32, i64*)*, i32 (i8*, i64, i8*, i64, i32)*, i64 (i8*, i8*, i64, i32)*, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* }
%struct.p256_affine = type { [5 x i64], [5 x i64] }
%struct.smack_value = type { i8* }
%struct.p256_jacobian = type { [5 x i64], [5 x i64], [5 x i64] }
%union.anon = type { [15 x %struct.p256_jacobian] }

@br_ec_p256_m62 = dso_local constant %struct.br_ec_impl { i32 8388608, i8* (i32, i64*)* @api_generator, i8* (i32, i64*)* @api_order, i64 (i32, i64*)* @api_xoff, i32 (i8*, i64, i8*, i64, i32)* @api_mul, i64 (i8*, i8*, i64, i32)* @api_mulgen, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* @api_muladd }, align 8, !dbg !0
@f256_frommonty.one = internal constant [5 x i64] [i64 1, i64 0, i64 0, i64 0, i64 0], align 16, !dbg !48

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "br_ec_p256_m62", scope: !2, file: !3, line: 1739, type: !63, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !21, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../BearSSL/src/ec/ec_p256_m62.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m62")
!4 = !{}
!5 = !{!6, !11, !15, !18, !19, !20}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !7, line: 26, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !9, line: 41, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !12, line: 26, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !9, line: 42, baseType: !14)
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !12, line: 27, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !9, line: 45, baseType: !17)
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIBasicType(name: "unsigned __int128", size: 128, encoding: DW_ATE_unsigned)
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !{!0, !22, !28, !33, !44, !46, !48, !51}
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "P256_G", scope: !2, file: !3, line: 33, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 520, elements: !26)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!26 = !{!27}
!27 = !DISubrange(count: 65)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "P256_N", scope: !2, file: !3, line: 43, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 256, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 32)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "R2", scope: !35, file: !3, line: 455, type: !41, isLocal: true, isDefinition: true)
!35 = distinct !DISubprogram(name: "f256_tomonty", scope: !3, file: !3, line: 447, type: !36, scopeLine: 448, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38, !39}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 320, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 5)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "P256_B_MONTY", scope: !2, file: !3, line: 96, type: !41, isLocal: true, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "F256_R", scope: !2, file: !3, line: 89, type: !41, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "one", scope: !50, file: !3, line: 472, type: !41, isLocal: true, isDefinition: true)
!50 = distinct !DISubprogram(name: "f256_frommonty", scope: !3, file: !3, line: 467, type: !36, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "P256_Gwin", scope: !2, file: !3, line: 1492, type: !53, isLocal: true, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 9600, elements: !61)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "p256_affine", file: !3, line: 610, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 607, size: 640, elements: !57)
!57 = !{!58, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !56, file: !3, line: 608, baseType: !59, size: 320)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 320, elements: !42)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !56, file: !3, line: 609, baseType: !59, size: 320, offset: 320)
!61 = !{!62}
!62 = !DISubrange(count: 15)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !65, line: 415, baseType: !66)
!65 = !DIFile(filename: "../BearSSL/inc/bearssl_ec.h", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m62")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 270, size: 448, elements: !67)
!67 = !{!68, !69, !77, !78, !82, !87, !91}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !66, file: !65, line: 279, baseType: !11, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !66, file: !65, line: 292, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !10, !74}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !17)
!76 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !66, file: !65, line: 306, baseType: !70, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !66, file: !65, line: 318, baseType: !79, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!75, !10, !74}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !66, file: !65, line: 350, baseType: !83, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!11, !86, !75, !73, !75, !10}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !66, file: !65, line: 366, baseType: !88, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!75, !86, !73, !75, !10}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !66, file: !65, line: 412, baseType: !92, size: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!11, !86, !73, !75, !73, !75, !73, !75, !10}
!95 = distinct !DICompileUnit(language: DW_LANG_C99, file: !96, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!96 = !DIFile(filename: "api_mul.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m62")
!97 = distinct !DICompileUnit(language: DW_LANG_C99, file: !98, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!98 = !DIFile(filename: "../BearSSL/src/codec/ccopy.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m62")
!99 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!100 = !{i32 7, !"Dwarf Version", i32 4}
!101 = !{i32 2, !"Debug Info Version", i32 3}
!102 = !{i32 1, !"wchar_size", i32 4}
!103 = distinct !DISubprogram(name: "api_mul_wrapper", scope: !96, file: !96, line: 7, type: !104, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !95, retainedNodes: !4)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !86, !75, !73, !75, !10}
!106 = !DILocalVariable(name: "G", arg: 1, scope: !103, file: !96, line: 7, type: !86)
!107 = !DILocation(line: 0, scope: !103)
!108 = !DILocalVariable(name: "Glen", arg: 2, scope: !103, file: !96, line: 7, type: !75)
!109 = !DILocalVariable(name: "kb", arg: 3, scope: !103, file: !96, line: 8, type: !73)
!110 = !DILocalVariable(name: "kblen", arg: 4, scope: !103, file: !96, line: 8, type: !75)
!111 = !DILocalVariable(name: "curve", arg: 5, scope: !103, file: !96, line: 8, type: !10)
!112 = !DILocation(line: 9, column: 12, scope: !103)
!113 = !DILocation(line: 9, column: 2, scope: !103)
!114 = !DILocation(line: 10, column: 12, scope: !103)
!115 = !DILocation(line: 10, column: 2, scope: !103)
!116 = !DILocation(line: 11, column: 12, scope: !103)
!117 = !DILocation(line: 11, column: 2, scope: !103)
!118 = !DILocation(line: 12, column: 12, scope: !103)
!119 = !DILocation(line: 12, column: 2, scope: !103)
!120 = !DILocation(line: 13, column: 12, scope: !103)
!121 = !DILocation(line: 13, column: 2, scope: !103)
!122 = !DILocation(line: 15, column: 12, scope: !103)
!123 = !DILocation(line: 15, column: 2, scope: !103)
!124 = !DILocalVariable(name: "iec", scope: !103, file: !96, line: 16, type: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !65, line: 415, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 270, size: 448, elements: !129)
!129 = !{!130, !131, !132, !133, !134, !135, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !128, file: !65, line: 279, baseType: !11, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !128, file: !65, line: 292, baseType: !70, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !128, file: !65, line: 306, baseType: !70, size: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !128, file: !65, line: 318, baseType: !79, size: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !128, file: !65, line: 350, baseType: !83, size: 64, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !128, file: !65, line: 366, baseType: !88, size: 64, offset: 320)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !128, file: !65, line: 412, baseType: !92, size: 64, offset: 384)
!137 = !DILocation(line: 18, column: 7, scope: !103)
!138 = !DILocation(line: 18, column: 2, scope: !103)
!139 = !DILocation(line: 19, column: 1, scope: !103)
!140 = distinct !DISubprogram(name: "api_mul_wrapper_t", scope: !96, file: !96, line: 30, type: !141, scopeLine: 30, spFlags: DISPFlagDefinition, unit: !95, retainedNodes: !4)
!141 = !DISubroutineType(types: !142)
!142 = !{null}
!143 = !DILocation(line: 32, column: 21, scope: !140)
!144 = !DILocalVariable(name: "G", scope: !140, file: !96, line: 32, type: !86)
!145 = !DILocation(line: 0, scope: !140)
!146 = !DILocation(line: 33, column: 17, scope: !140)
!147 = !DILocalVariable(name: "Glen", scope: !140, file: !96, line: 33, type: !75)
!148 = !DILocation(line: 34, column: 28, scope: !140)
!149 = !DILocalVariable(name: "kb", scope: !140, file: !96, line: 34, type: !73)
!150 = !DILocation(line: 35, column: 18, scope: !140)
!151 = !DILocalVariable(name: "kblen", scope: !140, file: !96, line: 35, type: !75)
!152 = !DILocalVariable(name: "curve", scope: !140, file: !96, line: 36, type: !10)
!153 = !DILocalVariable(name: "iec", scope: !140, file: !96, line: 38, type: !125)
!154 = !DILocation(line: 40, column: 7, scope: !140)
!155 = !DILocation(line: 40, column: 2, scope: !140)
!156 = !DILocation(line: 41, column: 1, scope: !140)
!157 = distinct !DISubprogram(name: "br_ccopy", scope: !98, file: !98, line: 29, type: !158, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !97, retainedNodes: !4)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !11, !20, !160, !75}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!162 = !DILocalVariable(name: "ctl", arg: 1, scope: !157, file: !98, line: 29, type: !11)
!163 = !DILocation(line: 0, scope: !157)
!164 = !DILocalVariable(name: "dst", arg: 2, scope: !157, file: !98, line: 29, type: !20)
!165 = !DILocalVariable(name: "src", arg: 3, scope: !157, file: !98, line: 29, type: !160)
!166 = !DILocalVariable(name: "len", arg: 4, scope: !157, file: !98, line: 29, type: !75)
!167 = !DILocalVariable(name: "d", scope: !157, file: !98, line: 31, type: !86)
!168 = !DILocalVariable(name: "s", scope: !157, file: !98, line: 32, type: !73)
!169 = !DILocation(line: 36, column: 2, scope: !157)
!170 = !DILocation(line: 36, column: 13, scope: !157)
!171 = !DILocation(line: 36, column: 16, scope: !157)
!172 = !DILocation(line: 39, column: 10, scope: !173)
!173 = distinct !DILexicalBlock(scope: !157, file: !98, line: 36, column: 21)
!174 = !DILocation(line: 39, column: 7, scope: !173)
!175 = !DILocalVariable(name: "x", scope: !173, file: !98, line: 37, type: !11)
!176 = !DILocation(line: 0, scope: !173)
!177 = !DILocation(line: 40, column: 7, scope: !173)
!178 = !DILocalVariable(name: "y", scope: !173, file: !98, line: 37, type: !11)
!179 = !DILocation(line: 41, column: 8, scope: !173)
!180 = !DILocation(line: 41, column: 6, scope: !173)
!181 = !DILocation(line: 42, column: 5, scope: !173)
!182 = distinct !{!182, !169, !183, !184}
!183 = !DILocation(line: 43, column: 2, scope: !157)
!184 = !{!"llvm.loop.mustprogress"}
!185 = !DILocation(line: 44, column: 1, scope: !157)
!186 = distinct !DISubprogram(name: "MUX", scope: !187, file: !187, line: 770, type: !188, scopeLine: 771, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !97, retainedNodes: !4)
!187 = !DIFile(filename: "../BearSSL/src/inner.h", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m62")
!188 = !DISubroutineType(types: !189)
!189 = !{!11, !11, !11, !11}
!190 = !DILocalVariable(name: "ctl", arg: 1, scope: !186, file: !187, line: 770, type: !11)
!191 = !DILocation(line: 0, scope: !186)
!192 = !DILocalVariable(name: "x", arg: 2, scope: !186, file: !187, line: 770, type: !11)
!193 = !DILocalVariable(name: "y", arg: 3, scope: !186, file: !187, line: 770, type: !11)
!194 = !DILocation(line: 772, column: 14, scope: !186)
!195 = !DILocation(line: 772, column: 24, scope: !186)
!196 = !DILocation(line: 772, column: 19, scope: !186)
!197 = !DILocation(line: 772, column: 11, scope: !186)
!198 = !DILocation(line: 772, column: 2, scope: !186)
!199 = distinct !DISubprogram(name: "api_generator", scope: !3, file: !3, line: 51, type: !71, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!200 = !DILocalVariable(name: "curve", arg: 1, scope: !199, file: !3, line: 51, type: !10)
!201 = !DILocation(line: 0, scope: !199)
!202 = !DILocalVariable(name: "len", arg: 2, scope: !199, file: !3, line: 51, type: !74)
!203 = !DILocation(line: 54, column: 7, scope: !199)
!204 = !DILocation(line: 55, column: 2, scope: !199)
!205 = distinct !DISubprogram(name: "api_order", scope: !3, file: !3, line: 59, type: !71, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!206 = !DILocalVariable(name: "curve", arg: 1, scope: !205, file: !3, line: 59, type: !10)
!207 = !DILocation(line: 0, scope: !205)
!208 = !DILocalVariable(name: "len", arg: 2, scope: !205, file: !3, line: 59, type: !74)
!209 = !DILocation(line: 62, column: 7, scope: !205)
!210 = !DILocation(line: 63, column: 2, scope: !205)
!211 = distinct !DISubprogram(name: "api_xoff", scope: !3, file: !3, line: 67, type: !80, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!212 = !DILocalVariable(name: "curve", arg: 1, scope: !211, file: !3, line: 67, type: !10)
!213 = !DILocation(line: 0, scope: !211)
!214 = !DILocalVariable(name: "len", arg: 2, scope: !211, file: !3, line: 67, type: !74)
!215 = !DILocation(line: 70, column: 7, scope: !211)
!216 = !DILocation(line: 71, column: 2, scope: !211)
!217 = distinct !DISubprogram(name: "api_mul", scope: !3, file: !3, line: 1635, type: !84, scopeLine: 1637, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!218 = !DILocalVariable(name: "G", arg: 1, scope: !217, file: !3, line: 1635, type: !86)
!219 = !DILocation(line: 0, scope: !217)
!220 = !DILocalVariable(name: "Glen", arg: 2, scope: !217, file: !3, line: 1635, type: !75)
!221 = !DILocalVariable(name: "k", arg: 3, scope: !217, file: !3, line: 1636, type: !73)
!222 = !DILocalVariable(name: "klen", arg: 4, scope: !217, file: !3, line: 1636, type: !75)
!223 = !DILocalVariable(name: "curve", arg: 5, scope: !217, file: !3, line: 1636, type: !10)
!224 = !DILocalVariable(name: "P", scope: !217, file: !3, line: 1639, type: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "p256_jacobian", file: !3, line: 616, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 612, size: 960, elements: !227)
!227 = !{!228, !229, !230}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !226, file: !3, line: 613, baseType: !59, size: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !226, file: !3, line: 614, baseType: !59, size: 320, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !226, file: !3, line: 615, baseType: !59, size: 320, offset: 640)
!231 = !DILocation(line: 1639, column: 16, scope: !217)
!232 = !DILocation(line: 1642, column: 11, scope: !233)
!233 = distinct !DILexicalBlock(scope: !217, file: !3, line: 1642, column: 6)
!234 = !DILocation(line: 1642, column: 6, scope: !217)
!235 = !DILocation(line: 1643, column: 3, scope: !236)
!236 = distinct !DILexicalBlock(scope: !233, file: !3, line: 1642, column: 18)
!237 = !DILocation(line: 1645, column: 6, scope: !217)
!238 = !DILocalVariable(name: "r", scope: !217, file: !3, line: 1638, type: !11)
!239 = !DILocation(line: 1646, column: 7, scope: !217)
!240 = !DILocation(line: 1646, column: 4, scope: !217)
!241 = !DILocation(line: 1647, column: 2, scope: !217)
!242 = !DILocation(line: 1648, column: 7, scope: !217)
!243 = !DILocation(line: 1648, column: 4, scope: !217)
!244 = !DILocation(line: 1649, column: 2, scope: !217)
!245 = !DILocation(line: 1650, column: 1, scope: !217)
!246 = distinct !DISubprogram(name: "api_mulgen", scope: !3, file: !3, line: 1653, type: !89, scopeLine: 1655, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!247 = !DILocalVariable(name: "R", arg: 1, scope: !246, file: !3, line: 1653, type: !86)
!248 = !DILocation(line: 0, scope: !246)
!249 = !DILocalVariable(name: "k", arg: 2, scope: !246, file: !3, line: 1654, type: !73)
!250 = !DILocalVariable(name: "klen", arg: 3, scope: !246, file: !3, line: 1654, type: !75)
!251 = !DILocalVariable(name: "curve", arg: 4, scope: !246, file: !3, line: 1654, type: !10)
!252 = !DILocalVariable(name: "P", scope: !246, file: !3, line: 1656, type: !225)
!253 = !DILocation(line: 1656, column: 16, scope: !246)
!254 = !DILocation(line: 1659, column: 2, scope: !246)
!255 = !DILocation(line: 1660, column: 2, scope: !246)
!256 = !DILocation(line: 1661, column: 2, scope: !246)
!257 = distinct !DISubprogram(name: "api_muladd", scope: !3, file: !3, line: 1665, type: !93, scopeLine: 1668, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!258 = !DILocalVariable(name: "A", arg: 1, scope: !257, file: !3, line: 1665, type: !86)
!259 = !DILocation(line: 0, scope: !257)
!260 = !DILocalVariable(name: "B", arg: 2, scope: !257, file: !3, line: 1665, type: !73)
!261 = !DILocalVariable(name: "len", arg: 3, scope: !257, file: !3, line: 1665, type: !75)
!262 = !DILocalVariable(name: "x", arg: 4, scope: !257, file: !3, line: 1666, type: !73)
!263 = !DILocalVariable(name: "xlen", arg: 5, scope: !257, file: !3, line: 1666, type: !75)
!264 = !DILocalVariable(name: "y", arg: 6, scope: !257, file: !3, line: 1667, type: !73)
!265 = !DILocalVariable(name: "ylen", arg: 7, scope: !257, file: !3, line: 1667, type: !75)
!266 = !DILocalVariable(name: "curve", arg: 8, scope: !257, file: !3, line: 1667, type: !10)
!267 = !DILocalVariable(name: "P", scope: !257, file: !3, line: 1697, type: !225)
!268 = !DILocation(line: 1697, column: 16, scope: !257)
!269 = !DILocalVariable(name: "Q", scope: !257, file: !3, line: 1697, type: !225)
!270 = !DILocation(line: 1697, column: 19, scope: !257)
!271 = !DILocation(line: 1702, column: 10, scope: !272)
!272 = distinct !DILexicalBlock(scope: !257, file: !3, line: 1702, column: 6)
!273 = !DILocation(line: 1702, column: 6, scope: !257)
!274 = !DILocation(line: 1703, column: 3, scope: !275)
!275 = distinct !DILexicalBlock(scope: !272, file: !3, line: 1702, column: 17)
!276 = !DILocation(line: 1705, column: 6, scope: !257)
!277 = !DILocalVariable(name: "r", scope: !257, file: !3, line: 1698, type: !11)
!278 = !DILocation(line: 1706, column: 2, scope: !257)
!279 = !DILocation(line: 1707, column: 8, scope: !280)
!280 = distinct !DILexicalBlock(scope: !257, file: !3, line: 1707, column: 6)
!281 = !DILocation(line: 1707, column: 6, scope: !257)
!282 = !DILocation(line: 1708, column: 3, scope: !283)
