; ModuleID = 'api_mul-k.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.br_ec_impl = type { i32, i8* (i32, i64*)*, i8* (i32, i64*)*, i64 (i32, i64*)*, i32 (i8*, i64, i8*, i64, i32)*, i64 (i8*, i8*, i64, i32)*, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* }
%struct.smack_value = type { i8* }

@br_ec_c25519_i15 = dso_local constant %struct.br_ec_impl { i32 536870912, i8* (i32, i64*)* @api_generator, i8* (i32, i64*)* @api_order, i64 (i32, i64*)* @api_xoff, i32 (i8*, i64, i8*, i64, i32)* @api_mul, i64 (i8*, i8*, i64, i32)* @api_mulgen, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* @api_muladd }, align 8, !dbg !0, !psr.id !67
@C255_P = internal constant [18 x i16] [i16 272, i16 32749, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767], align 16, !dbg !15, !psr.id !68
@C255_R2 = internal constant <{ i16, i16, [16 x i16] }> <{ i16 272, i16 361, [16 x i16] zeroinitializer }>, align 16, !dbg !26, !psr.id !69
@C255_A24 = internal constant <{ i16, i16, i16, [15 x i16] }> <{ i16 272, i16 17875, i16 70, [15 x i16] zeroinitializer }>, align 16, !dbg !28, !psr.id !70
@ORDER = internal constant [32 x i8] c"\7F\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF", align 16, !dbg !13, !psr.id !71

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "br_ec_c25519_i15", scope: !2, file: !3, line: 390, type: !30, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../BearSSL/src/ec/ec_c25519_i15.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!4 = !{}
!5 = !{!0, !6, !13, !15, !26, !28}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "GEN", scope: !2, file: !3, line: 77, type: !8, isLocal: true, isDefinition: true)
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, elements: !11)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !{!12}
!12 = !DISubrange(count: 32)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "ORDER", scope: !2, file: !3, line: 84, type: !8, isLocal: true, isDefinition: true)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "C255_P", scope: !2, file: !3, line: 33, type: !17, isLocal: true, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 288, elements: !24)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !20, line: 25, baseType: !21)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !22, line: 40, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!23 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!24 = !{!25}
!25 = !DISubrange(count: 18)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "C255_R2", scope: !2, file: !3, line: 42, type: !17, isLocal: true, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "C255_A24", scope: !2, file: !3, line: 70, type: !17, isLocal: true, isDefinition: true)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !32, line: 415, baseType: !33)
!32 = !DIFile(filename: "../BearSSL/inc/bearssl_ec.h", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 270, size: 448, elements: !34)
!34 = !{!35, !39, !49, !50, !54, !59, !63}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !33, file: !32, line: 279, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !20, line: 26, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !22, line: 42, baseType: !38)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !33, file: !32, line: 292, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !47, line: 46, baseType: !48)
!47 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!48 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !33, file: !32, line: 306, baseType: !40, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !33, file: !32, line: 318, baseType: !51, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!46, !44, !45}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !33, file: !32, line: 350, baseType: !55, size: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!36, !58, !46, !43, !46, !44}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !33, file: !32, line: 366, baseType: !60, size: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!46, !58, !43, !46, !44}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !33, file: !32, line: 412, baseType: !64, size: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!36, !58, !43, !46, !43, !46, !43, !46, !44}
!67 = !{!"0"}
!68 = !{!"1"}
!69 = !{!"2"}
!70 = !{!"3"}
!71 = !{!"4"}
!72 = !{!"5"}
!73 = distinct !DICompileUnit(language: DW_LANG_C99, file: !74, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!74 = !DIFile(filename: "api_mul.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!75 = distinct !DICompileUnit(language: DW_LANG_C99, file: !76, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!76 = !DIFile(filename: "../BearSSL/src/int/i15_add.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!77 = distinct !DICompileUnit(language: DW_LANG_C99, file: !78, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !79, splitDebugInlining: false, nameTableKind: None)
!78 = !DIFile(filename: "../BearSSL/src/int/i15_decmod.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!79 = !{!36, !80}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !81, line: 26, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !22, line: 41, baseType: !44)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !84, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !85, splitDebugInlining: false, nameTableKind: None)
!84 = !DIFile(filename: "../BearSSL/src/int/i15_encode.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!85 = !{!36, !10}
!86 = distinct !DICompileUnit(language: DW_LANG_C99, file: !87, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !88, splitDebugInlining: false, nameTableKind: None)
!87 = !DIFile(filename: "../BearSSL/src/int/i15_montmul.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!88 = !{!46, !36}
!89 = distinct !DICompileUnit(language: DW_LANG_C99, file: !90, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!90 = !DIFile(filename: "../BearSSL/src/int/i15_sub.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!91 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!92 = !{i32 7, !"Dwarf Version", i32 4}
!93 = !{i32 2, !"Debug Info Version", i32 3}
!94 = !{i32 1, !"wchar_size", i32 4}
!95 = distinct !DISubprogram(name: "api_mul_wrapper", scope: !74, file: !74, line: 7, type: !96, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !73, retainedNodes: !4)
!96 = !DISubroutineType(types: !97)
!97 = !{null, !58, !46, !43, !46, !44}
!98 = !DILocalVariable(name: "G", arg: 1, scope: !95, file: !74, line: 7, type: !58)
!99 = !DILocation(line: 0, scope: !95)
!100 = !{!"6"}
!101 = !DILocalVariable(name: "Glen", arg: 2, scope: !95, file: !74, line: 7, type: !46)
!102 = !{!"7"}
!103 = !DILocalVariable(name: "kb", arg: 3, scope: !95, file: !74, line: 8, type: !43)
!104 = !{!"8"}
!105 = !DILocalVariable(name: "kblen", arg: 4, scope: !95, file: !74, line: 8, type: !46)
!106 = !{!"9"}
!107 = !DILocalVariable(name: "curve", arg: 5, scope: !95, file: !74, line: 8, type: !44)
!108 = !{!"10"}
!109 = !DILocation(line: 9, column: 12, scope: !95)
!110 = !{!"11"}
!111 = !DILocation(line: 9, column: 2, scope: !95)
!112 = !{!"12"}
!113 = !DILocation(line: 10, column: 12, scope: !95)
!114 = !{!"13"}
!115 = !DILocation(line: 10, column: 2, scope: !95)
!116 = !{!"14"}
!117 = !DILocation(line: 11, column: 12, scope: !95)
!118 = !{!"15"}
!119 = !DILocation(line: 11, column: 2, scope: !95)
!120 = !{!"16"}
!121 = !DILocation(line: 12, column: 12, scope: !95)
!122 = !{!"17"}
!123 = !DILocation(line: 12, column: 2, scope: !95)
!124 = !{!"18"}
!125 = !DILocation(line: 13, column: 12, scope: !95)
!126 = !{!"19"}
!127 = !DILocation(line: 13, column: 2, scope: !95)
!128 = !{!"20"}
!129 = !DILocation(line: 15, column: 12, scope: !95)
!130 = !{!"21"}
!131 = !DILocation(line: 15, column: 2, scope: !95)
!132 = !{!"22"}
!133 = !DILocalVariable(name: "iec", scope: !95, file: !74, line: 16, type: !134)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !32, line: 415, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 270, size: 448, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !145}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !137, file: !32, line: 279, baseType: !36, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !137, file: !32, line: 292, baseType: !40, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !137, file: !32, line: 306, baseType: !40, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !137, file: !32, line: 318, baseType: !51, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !137, file: !32, line: 350, baseType: !55, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !137, file: !32, line: 366, baseType: !60, size: 64, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !137, file: !32, line: 412, baseType: !64, size: 64, offset: 384)
!146 = !{!"23"}
!147 = !DILocation(line: 18, column: 7, scope: !95)
!148 = !{!"24"}
!149 = !{!"25"}
!150 = !DILocation(line: 18, column: 2, scope: !95)
!151 = !{!"26"}
!152 = !DILocation(line: 19, column: 1, scope: !95)
!153 = !{!"27"}
!154 = distinct !DISubprogram(name: "api_mul_wrapper_t", scope: !74, file: !74, line: 30, type: !155, scopeLine: 30, spFlags: DISPFlagDefinition, unit: !73, retainedNodes: !4)
!155 = !DISubroutineType(types: !156)
!156 = !{null}
!157 = !DILocation(line: 32, column: 21, scope: !154)
!158 = !{!"28"}
!159 = !DILocalVariable(name: "G", scope: !154, file: !74, line: 32, type: !58)
!160 = !DILocation(line: 0, scope: !154)
!161 = !{!"29"}
!162 = !DILocation(line: 33, column: 17, scope: !154)
!163 = !{!"30"}
!164 = !DILocalVariable(name: "Glen", scope: !154, file: !74, line: 33, type: !46)
!165 = !{!"31"}
!166 = !DILocation(line: 34, column: 28, scope: !154)
!167 = !{!"32"}
!168 = !DILocalVariable(name: "kb", scope: !154, file: !74, line: 34, type: !43)
!169 = !{!"33"}
!170 = !DILocation(line: 35, column: 18, scope: !154)
!171 = !{!"34"}
!172 = !DILocalVariable(name: "kblen", scope: !154, file: !74, line: 35, type: !46)
!173 = !{!"35"}
!174 = !DILocalVariable(name: "curve", scope: !154, file: !74, line: 36, type: !44)
!175 = !{!"36"}
!176 = !DILocalVariable(name: "iec", scope: !154, file: !74, line: 38, type: !134)
!177 = !{!"37"}
!178 = !DILocation(line: 40, column: 7, scope: !154)
!179 = !{!"38"}
!180 = !{!"39"}
!181 = !DILocation(line: 40, column: 2, scope: !154)
!182 = !{!"40"}
!183 = !DILocation(line: 41, column: 1, scope: !154)
!184 = !{!"41"}
!185 = distinct !DISubprogram(name: "api_generator", scope: !3, file: !3, line: 92, type: !41, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!186 = !DILocalVariable(name: "curve", arg: 1, scope: !185, file: !3, line: 92, type: !44)
!187 = !DILocation(line: 0, scope: !185)
!188 = !{!"42"}
!189 = !DILocalVariable(name: "len", arg: 2, scope: !185, file: !3, line: 92, type: !45)
!190 = !{!"43"}
!191 = !DILocation(line: 95, column: 7, scope: !185)
!192 = !{!"44"}
!193 = !{!"45"}
!194 = !DILocation(line: 96, column: 2, scope: !185)
!195 = !{!"46"}
!196 = distinct !DISubprogram(name: "api_order", scope: !3, file: !3, line: 100, type: !41, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!197 = !DILocalVariable(name: "curve", arg: 1, scope: !196, file: !3, line: 100, type: !44)
!198 = !DILocation(line: 0, scope: !196)
!199 = !{!"47"}
!200 = !DILocalVariable(name: "len", arg: 2, scope: !196, file: !3, line: 100, type: !45)
!201 = !{!"48"}
!202 = !DILocation(line: 103, column: 7, scope: !196)
!203 = !{!"49"}
!204 = !{!"50"}
!205 = !DILocation(line: 104, column: 2, scope: !196)
!206 = !{!"51"}
!207 = distinct !DISubprogram(name: "api_xoff", scope: !3, file: !3, line: 108, type: !52, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!208 = !DILocalVariable(name: "curve", arg: 1, scope: !207, file: !3, line: 108, type: !44)
!209 = !DILocation(line: 0, scope: !207)
!210 = !{!"52"}
!211 = !DILocalVariable(name: "len", arg: 2, scope: !207, file: !3, line: 108, type: !45)
!212 = !{!"53"}
!213 = !DILocation(line: 111, column: 7, scope: !207)
!214 = !{!"54"}
!215 = !DILocation(line: 112, column: 2, scope: !207)
!216 = !{!"55"}
!217 = distinct !DISubprogram(name: "api_mul", scope: !3, file: !3, line: 179, type: !56, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!218 = !{!"56"}
!219 = !{!"57"}
!220 = !{!"58"}
!221 = !{!"59"}
!222 = !{!"60"}
!223 = !{!"61"}
!224 = !{!"62"}
!225 = !{!"63"}
!226 = !{!"64"}
!227 = !{!"65"}
!228 = !{!"66"}
!229 = !{!"67"}
!230 = !{!"68"}
!231 = !{!"69"}
