; ModuleID = 'crypto_stream_chacha20.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.randombytes_implementation = type { i8* ()*, i32 ()*, void ()*, i32 (i32)*, void (i8*, i64)*, i32 ()* }
%struct.SysRandom_ = type { i32, i32, i32 }
%struct.smack_value = type { i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.chacha_ctx = type { [16 x i32] }

@implementation = internal global %struct.randombytes_implementation* @randombytes_sysrandom_implementation, align 8, !dbg !0
@.str = private unnamed_addr constant [20 x i8] c"buf_len <= SIZE_MAX\00", align 1
@.str.1 = private unnamed_addr constant [53 x i8] c"../libsodium/src/libsodium/randombytes/randombytes.c\00", align 1
@__PRETTY_FUNCTION__.randombytes = private unnamed_addr constant [65 x i8] c"void randombytes(unsigned char *const, const unsigned long long)\00", align 1
@randombytes_sysrandom_implementation = dso_local global %struct.randombytes_implementation { i8* ()* @randombytes_sysrandom_implementation_name, i32 ()* @randombytes_sysrandom, void ()* @randombytes_sysrandom_stir, i32 (i32)* null, void (i8*, i64)* @randombytes_sysrandom_buf, i32 ()* @randombytes_sysrandom_close }, align 8, !dbg !53

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "implementation", scope: !2, file: !3, line: 16, type: !16, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../libsodium/src/libsodium/randombytes/randombytes.c", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!4 = !{}
!5 = !{!6, !7, !12}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 26, baseType: !9)
!8 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 42, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 46, baseType: !14)
!13 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!14 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!15 = !{!0}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "randombytes_implementation", file: !19, line: 26, baseType: !20)
!19 = !DIFile(filename: "../libsodium/src/libsodium/include/sodium/randombytes.h", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "randombytes_implementation", file: !19, line: 19, size: 384, elements: !21)
!21 = !{!22, !29, !33, !37, !42, !48}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "implementation_name", scope: !20, file: !19, line: 20, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DISubroutineType(types: !25)
!25 = !{!26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "random", scope: !20, file: !19, line: 21, baseType: !30, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{!7}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "stir", scope: !20, file: !19, line: 22, baseType: !34, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{null}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "uniform", scope: !20, file: !19, line: 23, baseType: !38, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!7, !41}
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !20, file: !19, line: 24, baseType: !43, size: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46, !47}
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !20, file: !19, line: 25, baseType: !49, size: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52}
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "randombytes_sysrandom_implementation", scope: !55, file: !56, line: 297, type: !79, isLocal: false, isDefinition: true)
!55 = distinct !DICompileUnit(language: DW_LANG_C99, file: !56, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !57, globals: !64, splitDebugInlining: false, nameTableKind: None)
!56 = !DIFile(filename: "../libsodium/src/libsodium/randombytes/sysrandom/randombytes_sysrandom.c", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!57 = !{!58, !6, !62, !12, !52}
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !59, line: 108, baseType: !60)
!59 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !10, line: 193, baseType: !61)
!61 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!64 = !{!53, !65, !73}
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "stream", scope: !55, file: !56, line: 69, type: !67, isLocal: true, isDefinition: true)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysRandom", file: !56, line: 67, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SysRandom_", file: !56, line: 63, size: 96, elements: !69)
!69 = !{!70, !71, !72}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "random_data_source_fd", scope: !68, file: !56, line: 64, baseType: !52, size: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !68, file: !56, line: 65, baseType: !52, size: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "getrandom_available", scope: !68, file: !56, line: 66, baseType: !52, size: 32, offset: 64)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "devices", scope: !75, file: !56, line: 106, type: !76, isLocal: true, isDefinition: true)
!75 = distinct !DISubprogram(name: "randombytes_sysrandom_random_dev_open", scope: !56, file: !56, line: 102, type: !50, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !4)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 3)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "randombytes_implementation", file: !19, line: 19, size: 384, elements: !80)
!80 = !{!81, !82, !83, !84, !85, !86}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "implementation_name", scope: !79, file: !19, line: 20, baseType: !23, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "random", scope: !79, file: !19, line: 21, baseType: !30, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "stir", scope: !79, file: !19, line: 22, baseType: !34, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "uniform", scope: !79, file: !19, line: 23, baseType: !38, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !79, file: !19, line: 24, baseType: !43, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !79, file: !19, line: 25, baseType: !49, size: 64, offset: 320)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "sigma", scope: !89, file: !90, line: 60, type: !97, isLocal: true, isDefinition: true)
!89 = distinct !DICompileUnit(language: DW_LANG_C99, file: !90, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !91, globals: !96, splitDebugInlining: false, nameTableKind: None)
!90 = !DIFile(filename: "../libsodium/src/libsodium/crypto_stream/chacha20/ref/stream_chacha20_ref.c", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!91 = !{!92, !93, !6, !11}
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !90, line: 22, baseType: !7)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !90, line: 21, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 24, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 38, baseType: !63)
!96 = !{!87}
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !98, size: 128, elements: !99)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!99 = !{!100}
!100 = !DISubrange(count: 16)
!101 = !DIGlobalVariableExpression(var: !102, expr: !DIExpression())
!102 = distinct !DIGlobalVariable(name: "canary", scope: !103, file: !104, line: 46, type: !110, isLocal: true, isDefinition: true)
!103 = distinct !DICompileUnit(language: DW_LANG_C99, file: !104, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !105, globals: !109, splitDebugInlining: false, nameTableKind: None)
!104 = !DIFile(filename: "../libsodium/src/libsodium/sodium/utils.c", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!105 = !{!106, !12, !108, !63, !52, !28, !6}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !63)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!109 = !{!101}
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 128, elements: !99)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "crypto_stream_chacha20.c", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!113 = distinct !DICompileUnit(language: DW_LANG_C99, file: !114, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!114 = !DIFile(filename: "../libsodium/src/libsodium/crypto_stream/chacha20/stream_chacha20_api.c", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!115 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!116 = !{i32 7, !"Dwarf Version", i32 4}
!117 = !{i32 2, !"Debug Info Version", i32 3}
!118 = !{i32 1, !"wchar_size", i32 4}
!119 = distinct !DISubprogram(name: "crypto_stream_chacha20_wrapper", scope: !112, file: !112, line: 5, type: !120, scopeLine: 6, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !111, retainedNodes: !4)
!120 = !DISubroutineType(types: !121)
!121 = !{!52, !62, !122, !108, !108}
!122 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!123 = !DILocalVariable(name: "c", arg: 1, scope: !119, file: !112, line: 5, type: !62)
!124 = !DILocation(line: 0, scope: !119)
!125 = !DILocalVariable(name: "clen", arg: 2, scope: !119, file: !112, line: 5, type: !122)
!126 = !DILocalVariable(name: "n", arg: 3, scope: !119, file: !112, line: 6, type: !108)
!127 = !DILocalVariable(name: "k", arg: 4, scope: !119, file: !112, line: 6, type: !108)
!128 = !DILocation(line: 7, column: 13, scope: !119)
!129 = !DILocation(line: 7, column: 3, scope: !119)
!130 = !DILocation(line: 8, column: 13, scope: !119)
!131 = !DILocation(line: 8, column: 3, scope: !119)
!132 = !DILocation(line: 9, column: 13, scope: !119)
!133 = !DILocation(line: 9, column: 3, scope: !119)
!134 = !DILocation(line: 10, column: 13, scope: !119)
!135 = !DILocation(line: 10, column: 3, scope: !119)
!136 = !DILocation(line: 12, column: 13, scope: !119)
!137 = !DILocation(line: 12, column: 3, scope: !119)
!138 = !DILocation(line: 14, column: 10, scope: !119)
!139 = !DILocation(line: 14, column: 3, scope: !119)
!140 = distinct !DISubprogram(name: "crypto_stream_chacha20_wrapper_t", scope: !112, file: !112, line: 22, type: !35, scopeLine: 23, spFlags: DISPFlagDefinition, unit: !111, retainedNodes: !4)
!141 = !DILocalVariable(name: "dout", scope: !140, file: !112, line: 24, type: !63)
!142 = !DILocation(line: 24, column: 17, scope: !140)
!143 = !DILocation(line: 24, column: 24, scope: !140)
!144 = !DILocalVariable(name: "din", scope: !140, file: !112, line: 25, type: !98)
!145 = !DILocation(line: 25, column: 24, scope: !140)
!146 = !DILocation(line: 25, column: 30, scope: !140)
!147 = !DILocalVariable(name: "dk", scope: !140, file: !112, line: 26, type: !98)
!148 = !DILocation(line: 26, column: 21, scope: !140)
!149 = !DILocation(line: 26, column: 26, scope: !140)
!150 = !DILocation(line: 27, column: 27, scope: !140)
!151 = !DILocalVariable(name: "dc", scope: !140, file: !112, line: 27, type: !98)
!152 = !DILocation(line: 0, scope: !140)
!153 = !DILocalVariable(name: "c", scope: !140, file: !112, line: 28, type: !62)
!154 = !DILocalVariable(name: "n", scope: !140, file: !112, line: 29, type: !108)
!155 = !DILocalVariable(name: "k", scope: !140, file: !112, line: 30, type: !108)
!156 = !DILocation(line: 31, column: 27, scope: !140)
!157 = !DILocalVariable(name: "clen", scope: !140, file: !112, line: 31, type: !122)
!158 = !DILocation(line: 32, column: 3, scope: !140)
!159 = !DILocation(line: 33, column: 1, scope: !140)
!160 = distinct !DISubprogram(name: "randombytes_set_implementation", scope: !3, file: !3, line: 23, type: !161, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!161 = !DISubroutineType(types: !162)
!162 = !{!52, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!164 = !DILocalVariable(name: "impl", arg: 1, scope: !160, file: !3, line: 23, type: !163)
!165 = !DILocation(line: 0, scope: !160)
!166 = !DILocation(line: 25, column: 20, scope: !160)
!167 = !DILocation(line: 27, column: 5, scope: !160)
!168 = distinct !DISubprogram(name: "randombytes_implementation_name", scope: !3, file: !3, line: 31, type: !24, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!169 = !DILocation(line: 34, column: 12, scope: !168)
!170 = !DILocation(line: 34, column: 28, scope: !168)
!171 = !DILocation(line: 34, column: 5, scope: !168)
!172 = distinct !DISubprogram(name: "randombytes_random", scope: !3, file: !3, line: 41, type: !31, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!173 = !DILocation(line: 44, column: 12, scope: !172)
!174 = !DILocation(line: 44, column: 28, scope: !172)
!175 = !DILocation(line: 44, column: 5, scope: !172)
!176 = distinct !DISubprogram(name: "randombytes_stir", scope: !3, file: !3, line: 53, type: !35, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!177 = !DILocation(line: 56, column: 9, scope: !178)
!178 = distinct !DILexicalBlock(scope: !176, file: !3, line: 56, column: 9)
!179 = !DILocation(line: 56, column: 24, scope: !178)
!180 = !DILocation(line: 56, column: 32, scope: !178)
!181 = !DILocation(line: 56, column: 35, scope: !178)
!182 = !DILocation(line: 56, column: 51, scope: !178)
!183 = !DILocation(line: 56, column: 56, scope: !178)
!184 = !DILocation(line: 56, column: 9, scope: !176)
!185 = !DILocation(line: 57, column: 9, scope: !186)
!186 = distinct !DILexicalBlock(scope: !178, file: !3, line: 56, column: 65)
!187 = !DILocation(line: 57, column: 25, scope: !186)
!188 = !DILocation(line: 58, column: 5, scope: !186)
!189 = !DILocation(line: 87, column: 1, scope: !176)
!190 = distinct !DISubprogram(name: "randombytes_uniform", scope: !3, file: !3, line: 94, type: !39, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!191 = !DILocalVariable(name: "upper_bound", arg: 1, scope: !190, file: !3, line: 94, type: !41)
!192 = !DILocation(line: 0, scope: !190)
!193 = !DILocation(line: 99, column: 9, scope: !194)
!194 = distinct !DILexicalBlock(scope: !190, file: !3, line: 99, column: 9)
!195 = !DILocation(line: 99, column: 24, scope: !194)
!196 = !DILocation(line: 99, column: 32, scope: !194)
!197 = !DILocation(line: 99, column: 35, scope: !194)
!198 = !DILocation(line: 99, column: 51, scope: !194)
!199 = !DILocation(line: 99, column: 59, scope: !194)
!200 = !DILocation(line: 99, column: 9, scope: !190)
!201 = !DILocation(line: 100, column: 16, scope: !202)
!202 = distinct !DILexicalBlock(scope: !194, file: !3, line: 99, column: 68)
!203 = !DILocation(line: 100, column: 32, scope: !202)
!204 = !DILocation(line: 100, column: 9, scope: !202)
!205 = !DILocation(line: 102, column: 21, scope: !206)
!206 = distinct !DILexicalBlock(scope: !190, file: !3, line: 102, column: 9)
!207 = !DILocation(line: 102, column: 9, scope: !190)
!208 = !DILocation(line: 103, column: 9, scope: !209)
!209 = distinct !DILexicalBlock(scope: !206, file: !3, line: 102, column: 26)
!210 = !DILocation(line: 105, column: 23, scope: !190)
!211 = !DILocation(line: 105, column: 36, scope: !190)
!212 = !DILocalVariable(name: "min", scope: !190, file: !3, line: 96, type: !7)
!213 = !DILocation(line: 106, column: 5, scope: !190)
!214 = !DILocation(line: 107, column: 13, scope: !215)
!215 = distinct !DILexicalBlock(scope: !190, file: !3, line: 106, column: 8)
!216 = !DILocalVariable(name: "r", scope: !190, file: !3, line: 97, type: !7)
!217 = !DILocation(line: 108, column: 5, scope: !215)
!218 = !DILocation(line: 108, column: 16, scope: !190)
!219 = distinct !{!219, !213, !220, !221}
!220 = !DILocation(line: 108, column: 21, scope: !190)
!221 = !{!"llvm.loop.mustprogress"}
!222 = !DILocation(line: 110, column: 14, scope: !190)
!223 = !DILocation(line: 110, column: 5, scope: !190)
!224 = !DILocation(line: 111, column: 1, scope: !190)
!225 = distinct !DISubprogram(name: "randombytes_buf", scope: !3, file: !3, line: 114, type: !44, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!226 = !DILocalVariable(name: "buf", arg: 1, scope: !225, file: !3, line: 114, type: !46)
!227 = !DILocation(line: 0, scope: !225)
!228 = !DILocalVariable(name: "size", arg: 2, scope: !225, file: !3, line: 114, type: !47)
!229 = !DILocation(line: 117, column: 14, scope: !230)
!230 = distinct !DILexicalBlock(scope: !225, file: !3, line: 117, column: 9)
!231 = !DILocation(line: 117, column: 9, scope: !225)
!232 = !DILocation(line: 118, column: 9, scope: !233)
!233 = distinct !DILexicalBlock(scope: !230, file: !3, line: 117, column: 29)
!234 = !DILocation(line: 118, column: 25, scope: !233)
!235 = !DILocation(line: 119, column: 5, scope: !233)
!236 = !DILocation(line: 128, column: 1, scope: !225)
!237 = distinct !DISubprogram(name: "randombytes_close", scope: !3, file: !3, line: 131, type: !50, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!238 = !DILocation(line: 133, column: 9, scope: !239)
!239 = distinct !DILexicalBlock(scope: !237, file: !3, line: 133, column: 9)
!240 = !DILocation(line: 133, column: 24, scope: !239)
!241 = !DILocation(line: 133, column: 32, scope: !239)
!242 = !DILocation(line: 133, column: 35, scope: !239)
!243 = !DILocation(line: 133, column: 51, scope: !239)
!244 = !DILocation(line: 133, column: 57, scope: !239)
!245 = !DILocation(line: 133, column: 9, scope: !237)
!246 = !DILocation(line: 134, column: 16, scope: !247)
!247 = distinct !DILexicalBlock(scope: !239, file: !3, line: 133, column: 66)
!248 = !DILocation(line: 134, column: 32, scope: !247)
!249 = !DILocation(line: 134, column: 9, scope: !247)
!250 = !DILocation(line: 136, column: 5, scope: !237)
!251 = !DILocation(line: 0, scope: !237)
!252 = !DILocation(line: 137, column: 1, scope: !237)
!253 = distinct !DISubprogram(name: "randombytes", scope: !3, file: !3, line: 140, type: !254, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !256, !257}
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !122)
!258 = !DILocalVariable(name: "buf", arg: 1, scope: !253, file: !3, line: 140, type: !256)
!259 = !DILocation(line: 0, scope: !253)
!260 = !DILocalVariable(name: "buf_len", arg: 2, scope: !253, file: !3, line: 140, type: !257)
!261 = !DILocation(line: 142, column: 5, scope: !262)
!262 = distinct !DILexicalBlock(scope: !263, file: !3, line: 142, column: 5)
!263 = distinct !DILexicalBlock(scope: !253, file: !3, line: 142, column: 5)
!264 = !DILocation(line: 142, column: 5, scope: !263)
!265 = !DILocation(line: 143, column: 5, scope: !253)
!266 = !DILocation(line: 144, column: 1, scope: !253)
!267 = distinct !DISubprogram(name: "randombytes_sysrandom_implementation_name", scope: !56, file: !56, line: 292, type: !24, scopeLine: 293, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !4)
!268 = !DILocation(line: 294, column: 5, scope: !267)
!269 = distinct !DISubprogram(name: "randombytes_sysrandom", scope: !56, file: !56, line: 249, type: !31, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !4)
!270 = !DILocalVariable(name: "r", scope: !269, file: !56, line: 251, type: !7)
!271 = !DILocation(line: 251, column: 14, scope: !269)
!272 = !DILocation(line: 253, column: 31, scope: !269)
!273 = !DILocation(line: 253, column: 5, scope: !269)
!274 = !DILocation(line: 255, column: 12, scope: !269)
!275 = !DILocation(line: 255, column: 5, scope: !269)
!276 = distinct !DISubprogram(name: "randombytes_sysrandom_stir", scope: !56, file: !56, line: 206, type: !35, scopeLine: 207, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !4)
!277 = !DILocation(line: 208, column: 16, scope: !278)
!278 = distinct !DILexicalBlock(scope: !276, file: !56, line: 208, column: 9)
!279 = !DILocation(line: 208, column: 28, scope: !278)
!280 = !DILocation(line: 208, column: 9, scope: !276)
!281 = !DILocation(line: 209, column: 9, scope: !282)
!282 = distinct !DILexicalBlock(scope: !278, file: !56, line: 208, column: 34)
!283 = !DILocation(line: 210, column: 28, scope: !282)
!284 = !DILocation(line: 211, column: 5, scope: !282)
!285 = !DILocation(line: 212, column: 1, scope: !276)
!286 = distinct !DISubprogram(name: "randombytes_sysrandom_buf", scope: !56, file: !56, line: 259, type: !44, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !4)
!287 = !DILocalVariable(name: "buf", arg: 1, scope: !286, file: !56, line: 259, type: !46)
!288 = !DILocation(line: 0, scope: !286)
!289 = !DILocalVariable(name: "size", arg: 2, scope: !286, file: !56, line: 259, type: !47)
!290 = !DILocation(line: 261, column: 5, scope: !286)
!291 = !DILocation(line: 268, column: 16, scope: !292)
!292 = distinct !DILexicalBlock(scope: !286, file: !56, line: 268, column: 9)
!293 = !DILocation(line: 268, column: 36, scope: !292)
!294 = !DILocation(line: 268, column: 9, scope: !286)
!295 = !DILocation(line: 269, column: 13, scope: !296)
!296 = distinct !DILexicalBlock(scope: !297, file: !56, line: 269, column: 13)
!297 = distinct !DILexicalBlock(scope: !292, file: !56, line: 268, column: 42)
!298 = !DILocation(line: 269, column: 52, scope: !296)
!299 = !DILocation(line: 269, column: 13, scope: !297)
!300 = !DILocation(line: 270, column: 13, scope: !301)
!301 = distinct !DILexicalBlock(scope: !296, file: !56, line: 269, column: 58)
!302 = !DILocation(line: 272, column: 9, scope: !297)
!303 = !DILocation(line: 275, column: 16, scope: !304)
!304 = distinct !DILexicalBlock(scope: !286, file: !56, line: 275, column: 9)
!305 = !DILocation(line: 275, column: 38, scope: !304)
!306 = !DILocation(line: 275, column: 44, scope: !304)
!307 = !DILocation(line: 276, column: 26, scope: !304)
!308 = !DILocation(line: 276, column: 9, scope: !304)
!309 = !DILocation(line: 276, column: 60, scope: !304)
!310 = !DILocation(line: 275, column: 9, scope: !286)
!311 = !DILocation(line: 277, column: 9, scope: !312)
!312 = distinct !DILexicalBlock(scope: !304, file: !56, line: 276, column: 79)
!313 = !DILocation(line: 287, column: 1, scope: !286)
!314 = distinct !DISubprogram(name: "randombytes_sysrandom_close", scope: !56, file: !56, line: 223, type: !50, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !4)
!315 = !DILocalVariable(name: "ret", scope: !314, file: !56, line: 225, type: !52)
!316 = !DILocation(line: 0, scope: !314)
!317 = !DILocation(line: 228, column: 16, scope: !318)
!318 = distinct !DILexicalBlock(scope: !314, file: !56, line: 228, column: 9)
!319 = !DILocation(line: 228, column: 38, scope: !318)
!320 = !DILocation(line: 228, column: 44, scope: !318)
!321 = !DILocation(line: 229, column: 22, scope: !318)
!322 = !DILocation(line: 229, column: 9, scope: !318)
!323 = !DILocation(line: 229, column: 45, scope: !318)
!324 = !DILocation(line: 228, column: 9, scope: !314)
!325 = !DILocation(line: 230, column: 38, scope: !326)
!326 = distinct !DILexicalBlock(scope: !318, file: !56, line: 229, column: 51)
!327 = !DILocation(line: 231, column: 28, scope: !326)
!328 = !DILocation(line: 233, column: 5, scope: !326)
!329 = !DILocation(line: 235, column: 16, scope: !330)
!330 = distinct !DILexicalBlock(scope: !314, file: !56, line: 235, column: 9)
!331 = !DILocation(line: 235, column: 36, scope: !330)
!332 = !DILocation(line: 235, column: 9, scope: !314)
!333 = !DILocation(line: 237, column: 5, scope: !334)
!334 = distinct !DILexicalBlock(scope: !330, file: !56, line: 235, column: 42)
!335 = !DILocation(line: 245, column: 5, scope: !314)
!336 = distinct !DISubprogram(name: "randombytes_sysrandom_stir_if_needed", scope: !56, file: !56, line: 215, type: !35, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !4)
!337 = !DILocation(line: 217, column: 16, scope: !338)
!338 = distinct !DILexicalBlock(scope: !336, file: !56, line: 217, column: 9)
!339 = !DILocation(line: 217, column: 28, scope: !338)
!340 = !DILocation(line: 217, column: 9, scope: !336)
!341 = !DILocation(line: 218, column: 9, scope: !342)
!342 = distinct !DILexicalBlock(scope: !338, file: !56, line: 217, column: 34)
!343 = !DILocation(line: 219, column: 5, scope: !342)
!344 = !DILocation(line: 220, column: 1, scope: !336)
!345 = distinct !DISubprogram(name: "randombytes_linux_getrandom", scope: !56, file: !56, line: 151, type: !346, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !4)
!346 = !DISubroutineType(types: !347)
!347 = !{!52, !46, !12}
!348 = !DILocalVariable(name: "buf_", arg: 1, scope: !345, file: !56, line: 151, type: !46)
!349 = !DILocation(line: 0, scope: !345)
!350 = !DILocalVariable(name: "size", arg: 2, scope: !345, file: !56, line: 151, type: !12)
!351 = !DILocalVariable(name: "buf", scope: !345, file: !56, line: 153, type: !62)
!352 = !DILocalVariable(name: "chunk_size", scope: !345, file: !56, line: 154, type: !12)
!353 = !DILocation(line: 156, column: 5, scope: !345)
!354 = !DILocation(line: 157, column: 18, scope: !355)
!355 = distinct !DILexicalBlock(scope: !356, file: !56, line: 157, column: 13)
!356 = distinct !DILexicalBlock(scope: !345, file: !56, line: 156, column: 8)
!357 = !DILocation(line: 157, column: 13, scope: !356)
!358 = !DILocation(line: 159, column: 13, scope: !359)
!359 = distinct !DILexicalBlock(scope: !360, file: !56, line: 159, column: 13)
!360 = distinct !DILexicalBlock(scope: !361, file: !56, line: 159, column: 13)
!361 = distinct !DILexicalBlock(scope: !355, file: !56, line: 157, column: 32)
!362 = !DILocation(line: 159, column: 13, scope: !360)
!363 = !DILocation(line: 160, column: 9, scope: !361)
!364 = !DILocation(line: 161, column: 13, scope: !365)
!365 = distinct !DILexicalBlock(scope: !356, file: !56, line: 161, column: 13)
!366 = !DILocation(line: 161, column: 59, scope: !365)
!367 = !DILocation(line: 161, column: 13, scope: !356)
!368 = !DILocation(line: 162, column: 13, scope: !369)
!369 = distinct !DILexicalBlock(scope: !365, file: !56, line: 161, column: 65)
!370 = !DILocation(line: 164, column: 14, scope: !356)
!371 = !DILocation(line: 165, column: 13, scope: !356)
!372 = !DILocation(line: 166, column: 5, scope: !356)
!373 = !DILocation(line: 166, column: 19, scope: !345)
!374 = distinct !{!374, !353, !375, !221}
!375 = !DILocation(line: 166, column: 32, scope: !345)
!376 = !DILocation(line: 168, column: 5, scope: !345)
!377 = !DILocation(line: 169, column: 1, scope: !345)
!378 = distinct !DISubprogram(name: "safe_read", scope: !56, file: !56, line: 77, type: !379, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !4)
!379 = !DISubroutineType(types: !380)
!380 = !{!58, !381, !46, !12}
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!382 = !DILocalVariable(name: "fd", arg: 1, scope: !378, file: !56, line: 77, type: !381)
!383 = !DILocation(line: 0, scope: !378)
!384 = !DILocalVariable(name: "buf_", arg: 2, scope: !378, file: !56, line: 77, type: !46)
!385 = !DILocalVariable(name: "size", arg: 3, scope: !378, file: !56, line: 77, type: !12)
!386 = !DILocalVariable(name: "buf", scope: !378, file: !56, line: 79, type: !62)
!387 = !DILocation(line: 82, column: 5, scope: !388)
!388 = distinct !DILexicalBlock(scope: !389, file: !56, line: 82, column: 5)
!389 = distinct !DILexicalBlock(scope: !378, file: !56, line: 82, column: 5)
!390 = !DILocation(line: 82, column: 5, scope: !389)
!391 = !DILocation(line: 83, column: 5, scope: !378)
!392 = !DILocation(line: 84, column: 9, scope: !393)
!393 = distinct !DILexicalBlock(scope: !378, file: !56, line: 83, column: 8)
!394 = !DILocation(line: 84, column: 26, scope: !393)
!395 = !DILocalVariable(name: "readnb", scope: !378, file: !56, line: 80, type: !58)
!396 = !DILocation(line: 84, column: 47, scope: !393)
!397 = !DILocation(line: 84, column: 61, scope: !393)
!398 = !DILocation(line: 85, column: 17, scope: !393)
!399 = !DILocation(line: 85, column: 23, scope: !393)
!400 = !DILocation(line: 85, column: 32, scope: !393)
!401 = !DILocation(line: 85, column: 35, scope: !393)
!402 = !DILocation(line: 85, column: 41, scope: !393)
!403 = !DILocation(line: 0, scope: !393)
!404 = distinct !{!404, !392, !405, !221}
!405 = !DILocation(line: 85, column: 52, scope: !393)
!406 = !DILocation(line: 86, column: 20, scope: !407)
!407 = distinct !DILexicalBlock(scope: !393, file: !56, line: 86, column: 13)
!408 = !DILocation(line: 86, column: 13, scope: !393)
!409 = !DILocation(line: 87, column: 13, scope: !410)
!410 = distinct !DILexicalBlock(scope: !407, file: !56, line: 86, column: 35)
!411 = !DILocation(line: 89, column: 20, scope: !412)
!412 = distinct !DILexicalBlock(scope: !393, file: !56, line: 89, column: 13)
!413 = !DILocation(line: 89, column: 13, scope: !393)
!414 = !DILocation(line: 90, column: 13, scope: !415)
!415 = distinct !DILexicalBlock(scope: !412, file: !56, line: 89, column: 36)
!416 = !DILocation(line: 92, column: 14, scope: !393)
!417 = !DILocation(line: 93, column: 13, scope: !393)
!418 = !DILocation(line: 94, column: 5, scope: !393)
!419 = !DILocation(line: 94, column: 19, scope: !378)
!420 = distinct !{!420, !391, !421, !221}
!421 = !DILocation(line: 94, column: 32, scope: !378)
!422 = !DILocation(line: 96, column: 27, scope: !378)
!423 = !DILocation(line: 96, column: 5, scope: !378)
!424 = !DILocation(line: 97, column: 1, scope: !378)
!425 = distinct !DISubprogram(name: "_randombytes_linux_getrandom", scope: !56, file: !56, line: 138, type: !426, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !4)
!426 = !DISubroutineType(types: !427)
!427 = !{!52, !46, !47}
!428 = !DILocalVariable(name: "buf", arg: 1, scope: !425, file: !56, line: 138, type: !46)
!429 = !DILocation(line: 0, scope: !425)
!430 = !DILocalVariable(name: "size", arg: 2, scope: !425, file: !56, line: 138, type: !47)
!431 = !DILocation(line: 142, column: 5, scope: !432)
!432 = distinct !DILexicalBlock(scope: !433, file: !56, line: 142, column: 5)
!433 = distinct !DILexicalBlock(scope: !425, file: !56, line: 142, column: 5)
!434 = !DILocation(line: 142, column: 5, scope: !433)
!435 = !DILocation(line: 143, column: 5, scope: !425)
!436 = !DILocation(line: 144, column: 46, scope: !437)
!437 = distinct !DILexicalBlock(scope: !425, file: !56, line: 143, column: 8)
!438 = !DILocation(line: 144, column: 18, scope: !437)
!439 = !DILocalVariable(name: "readnb", scope: !425, file: !56, line: 140, type: !52)
!440 = !DILocation(line: 145, column: 5, scope: !437)
!441 = !DILocation(line: 145, column: 21, scope: !425)
!442 = !DILocation(line: 145, column: 25, scope: !425)
!443 = !DILocation(line: 145, column: 29, scope: !425)
!444 = !DILocation(line: 145, column: 35, scope: !425)
!445 = !DILocation(line: 145, column: 44, scope: !425)
!446 = !DILocation(line: 145, column: 47, scope: !425)
!447 = !DILocation(line: 145, column: 53, scope: !425)
!448 = distinct !{!448, !435, !449, !221}
!449 = !DILocation(line: 145, column: 63, scope: !425)
!450 = !DILocation(line: 147, column: 23, scope: !425)
!451 = !DILocation(line: 147, column: 20, scope: !425)
!452 = !DILocation(line: 147, column: 35, scope: !425)
!453 = !DILocation(line: 147, column: 5, scope: !425)
!454 = distinct !DISubprogram(name: "randombytes_sysrandom_init", scope: !56, file: !56, line: 173, type: !35, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !55, retainedNodes: !4)
!455 = !DILocation(line: 175, column: 32, scope: !454)
!456 = !DILocalVariable(name: "errno_save", scope: !454, file: !56, line: 175, type: !381)
!457 = !DILocation(line: 0, scope: !454)
!458 = !DILocalVariable(name: "fodder", scope: !459, file: !56, line: 179, type: !110)
!459 = distinct !DILexicalBlock(scope: !454, file: !56, line: 178, column: 5)
!460 = !DILocation(line: 179, column: 16, scope: !459)
!461 = !DILocation(line: 181, column: 34, scope: !462)
!462 = distinct !DILexicalBlock(scope: !459, file: !56, line: 181, column: 6)
!463 = !DILocation(line: 181, column: 6, scope: !462)
!464 = !DILocation(line: 181, column: 57, scope: !462)
!465 = !DILocation(line: 181, column: 6, scope: !459)
!466 = !DILocation(line: 182, column: 33, scope: !467)
!467 = distinct !DILexicalBlock(scope: !462, file: !56, line: 181, column: 63)
!468 = !DILocation(line: 183, column: 6, scope: !467)
!469 = !DILocation(line: 183, column: 12, scope: !467)
!470 = !DILocation(line: 184, column: 6, scope: !467)
!471 = !DILocation(line: 186, column: 29, scope: !459)
!472 = !DILocation(line: 191, column: 10, scope: !473)
!473 = distinct !DILexicalBlock(scope: !454, file: !56, line: 190, column: 9)
!474 = !DILocation(line: 190, column: 39, scope: !473)
!475 = !DILocation(line: 191, column: 51, scope: !473)
!476 = !DILocation(line: 190, column: 9, scope: !454)
!477 = !DILocation(line: 192, column: 9, scope: !478)
!478 = distinct !DILexicalBlock(scope: !473, file: !56, line: 191, column: 58)
!479 = !DILocation(line: 194, column: 5, scope: !454)
!480 = !DILocation(line: 194, column: 11, scope: !454)
!481 = !DILocation(line: 195, column: 1, scope: !454)
!482 = !DILocalVariable(name: "st", scope: !75, file: !56, line: 105, type: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !484, line: 46, size: 1152, elements: !485)
!484 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!485 = !{!486, !488, !490, !492, !494, !496, !498, !499, !500, !502, !504, !506, !514, !515, !516}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !483, file: !484, line: 48, baseType: !487, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !10, line: 145, baseType: !14)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !483, file: !484, line: 53, baseType: !489, size: 64, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !10, line: 148, baseType: !14)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !483, file: !484, line: 61, baseType: !491, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !10, line: 151, baseType: !14)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !483, file: !484, line: 62, baseType: !493, size: 32, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !10, line: 150, baseType: !11)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !483, file: !484, line: 64, baseType: !495, size: 32, offset: 224)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !10, line: 146, baseType: !11)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !483, file: !484, line: 65, baseType: !497, size: 32, offset: 256)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !10, line: 147, baseType: !11)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !483, file: !484, line: 67, baseType: !52, size: 32, offset: 288)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !483, file: !484, line: 69, baseType: !487, size: 64, offset: 320)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !483, file: !484, line: 74, baseType: !501, size: 64, offset: 384)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !10, line: 152, baseType: !61)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !483, file: !484, line: 78, baseType: !503, size: 64, offset: 448)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !10, line: 174, baseType: !61)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !483, file: !484, line: 80, baseType: !505, size: 64, offset: 512)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !10, line: 179, baseType: !61)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !483, file: !484, line: 91, baseType: !507, size: 128, offset: 576)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !508, line: 10, size: 128, elements: !509)
!508 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!509 = !{!510, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !507, file: !508, line: 12, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !10, line: 160, baseType: !61)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !507, file: !508, line: 16, baseType: !513, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !10, line: 196, baseType: !61)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !483, file: !484, line: 92, baseType: !507, size: 128, offset: 704)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !483, file: !484, line: 93, baseType: !507, size: 128, offset: 832)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !483, file: !484, line: 106, baseType: !517, size: 192, offset: 960)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 192, elements: !77)
!518 = !DILocation(line: 105, column: 24, scope: !75)
!519 = !DILocalVariable(name: "device", scope: !75, file: !56, line: 112, type: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!521 = !DILocation(line: 0, scope: !75)
!522 = !DILocation(line: 115, column: 5, scope: !75)
!523 = !DILocation(line: 116, column: 19, scope: !524)
!524 = distinct !DILexicalBlock(scope: !75, file: !56, line: 115, column: 8)
!525 = !DILocation(line: 116, column: 14, scope: !524)
!526 = !DILocalVariable(name: "fd", scope: !75, file: !56, line: 113, type: !52)
!527 = !DILocation(line: 117, column: 16, scope: !528)
!528 = distinct !DILexicalBlock(scope: !524, file: !56, line: 117, column: 13)
!529 = !DILocation(line: 117, column: 13, scope: !524)
!530 = !DILocation(line: 118, column: 17, scope: !531)
!531 = distinct !DILexicalBlock(scope: !532, file: !56, line: 118, column: 17)
!532 = distinct !DILexicalBlock(scope: !528, file: !56, line: 117, column: 23)
!533 = !DILocation(line: 118, column: 32, scope: !531)
!534 = !DILocation(line: 118, column: 37, scope: !531)
!535 = !DILocation(line: 118, column: 40, scope: !531)
!536 = !DILocation(line: 118, column: 17, scope: !532)
!537 = !DILocation(line: 120, column: 43, scope: !538)
!538 = distinct !DILexicalBlock(scope: !531, file: !56, line: 118, column: 61)
!539 = !DILocation(line: 120, column: 62, scope: !538)
!540 = !DILocation(line: 120, column: 24, scope: !538)
!541 = !DILocation(line: 122, column: 17, scope: !538)
!542 = !DILocation(line: 124, column: 20, scope: !532)
!543 = !DILocation(line: 125, column: 9, scope: !532)
!544 = !DILocation(line: 125, column: 20, scope: !545)
!545 = distinct !DILexicalBlock(scope: !528, file: !56, line: 125, column: 20)
!546 = !DILocation(line: 125, column: 26, scope: !545)
!547 = !DILocation(line: 125, column: 20, scope: !528)
!548 = !DILocation(line: 126, column: 13, scope: !549)
!549 = distinct !DILexicalBlock(scope: !545, file: !56, line: 125, column: 36)
!550 = !DILocation(line: 128, column: 15, scope: !524)
!551 = !DILocation(line: 129, column: 5, scope: !524)
!552 = !DILocation(line: 129, column: 14, scope: !75)
!553 = !DILocation(line: 129, column: 22, scope: !75)
!554 = distinct !{!554, !522, !555, !221}
!555 = !DILocation(line: 129, column: 29, scope: !75)
!556 = !DILocation(line: 131, column: 5, scope: !75)
!557 = !DILocation(line: 131, column: 11, scope: !75)
!558 = !DILocation(line: 132, column: 5, scope: !75)
!559 = !DILocation(line: 134, column: 1, scope: !75)
!560 = distinct !DISubprogram(name: "crypto_stream_chacha20_keybytes", scope: !114, file: !114, line: 5, type: !561, scopeLine: 5, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !113, retainedNodes: !4)
!561 = !DISubroutineType(types: !562)
!562 = !{!12}
!563 = !DILocation(line: 6, column: 5, scope: !560)
!564 = distinct !DISubprogram(name: "crypto_stream_chacha20_noncebytes", scope: !114, file: !114, line: 10, type: !561, scopeLine: 10, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !113, retainedNodes: !4)
!565 = !DILocation(line: 11, column: 5, scope: !564)
!566 = distinct !DISubprogram(name: "crypto_stream_chacha20", scope: !114, file: !114, line: 15, type: !120, scopeLine: 17, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !113, retainedNodes: !4)
!567 = !DILocalVariable(name: "c", arg: 1, scope: !566, file: !114, line: 15, type: !62)
!568 = !DILocation(line: 0, scope: !566)
!569 = !DILocalVariable(name: "clen", arg: 2, scope: !566, file: !114, line: 15, type: !122)
!570 = !DILocalVariable(name: "n", arg: 3, scope: !566, file: !114, line: 16, type: !108)
!571 = !DILocalVariable(name: "k", arg: 4, scope: !566, file: !114, line: 16, type: !108)
!572 = !DILocation(line: 18, column: 12, scope: !566)
