; ModuleID = 'crypto_stream_chacha20-k.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.randombytes_implementation = type { i8* ()*, i32 ()*, void ()*, i32 (i32)*, void (i8*, i64)*, i32 ()* }
%struct.SysRandom_ = type { i32, i32, i32 }
%struct.smack_value = type { i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.chacha_ctx = type { [16 x i32] }

@implementation = internal global %struct.randombytes_implementation* @randombytes_sysrandom_implementation, align 8, !dbg !0, !psr.id !53
@.str = private unnamed_addr constant [20 x i8] c"buf_len <= SIZE_MAX\00", align 1, !psr.id !54
@.str.1 = private unnamed_addr constant [53 x i8] c"../libsodium/src/libsodium/randombytes/randombytes.c\00", align 1, !psr.id !55
@__PRETTY_FUNCTION__.randombytes = private unnamed_addr constant [65 x i8] c"void randombytes(unsigned char *const, const unsigned long long)\00", align 1, !psr.id !56

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "implementation", scope: !2, file: !3, line: 16, type: !16, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../libsodium/src/libsodium/randombytes/randombytes.c", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!4 = !{}
!5 = !{!6, !7, !12}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 26, baseType: !9)
!8 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 42, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 46, baseType: !14)
!13 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!14 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!15 = !{!0}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "randombytes_implementation", file: !19, line: 26, baseType: !20)
!19 = !DIFile(filename: "../libsodium/src/libsodium/include/sodium/randombytes.h", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "randombytes_implementation", file: !19, line: 19, size: 384, elements: !21)
!21 = !{!22, !29, !33, !37, !42, !48}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "implementation_name", scope: !20, file: !19, line: 20, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DISubroutineType(types: !25)
!25 = !{!26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "random", scope: !20, file: !19, line: 21, baseType: !30, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DISubroutineType(types: !32)
!32 = !{!7}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "stir", scope: !20, file: !19, line: 22, baseType: !34, size: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = !DISubroutineType(types: !36)
!36 = !{null}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "uniform", scope: !20, file: !19, line: 23, baseType: !38, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{!7, !41}
!41 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !20, file: !19, line: 24, baseType: !43, size: 64, offset: 256)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46, !47}
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !20, file: !19, line: 25, baseType: !49, size: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DISubroutineType(types: !51)
!51 = !{!52}
!52 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!53 = !{!"0"}
!54 = !{!"1"}
!55 = !{!"2"}
!56 = !{!"3"}
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "randombytes_sysrandom_implementation", scope: !59, file: !60, line: 297, type: !83, isLocal: false, isDefinition: true)
!59 = distinct !DICompileUnit(language: DW_LANG_C99, file: !60, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !61, globals: !68, splitDebugInlining: false, nameTableKind: None)
!60 = !DIFile(filename: "../libsodium/src/libsodium/randombytes/sysrandom/randombytes_sysrandom.c", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!61 = !{!62, !6, !66, !12, !52}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !63, line: 108, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !10, line: 193, baseType: !65)
!65 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!68 = !{!57, !69, !77}
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "stream", scope: !59, file: !60, line: 69, type: !71, isLocal: true, isDefinition: true)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysRandom", file: !60, line: 67, baseType: !72)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SysRandom_", file: !60, line: 63, size: 96, elements: !73)
!73 = !{!74, !75, !76}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "random_data_source_fd", scope: !72, file: !60, line: 64, baseType: !52, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !72, file: !60, line: 65, baseType: !52, size: 32, offset: 32)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "getrandom_available", scope: !72, file: !60, line: 66, baseType: !52, size: 32, offset: 64)
!77 = !DIGlobalVariableExpression(var: !78, expr: !DIExpression())
!78 = distinct !DIGlobalVariable(name: "devices", scope: !79, file: !60, line: 106, type: !80, isLocal: true, isDefinition: true)
!79 = distinct !DISubprogram(name: "randombytes_sysrandom_random_dev_open", scope: !60, file: !60, line: 102, type: !50, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, retainedNodes: !4)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !26, size: 192, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 3)
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "randombytes_implementation", file: !19, line: 19, size: 384, elements: !84)
!84 = !{!85, !86, !87, !88, !89, !90}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "implementation_name", scope: !83, file: !19, line: 20, baseType: !23, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "random", scope: !83, file: !19, line: 21, baseType: !30, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "stir", scope: !83, file: !19, line: 22, baseType: !34, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "uniform", scope: !83, file: !19, line: 23, baseType: !38, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !83, file: !19, line: 24, baseType: !43, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !83, file: !19, line: 25, baseType: !49, size: 64, offset: 320)
!91 = !{!"4"}
!92 = !{!"5"}
!93 = !{!"6"}
!94 = !{!"7"}
!95 = !{!"8"}
!96 = !{!"9"}
!97 = !{!"10"}
!98 = !{!"11"}
!99 = !{!"12"}
!100 = !{!"13"}
!101 = !{!"14"}
!102 = !{!"15"}
!103 = !{!"16"}
!104 = !DIGlobalVariableExpression(var: !105, expr: !DIExpression())
!105 = distinct !DIGlobalVariable(name: "sigma", scope: !106, file: !107, line: 60, type: !114, isLocal: true, isDefinition: true)
!106 = distinct !DICompileUnit(language: DW_LANG_C99, file: !107, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !108, globals: !113, splitDebugInlining: false, nameTableKind: None)
!107 = !DIFile(filename: "../libsodium/src/libsodium/crypto_stream/chacha20/ref/stream_chacha20_ref.c", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!108 = !{!109, !110, !6, !11}
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !107, line: 22, baseType: !7)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !107, line: 21, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 24, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 38, baseType: !67)
!113 = !{!104}
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 128, elements: !116)
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!116 = !{!117}
!117 = !DISubrange(count: 16)
!118 = !{!"17"}
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "canary", scope: !121, file: !122, line: 46, type: !128, isLocal: true, isDefinition: true)
!121 = distinct !DICompileUnit(language: DW_LANG_C99, file: !122, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !123, globals: !127, splitDebugInlining: false, nameTableKind: None)
!122 = !DIFile(filename: "../libsodium/src/libsodium/sodium/utils.c", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!123 = !{!124, !12, !126, !67, !52, !28, !6}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !67)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!127 = !{!119}
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 128, elements: !116)
!129 = !{!"18"}
!130 = distinct !DICompileUnit(language: DW_LANG_C99, file: !131, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!131 = !DIFile(filename: "crypto_stream_chacha20.c", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!132 = distinct !DICompileUnit(language: DW_LANG_C99, file: !133, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!133 = !DIFile(filename: "../libsodium/src/libsodium/crypto_stream/chacha20/stream_chacha20_api.c", directory: "/home/luwei/bech-back/libsodium/ChaCha20")
!134 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!135 = !{i32 7, !"Dwarf Version", i32 4}
!136 = !{i32 2, !"Debug Info Version", i32 3}
!137 = !{i32 1, !"wchar_size", i32 4}
!138 = distinct !DISubprogram(name: "crypto_stream_chacha20_wrapper", scope: !131, file: !131, line: 5, type: !139, scopeLine: 6, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !130, retainedNodes: !4)
!139 = !DISubroutineType(types: !140)
!140 = !{!52, !66, !141, !126, !126}
!141 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!142 = !DILocalVariable(name: "c", arg: 1, scope: !138, file: !131, line: 5, type: !66)
!143 = !DILocation(line: 0, scope: !138)
!144 = !{!"19"}
!145 = !DILocalVariable(name: "clen", arg: 2, scope: !138, file: !131, line: 5, type: !141)
!146 = !{!"20"}
!147 = !DILocalVariable(name: "n", arg: 3, scope: !138, file: !131, line: 6, type: !126)
!148 = !{!"21"}
!149 = !DILocalVariable(name: "k", arg: 4, scope: !138, file: !131, line: 6, type: !126)
!150 = !{!"22"}
!151 = !DILocation(line: 7, column: 13, scope: !138)
!152 = !{!"23"}
!153 = !DILocation(line: 7, column: 3, scope: !138)
!154 = !{!"24"}
!155 = !DILocation(line: 8, column: 13, scope: !138)
!156 = !{!"25"}
!157 = !DILocation(line: 8, column: 3, scope: !138)
!158 = !{!"26"}
!159 = !DILocation(line: 9, column: 13, scope: !138)
!160 = !{!"27"}
!161 = !DILocation(line: 9, column: 3, scope: !138)
!162 = !{!"28"}
!163 = !DILocation(line: 10, column: 13, scope: !138)
!164 = !{!"29"}
!165 = !DILocation(line: 10, column: 3, scope: !138)
!166 = !{!"30"}
!167 = !DILocation(line: 12, column: 13, scope: !138)
!168 = !{!"31"}
!169 = !DILocation(line: 12, column: 3, scope: !138)
!170 = !{!"32"}
!171 = !DILocation(line: 14, column: 10, scope: !138)
!172 = !{!"33"}
!173 = !DILocation(line: 14, column: 3, scope: !138)
!174 = !{!"34"}
!175 = distinct !DISubprogram(name: "crypto_stream_chacha20_wrapper_t", scope: !131, file: !131, line: 22, type: !35, scopeLine: 23, spFlags: DISPFlagDefinition, unit: !130, retainedNodes: !4)
!176 = !{!"35"}
!177 = !{!"36"}
!178 = !{!"37"}
!179 = !DILocalVariable(name: "dout", scope: !175, file: !131, line: 24, type: !67)
!180 = !DILocation(line: 24, column: 17, scope: !175)
!181 = !{!"38"}
!182 = !DILocation(line: 24, column: 24, scope: !175)
!183 = !{!"39"}
!184 = !{!"40"}
!185 = !DILocalVariable(name: "din", scope: !175, file: !131, line: 25, type: !115)
!186 = !DILocation(line: 25, column: 24, scope: !175)
!187 = !{!"41"}
!188 = !DILocation(line: 25, column: 30, scope: !175)
!189 = !{!"42"}
!190 = !{!"43"}
!191 = !DILocalVariable(name: "dk", scope: !175, file: !131, line: 26, type: !115)
!192 = !DILocation(line: 26, column: 21, scope: !175)
!193 = !{!"44"}
!194 = !DILocation(line: 26, column: 26, scope: !175)
!195 = !{!"45"}
!196 = !{!"46"}
!197 = !DILocation(line: 27, column: 27, scope: !175)
!198 = !{!"47"}
!199 = !DILocalVariable(name: "dc", scope: !175, file: !131, line: 27, type: !115)
!200 = !DILocation(line: 0, scope: !175)
!201 = !{!"48"}
!202 = !DILocalVariable(name: "c", scope: !175, file: !131, line: 28, type: !66)
!203 = !{!"49"}
!204 = !DILocalVariable(name: "n", scope: !175, file: !131, line: 29, type: !126)
!205 = !{!"50"}
!206 = !DILocalVariable(name: "k", scope: !175, file: !131, line: 30, type: !126)
!207 = !{!"51"}
!208 = !DILocation(line: 31, column: 27, scope: !175)
!209 = !{!"52"}
!210 = !DILocalVariable(name: "clen", scope: !175, file: !131, line: 31, type: !141)
!211 = !{!"53"}
!212 = !DILocation(line: 32, column: 3, scope: !175)
!213 = !{!"54"}
!214 = !DILocation(line: 33, column: 1, scope: !175)
!215 = !{!"55"}
!216 = distinct !DISubprogram(name: "randombytes_set_implementation", scope: !3, file: !3, line: 23, type: !217, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!217 = !DISubroutineType(types: !218)
!218 = !{!52, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!220 = !DILocalVariable(name: "impl", arg: 1, scope: !216, file: !3, line: 23, type: !219)
!221 = !DILocation(line: 0, scope: !216)
!222 = !{!"56"}
!223 = !DILocation(line: 25, column: 20, scope: !216)
!224 = !{!"57"}
!225 = !DILocation(line: 27, column: 5, scope: !216)
!226 = !{!"58"}
!227 = distinct !DISubprogram(name: "randombytes_implementation_name", scope: !3, file: !3, line: 31, type: !24, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!228 = !DILocation(line: 34, column: 12, scope: !227)
!229 = !{!"59"}
!230 = !DILocation(line: 34, column: 28, scope: !227)
!231 = !{!"60"}
!232 = !{!"61"}
!233 = !{!"62"}
!234 = !DILocation(line: 34, column: 5, scope: !227)
!235 = !{!"63"}
!236 = distinct !DISubprogram(name: "randombytes_random", scope: !3, file: !3, line: 41, type: !31, scopeLine: 42, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!237 = !DILocation(line: 44, column: 12, scope: !236)
!238 = !{!"64"}
!239 = !DILocation(line: 44, column: 28, scope: !236)
!240 = !{!"65"}
!241 = !{!"66"}
!242 = !{!"67"}
!243 = !DILocation(line: 44, column: 5, scope: !236)
!244 = !{!"68"}
!245 = distinct !DISubprogram(name: "randombytes_stir", scope: !3, file: !3, line: 53, type: !35, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!246 = !DILocation(line: 56, column: 9, scope: !247)
!247 = distinct !DILexicalBlock(scope: !245, file: !3, line: 56, column: 9)
!248 = !{!"69"}
!249 = !DILocation(line: 56, column: 24, scope: !247)
!250 = !{!"70"}
!251 = !DILocation(line: 56, column: 32, scope: !247)
!252 = !{!"71"}
!253 = !DILocation(line: 56, column: 35, scope: !247)
!254 = !{!"72"}
!255 = !DILocation(line: 56, column: 51, scope: !247)
!256 = !{!"73"}
!257 = !{!"74"}
!258 = !DILocation(line: 56, column: 56, scope: !247)
!259 = !{!"75"}
!260 = !DILocation(line: 56, column: 9, scope: !245)
!261 = !{!"76"}
!262 = !DILocation(line: 57, column: 9, scope: !263)
!263 = distinct !DILexicalBlock(scope: !247, file: !3, line: 56, column: 65)
!264 = !{!"77"}
!265 = !DILocation(line: 57, column: 25, scope: !263)
!266 = !{!"78"}
!267 = !{!"79"}
!268 = !{!"80"}
!269 = !DILocation(line: 58, column: 5, scope: !263)
!270 = !{!"81"}
!271 = !DILocation(line: 87, column: 1, scope: !245)
!272 = !{!"82"}
!273 = distinct !DISubprogram(name: "randombytes_uniform", scope: !3, file: !3, line: 94, type: !39, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!274 = !DILocalVariable(name: "upper_bound", arg: 1, scope: !273, file: !3, line: 94, type: !41)
!275 = !DILocation(line: 0, scope: !273)
!276 = !{!"83"}
!277 = !DILocation(line: 99, column: 9, scope: !278)
!278 = distinct !DILexicalBlock(scope: !273, file: !3, line: 99, column: 9)
!279 = !{!"84"}
!280 = !DILocation(line: 99, column: 24, scope: !278)
!281 = !{!"85"}
!282 = !DILocation(line: 99, column: 32, scope: !278)
!283 = !{!"86"}
!284 = !DILocation(line: 99, column: 35, scope: !278)
!285 = !{!"87"}
!286 = !DILocation(line: 99, column: 51, scope: !278)
!287 = !{!"88"}
!288 = !{!"89"}
!289 = !DILocation(line: 99, column: 59, scope: !278)
!290 = !{!"90"}
!291 = !DILocation(line: 99, column: 9, scope: !273)
!292 = !{!"91"}
!293 = !DILocation(line: 100, column: 16, scope: !294)
!294 = distinct !DILexicalBlock(scope: !278, file: !3, line: 99, column: 68)
!295 = !{!"92"}
!296 = !DILocation(line: 100, column: 32, scope: !294)
!297 = !{!"93"}
!298 = !{!"94"}
!299 = !{!"95"}
!300 = !DILocation(line: 100, column: 9, scope: !294)
!301 = !{!"96"}
!302 = !DILocation(line: 102, column: 21, scope: !303)
!303 = distinct !DILexicalBlock(scope: !273, file: !3, line: 102, column: 9)
!304 = !{!"97"}
!305 = !DILocation(line: 102, column: 9, scope: !273)
!306 = !{!"98"}
!307 = !DILocation(line: 103, column: 9, scope: !308)
!308 = distinct !DILexicalBlock(scope: !303, file: !3, line: 102, column: 26)
!309 = !{!"99"}
!310 = !DILocation(line: 105, column: 23, scope: !273)
!311 = !{!"100"}
!312 = !DILocation(line: 105, column: 36, scope: !273)
!313 = !{!"101"}
!314 = !DILocalVariable(name: "min", scope: !273, file: !3, line: 96, type: !7)
!315 = !{!"102"}
!316 = !DILocation(line: 106, column: 5, scope: !273)
!317 = !{!"103"}
!318 = !DILocation(line: 107, column: 13, scope: !319)
!319 = distinct !DILexicalBlock(scope: !273, file: !3, line: 106, column: 8)
!320 = !{!"104"}
!321 = !DILocalVariable(name: "r", scope: !273, file: !3, line: 97, type: !7)
!322 = !{!"105"}
!323 = !DILocation(line: 108, column: 5, scope: !319)
!324 = !{!"106"}
!325 = !DILocation(line: 108, column: 16, scope: !273)
!326 = !{!"107"}
!327 = distinct !{!327, !316, !328, !329}
!328 = !DILocation(line: 108, column: 21, scope: !273)
!329 = !{!"llvm.loop.mustprogress"}
!330 = !{!"108"}
!331 = !DILocation(line: 110, column: 14, scope: !273)
!332 = !{!"109"}
!333 = !DILocation(line: 110, column: 5, scope: !273)
!334 = !{!"110"}
!335 = !{!"111"}
!336 = !DILocation(line: 111, column: 1, scope: !273)
!337 = !{!"112"}
!338 = distinct !DISubprogram(name: "randombytes_buf", scope: !3, file: !3, line: 114, type: !44, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!339 = !DILocalVariable(name: "buf", arg: 1, scope: !338, file: !3, line: 114, type: !46)
!340 = !DILocation(line: 0, scope: !338)
!341 = !{!"113"}
!342 = !DILocalVariable(name: "size", arg: 2, scope: !338, file: !3, line: 114, type: !47)
!343 = !{!"114"}
!344 = !DILocation(line: 117, column: 14, scope: !345)
!345 = distinct !DILexicalBlock(scope: !338, file: !3, line: 117, column: 9)
!346 = !{!"115"}
!347 = !DILocation(line: 117, column: 9, scope: !338)
!348 = !{!"116"}
!349 = !DILocation(line: 118, column: 9, scope: !350)
!350 = distinct !DILexicalBlock(scope: !345, file: !3, line: 117, column: 29)
!351 = !{!"117"}
!352 = !DILocation(line: 118, column: 25, scope: !350)
!353 = !{!"118"}
!354 = !{!"119"}
!355 = !{!"120"}
!356 = !DILocation(line: 119, column: 5, scope: !350)
!357 = !{!"121"}
!358 = !DILocation(line: 128, column: 1, scope: !338)
!359 = !{!"122"}
!360 = distinct !DISubprogram(name: "randombytes_close", scope: !3, file: !3, line: 131, type: !50, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!361 = !DILocation(line: 133, column: 9, scope: !362)
!362 = distinct !DILexicalBlock(scope: !360, file: !3, line: 133, column: 9)
!363 = !{!"123"}
!364 = !DILocation(line: 133, column: 24, scope: !362)
!365 = !{!"124"}
!366 = !DILocation(line: 133, column: 32, scope: !362)
!367 = !{!"125"}
!368 = !DILocation(line: 133, column: 35, scope: !362)
!369 = !{!"126"}
!370 = !DILocation(line: 133, column: 51, scope: !362)
!371 = !{!"127"}
!372 = !{!"128"}
!373 = !DILocation(line: 133, column: 57, scope: !362)
!374 = !{!"129"}
!375 = !DILocation(line: 133, column: 9, scope: !360)
!376 = !{!"130"}
!377 = !DILocation(line: 134, column: 16, scope: !378)
!378 = distinct !DILexicalBlock(scope: !362, file: !3, line: 133, column: 66)
!379 = !{!"131"}
!380 = !DILocation(line: 134, column: 32, scope: !378)
!381 = !{!"132"}
!382 = !{!"133"}
!383 = !{!"134"}
!384 = !DILocation(line: 134, column: 9, scope: !378)
!385 = !{!"135"}
!386 = !DILocation(line: 136, column: 5, scope: !360)
!387 = !{!"136"}
!388 = !DILocation(line: 0, scope: !360)
!389 = !{!"137"}
!390 = !DILocation(line: 137, column: 1, scope: !360)
!391 = !{!"138"}
!392 = distinct !DISubprogram(name: "randombytes", scope: !3, file: !3, line: 140, type: !393, scopeLine: 141, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !395, !396}
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!397 = !DILocalVariable(name: "buf", arg: 1, scope: !392, file: !3, line: 140, type: !395)
!398 = !DILocation(line: 0, scope: !392)
!399 = !{!"139"}
!400 = !DILocalVariable(name: "buf_len", arg: 2, scope: !392, file: !3, line: 140, type: !396)
!401 = !{!"140"}
!402 = !DILocation(line: 142, column: 5, scope: !403)
!403 = distinct !DILexicalBlock(scope: !404, file: !3, line: 142, column: 5)
!404 = distinct !DILexicalBlock(scope: !392, file: !3, line: 142, column: 5)
!405 = !{!"141"}
!406 = !DILocation(line: 142, column: 5, scope: !404)
!407 = !{!"142"}
!408 = !{!"143"}
!409 = !{!"144"}
!410 = !{!"145"}
!411 = !{!"146"}
!412 = !{!"147"}
!413 = !{!"148"}
!414 = !DILocation(line: 143, column: 5, scope: !392)
!415 = !{!"149"}
!416 = !DILocation(line: 144, column: 1, scope: !392)
!417 = !{!"150"}
!418 = distinct !DISubprogram(name: "randombytes_sysrandom_implementation_name", scope: !60, file: !60, line: 292, type: !24, scopeLine: 293, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !59, retainedNodes: !4)
!419 = !{!"151"}
!420 = !DILocation(line: 294, column: 5, scope: !418)
!421 = !{!"152"}
!422 = distinct !DISubprogram(name: "randombytes_sysrandom", scope: !60, file: !60, line: 249, type: !31, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !59, retainedNodes: !4)
!423 = !{!"153"}
!424 = !DILocalVariable(name: "r", scope: !422, file: !60, line: 251, type: !7)
!425 = !DILocation(line: 251, column: 14, scope: !422)
!426 = !{!"154"}
!427 = !DILocation(line: 253, column: 31, scope: !422)
!428 = !{!"155"}
!429 = !DILocation(line: 253, column: 5, scope: !422)
!430 = !{!"156"}
!431 = !DILocation(line: 255, column: 12, scope: !422)
!432 = !{!"157"}
!433 = !DILocation(line: 255, column: 5, scope: !422)
!434 = !{!"158"}
!435 = distinct !DISubprogram(name: "randombytes_sysrandom_stir", scope: !60, file: !60, line: 206, type: !35, scopeLine: 207, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !59, retainedNodes: !4)
!436 = !{!"159"}
!437 = !DILocation(line: 208, column: 16, scope: !438)
!438 = distinct !DILexicalBlock(scope: !435, file: !60, line: 208, column: 9)
!439 = !{!"160"}
!440 = !DILocation(line: 208, column: 28, scope: !438)
!441 = !{!"161"}
!442 = !DILocation(line: 208, column: 9, scope: !435)
!443 = !{!"162"}
!444 = !DILocation(line: 209, column: 9, scope: !445)
!445 = distinct !DILexicalBlock(scope: !438, file: !60, line: 208, column: 34)
!446 = !{!"163"}
!447 = !{!"164"}
!448 = !DILocation(line: 210, column: 28, scope: !445)
!449 = !{!"165"}
!450 = !DILocation(line: 211, column: 5, scope: !445)
!451 = !{!"166"}
!452 = !DILocation(line: 212, column: 1, scope: !435)
!453 = !{!"167"}
!454 = distinct !DISubprogram(name: "randombytes_sysrandom_buf", scope: !60, file: !60, line: 259, type: !44, scopeLine: 260, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !59, retainedNodes: !4)
!455 = !DILocalVariable(name: "buf", arg: 1, scope: !454, file: !60, line: 259, type: !46)
!456 = !DILocation(line: 0, scope: !454)
!457 = !{!"168"}
!458 = !DILocalVariable(name: "size", arg: 2, scope: !454, file: !60, line: 259, type: !47)
!459 = !{!"169"}
!460 = !DILocation(line: 261, column: 5, scope: !454)
!461 = !{!"170"}
!462 = !{!"171"}
!463 = !DILocation(line: 268, column: 16, scope: !464)
!464 = distinct !DILexicalBlock(scope: !454, file: !60, line: 268, column: 9)
!465 = !{!"172"}
!466 = !DILocation(line: 268, column: 36, scope: !464)
!467 = !{!"173"}
!468 = !DILocation(line: 268, column: 9, scope: !454)
!469 = !{!"174"}
!470 = !DILocation(line: 269, column: 13, scope: !471)
!471 = distinct !DILexicalBlock(scope: !472, file: !60, line: 269, column: 13)
!472 = distinct !DILexicalBlock(scope: !464, file: !60, line: 268, column: 42)
!473 = !{!"175"}
!474 = !DILocation(line: 269, column: 52, scope: !471)
!475 = !{!"176"}
!476 = !DILocation(line: 269, column: 13, scope: !472)
!477 = !{!"177"}
!478 = !DILocation(line: 270, column: 13, scope: !479)
!479 = distinct !DILexicalBlock(scope: !471, file: !60, line: 269, column: 58)
!480 = !{!"178"}
!481 = !{!"179"}
!482 = !DILocation(line: 272, column: 9, scope: !472)
!483 = !{!"180"}
!484 = !{!"181"}
!485 = !DILocation(line: 275, column: 16, scope: !486)
!486 = distinct !DILexicalBlock(scope: !454, file: !60, line: 275, column: 9)
!487 = !{!"182"}
!488 = !DILocation(line: 275, column: 38, scope: !486)
!489 = !{!"183"}
!490 = !DILocation(line: 275, column: 44, scope: !486)
!491 = !{!"184"}
!492 = !{!"185"}
!493 = !DILocation(line: 276, column: 26, scope: !486)
!494 = !{!"186"}
!495 = !DILocation(line: 276, column: 9, scope: !486)
!496 = !{!"187"}
!497 = !DILocation(line: 276, column: 60, scope: !486)
!498 = !{!"188"}
!499 = !DILocation(line: 275, column: 9, scope: !454)
!500 = !{!"189"}
!501 = !DILocation(line: 277, column: 9, scope: !502)
!502 = distinct !DILexicalBlock(scope: !486, file: !60, line: 276, column: 79)
!503 = !{!"190"}
!504 = !{!"191"}
!505 = !DILocation(line: 287, column: 1, scope: !454)
!506 = !{!"192"}
!507 = !{!"193"}
!508 = distinct !DISubprogram(name: "randombytes_sysrandom_close", scope: !60, file: !60, line: 223, type: !50, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !59, retainedNodes: !4)
!509 = !DILocalVariable(name: "ret", scope: !508, file: !60, line: 225, type: !52)
!510 = !DILocation(line: 0, scope: !508)
!511 = !{!"194"}
!512 = !{!"195"}
!513 = !DILocation(line: 228, column: 16, scope: !514)
!514 = distinct !DILexicalBlock(scope: !508, file: !60, line: 228, column: 9)
!515 = !{!"196"}
!516 = !DILocation(line: 228, column: 38, scope: !514)
!517 = !{!"197"}
!518 = !DILocation(line: 228, column: 44, scope: !514)
!519 = !{!"198"}
!520 = !{!"199"}
!521 = !DILocation(line: 229, column: 22, scope: !514)
!522 = !{!"200"}
!523 = !DILocation(line: 229, column: 9, scope: !514)
!524 = !{!"201"}
!525 = !DILocation(line: 229, column: 45, scope: !514)
!526 = !{!"202"}
!527 = !DILocation(line: 228, column: 9, scope: !508)
!528 = !{!"203"}
!529 = !{!"204"}
!530 = !DILocation(line: 230, column: 38, scope: !531)
!531 = distinct !DILexicalBlock(scope: !514, file: !60, line: 229, column: 51)
!532 = !{!"205"}
!533 = !{!"206"}
!534 = !DILocation(line: 231, column: 28, scope: !531)
!535 = !{!"207"}
!536 = !{!"208"}
!537 = !DILocation(line: 233, column: 5, scope: !531)
!538 = !{!"209"}
!539 = !{!"210"}
!540 = !{!"211"}
!541 = !{!"212"}
!542 = !DILocation(line: 235, column: 16, scope: !543)
!543 = distinct !DILexicalBlock(scope: !508, file: !60, line: 235, column: 9)
!544 = !{!"213"}
!545 = !DILocation(line: 235, column: 36, scope: !543)
!546 = !{!"214"}
!547 = !DILocation(line: 235, column: 9, scope: !508)
!548 = !{!"215"}
!549 = !{!"216"}
!550 = !DILocation(line: 237, column: 5, scope: !551)
!551 = distinct !DILexicalBlock(scope: !543, file: !60, line: 235, column: 42)
!552 = !{!"217"}
!553 = !{!"218"}
!554 = !{!"219"}
!555 = !DILocation(line: 245, column: 5, scope: !508)
!556 = !{!"220"}
!557 = distinct !DISubprogram(name: "randombytes_sysrandom_stir_if_needed", scope: !60, file: !60, line: 215, type: !35, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, retainedNodes: !4)
!558 = !{!"221"}
!559 = !DILocation(line: 217, column: 16, scope: !560)
!560 = distinct !DILexicalBlock(scope: !557, file: !60, line: 217, column: 9)
!561 = !{!"222"}
!562 = !DILocation(line: 217, column: 28, scope: !560)
!563 = !{!"223"}
!564 = !DILocation(line: 217, column: 9, scope: !557)
!565 = !{!"224"}
!566 = !DILocation(line: 218, column: 9, scope: !567)
!567 = distinct !DILexicalBlock(scope: !560, file: !60, line: 217, column: 34)
!568 = !{!"225"}
!569 = !DILocation(line: 219, column: 5, scope: !567)
!570 = !{!"226"}
!571 = !DILocation(line: 220, column: 1, scope: !557)
!572 = !{!"227"}
!573 = distinct !DISubprogram(name: "randombytes_linux_getrandom", scope: !60, file: !60, line: 151, type: !574, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, retainedNodes: !4)
!574 = !DISubroutineType(types: !575)
!575 = !{!52, !46, !12}
!576 = !DILocalVariable(name: "buf_", arg: 1, scope: !573, file: !60, line: 151, type: !46)
!577 = !DILocation(line: 0, scope: !573)
!578 = !{!"228"}
!579 = !DILocalVariable(name: "size", arg: 2, scope: !573, file: !60, line: 151, type: !12)
!580 = !{!"229"}
!581 = !DILocalVariable(name: "buf", scope: !573, file: !60, line: 153, type: !66)
!582 = !{!"230"}
!583 = !DILocalVariable(name: "chunk_size", scope: !573, file: !60, line: 154, type: !12)
!584 = !{!"231"}
!585 = !DILocation(line: 156, column: 5, scope: !573)
!586 = !{!"232"}
!587 = !{!"233"}
!588 = !{!"234"}
!589 = !{!"235"}
!590 = !{!"236"}
!591 = !{!"237"}
!592 = !{!"238"}
!593 = !DILocation(line: 157, column: 18, scope: !594)
!594 = distinct !DILexicalBlock(scope: !595, file: !60, line: 157, column: 13)
!595 = distinct !DILexicalBlock(scope: !573, file: !60, line: 156, column: 8)
!596 = !{!"239"}
!597 = !DILocation(line: 157, column: 13, scope: !595)
!598 = !{!"240"}
!599 = !{!"241"}
!600 = !DILocation(line: 159, column: 13, scope: !601)
!601 = distinct !DILexicalBlock(scope: !602, file: !60, line: 159, column: 13)
!602 = distinct !DILexicalBlock(scope: !603, file: !60, line: 159, column: 13)
!603 = distinct !DILexicalBlock(scope: !594, file: !60, line: 157, column: 32)
!604 = !{!"242"}
!605 = !DILocation(line: 159, column: 13, scope: !602)
!606 = !{!"243"}
!607 = !{!"244"}
!608 = !{!"245"}
!609 = !{!"246"}
!610 = !{!"247"}
!611 = !{!"248"}
!612 = !{!"249"}
!613 = !DILocation(line: 160, column: 9, scope: !603)
!614 = !{!"250"}
!615 = !{!"251"}
!616 = !{!"252"}
!617 = !DILocation(line: 161, column: 13, scope: !618)
!618 = distinct !DILexicalBlock(scope: !595, file: !60, line: 161, column: 13)
!619 = !{!"253"}
!620 = !DILocation(line: 161, column: 59, scope: !618)
!621 = !{!"254"}
!622 = !DILocation(line: 161, column: 13, scope: !595)
!623 = !{!"255"}
!624 = !DILocation(line: 162, column: 13, scope: !625)
!625 = distinct !DILexicalBlock(scope: !618, file: !60, line: 161, column: 65)
!626 = !{!"256"}
!627 = !DILocation(line: 164, column: 14, scope: !595)
!628 = !{!"257"}
!629 = !{!"258"}
!630 = !DILocation(line: 165, column: 13, scope: !595)
!631 = !{!"259"}
!632 = !{!"260"}
!633 = !DILocation(line: 166, column: 5, scope: !595)
!634 = !{!"261"}
!635 = !DILocation(line: 166, column: 19, scope: !573)
!636 = !{!"262"}
!637 = distinct !{!637, !585, !638, !329}
!638 = !DILocation(line: 166, column: 32, scope: !573)
!639 = !{!"263"}
!640 = !DILocation(line: 168, column: 5, scope: !573)
!641 = !{!"264"}
!642 = !{!"265"}
!643 = !DILocation(line: 169, column: 1, scope: !573)
!644 = !{!"266"}
!645 = distinct !DISubprogram(name: "safe_read", scope: !60, file: !60, line: 77, type: !646, scopeLine: 78, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, retainedNodes: !4)
!646 = !DISubroutineType(types: !647)
!647 = !{!62, !648, !46, !12}
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!649 = !DILocalVariable(name: "fd", arg: 1, scope: !645, file: !60, line: 77, type: !648)
!650 = !DILocation(line: 0, scope: !645)
!651 = !{!"267"}
!652 = !DILocalVariable(name: "buf_", arg: 2, scope: !645, file: !60, line: 77, type: !46)
!653 = !{!"268"}
!654 = !DILocalVariable(name: "size", arg: 3, scope: !645, file: !60, line: 77, type: !12)
!655 = !{!"269"}
!656 = !DILocalVariable(name: "buf", scope: !645, file: !60, line: 79, type: !66)
!657 = !{!"270"}
!658 = !DILocation(line: 82, column: 5, scope: !659)
!659 = distinct !DILexicalBlock(scope: !660, file: !60, line: 82, column: 5)
!660 = distinct !DILexicalBlock(scope: !645, file: !60, line: 82, column: 5)
!661 = !{!"271"}
!662 = !DILocation(line: 82, column: 5, scope: !660)
!663 = !{!"272"}
!664 = !{!"273"}
!665 = !{!"274"}
!666 = !{!"275"}
!667 = !{!"276"}
!668 = !{!"277"}
!669 = !{!"278"}
!670 = !DILocation(line: 83, column: 5, scope: !645)
!671 = !{!"279"}
!672 = !{!"280"}
!673 = !{!"281"}
!674 = !{!"282"}
!675 = !{!"283"}
!676 = !DILocation(line: 84, column: 9, scope: !677)
!677 = distinct !DILexicalBlock(scope: !645, file: !60, line: 83, column: 8)
!678 = !{!"284"}
!679 = !DILocation(line: 84, column: 26, scope: !677)
!680 = !{!"285"}
!681 = !DILocalVariable(name: "readnb", scope: !645, file: !60, line: 80, type: !62)
!682 = !{!"286"}
!683 = !DILocation(line: 84, column: 47, scope: !677)
!684 = !{!"287"}
!685 = !DILocation(line: 84, column: 61, scope: !677)
!686 = !{!"288"}
!687 = !DILocation(line: 85, column: 17, scope: !677)
!688 = !{!"289"}
!689 = !{!"290"}
!690 = !DILocation(line: 85, column: 23, scope: !677)
!691 = !{!"291"}
!692 = !DILocation(line: 85, column: 32, scope: !677)
!693 = !{!"292"}
!694 = !DILocation(line: 85, column: 35, scope: !677)
!695 = !{!"293"}
!696 = !{!"294"}
!697 = !DILocation(line: 85, column: 41, scope: !677)
!698 = !{!"295"}
!699 = !{!"296"}
!700 = !{!"297"}
!701 = !{!"298"}
!702 = !DILocation(line: 0, scope: !677)
!703 = !{!"299"}
!704 = !{!"300"}
!705 = distinct !{!705, !676, !706, !329}
!706 = !DILocation(line: 85, column: 52, scope: !677)
!707 = !{!"301"}
!708 = !DILocation(line: 86, column: 20, scope: !709)
!709 = distinct !DILexicalBlock(scope: !677, file: !60, line: 86, column: 13)
!710 = !{!"302"}
!711 = !DILocation(line: 86, column: 13, scope: !677)
!712 = !{!"303"}
!713 = !DILocation(line: 87, column: 13, scope: !714)
!714 = distinct !DILexicalBlock(scope: !709, file: !60, line: 86, column: 35)
!715 = !{!"304"}
!716 = !DILocation(line: 89, column: 20, scope: !717)
!717 = distinct !DILexicalBlock(scope: !677, file: !60, line: 89, column: 13)
!718 = !{!"305"}
!719 = !DILocation(line: 89, column: 13, scope: !677)
!720 = !{!"306"}
!721 = !DILocation(line: 90, column: 13, scope: !722)
!722 = distinct !DILexicalBlock(scope: !717, file: !60, line: 89, column: 36)
!723 = !{!"307"}
!724 = !DILocation(line: 92, column: 14, scope: !677)
!725 = !{!"308"}
!726 = !{!"309"}
!727 = !DILocation(line: 93, column: 13, scope: !677)
!728 = !{!"310"}
!729 = !{!"311"}
!730 = !DILocation(line: 94, column: 5, scope: !677)
!731 = !{!"312"}
!732 = !DILocation(line: 94, column: 19, scope: !645)
!733 = !{!"313"}
!734 = distinct !{!734, !670, !735, !329}
!735 = !DILocation(line: 94, column: 32, scope: !645)
!736 = !{!"314"}
!737 = !{!"315"}
!738 = !{!"316"}
!739 = !DILocation(line: 96, column: 27, scope: !645)
!740 = !{!"317"}
!741 = !{!"318"}
!742 = !{!"319"}
!743 = !DILocation(line: 96, column: 5, scope: !645)
!744 = !{!"320"}
!745 = !{!"321"}
!746 = !DILocation(line: 97, column: 1, scope: !645)
!747 = !{!"322"}
!748 = distinct !DISubprogram(name: "_randombytes_linux_getrandom", scope: !60, file: !60, line: 138, type: !749, scopeLine: 139, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, retainedNodes: !4)
!749 = !DISubroutineType(types: !750)
!750 = !{!52, !46, !47}
!751 = !DILocalVariable(name: "buf", arg: 1, scope: !748, file: !60, line: 138, type: !46)
!752 = !DILocation(line: 0, scope: !748)
!753 = !{!"323"}
!754 = !DILocalVariable(name: "size", arg: 2, scope: !748, file: !60, line: 138, type: !47)
!755 = !{!"324"}
!756 = !DILocation(line: 142, column: 5, scope: !757)
!757 = distinct !DILexicalBlock(scope: !758, file: !60, line: 142, column: 5)
!758 = distinct !DILexicalBlock(scope: !748, file: !60, line: 142, column: 5)
!759 = !{!"325"}
!760 = !DILocation(line: 142, column: 5, scope: !758)
!761 = !{!"326"}
!762 = !{!"327"}
!763 = !{!"328"}
!764 = !{!"329"}
!765 = !{!"330"}
!766 = !{!"331"}
!767 = !{!"332"}
!768 = !DILocation(line: 143, column: 5, scope: !748)
!769 = !{!"333"}
!770 = !DILocation(line: 144, column: 46, scope: !771)
!771 = distinct !DILexicalBlock(scope: !748, file: !60, line: 143, column: 8)
!772 = !{!"334"}
!773 = !DILocation(line: 144, column: 18, scope: !771)
!774 = !{!"335"}
!775 = !{!"336"}
!776 = !DILocalVariable(name: "readnb", scope: !748, file: !60, line: 140, type: !52)
!777 = !{!"337"}
!778 = !DILocation(line: 145, column: 5, scope: !771)
!779 = !{!"338"}
!780 = !DILocation(line: 145, column: 21, scope: !748)
!781 = !{!"339"}
!782 = !DILocation(line: 145, column: 25, scope: !748)
!783 = !{!"340"}
!784 = !DILocation(line: 145, column: 29, scope: !748)
!785 = !{!"341"}
!786 = !{!"342"}
!787 = !DILocation(line: 145, column: 35, scope: !748)
!788 = !{!"343"}
!789 = !DILocation(line: 145, column: 44, scope: !748)
!790 = !{!"344"}
!791 = !DILocation(line: 145, column: 47, scope: !748)
!792 = !{!"345"}
!793 = !{!"346"}
!794 = !DILocation(line: 145, column: 53, scope: !748)
!795 = !{!"347"}
!796 = !{!"348"}
!797 = !{!"349"}
!798 = !{!"350"}
!799 = !{!"351"}
!800 = distinct !{!800, !768, !801, !329}
!801 = !DILocation(line: 145, column: 63, scope: !748)
!802 = !{!"352"}
!803 = !DILocation(line: 147, column: 23, scope: !748)
!804 = !{!"353"}
!805 = !DILocation(line: 147, column: 20, scope: !748)
!806 = !{!"354"}
!807 = !{!"355"}
!808 = !DILocation(line: 147, column: 35, scope: !748)
!809 = !{!"356"}
!810 = !DILocation(line: 147, column: 5, scope: !748)
!811 = !{!"357"}
!812 = distinct !DISubprogram(name: "randombytes_sysrandom_init", scope: !60, file: !60, line: 173, type: !35, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, retainedNodes: !4)
!813 = !{!"358"}
!814 = !DILocation(line: 175, column: 32, scope: !812)
!815 = !{!"359"}
!816 = !{!"360"}
!817 = !DILocalVariable(name: "errno_save", scope: !812, file: !60, line: 175, type: !648)
!818 = !DILocation(line: 0, scope: !812)
!819 = !{!"361"}
!820 = !DILocalVariable(name: "fodder", scope: !821, file: !60, line: 179, type: !128)
!821 = distinct !DILexicalBlock(scope: !812, file: !60, line: 178, column: 5)
!822 = !DILocation(line: 179, column: 16, scope: !821)
!823 = !{!"362"}
!824 = !DILocation(line: 181, column: 34, scope: !825)
!825 = distinct !DILexicalBlock(scope: !821, file: !60, line: 181, column: 6)
!826 = !{!"363"}
!827 = !DILocation(line: 181, column: 6, scope: !825)
!828 = !{!"364"}
!829 = !DILocation(line: 181, column: 57, scope: !825)
!830 = !{!"365"}
!831 = !DILocation(line: 181, column: 6, scope: !821)
!832 = !{!"366"}
!833 = !{!"367"}
!834 = !DILocation(line: 182, column: 33, scope: !835)
!835 = distinct !DILexicalBlock(scope: !825, file: !60, line: 181, column: 63)
!836 = !{!"368"}
!837 = !DILocation(line: 183, column: 6, scope: !835)
!838 = !{!"369"}
!839 = !DILocation(line: 183, column: 12, scope: !835)
!840 = !{!"370"}
!841 = !DILocation(line: 184, column: 6, scope: !835)
!842 = !{!"371"}
!843 = !{!"372"}
!844 = !DILocation(line: 186, column: 29, scope: !821)
!845 = !{!"373"}
!846 = !DILocation(line: 191, column: 10, scope: !847)
!847 = distinct !DILexicalBlock(scope: !812, file: !60, line: 190, column: 9)
!848 = !{!"374"}
!849 = !{!"375"}
!850 = !DILocation(line: 190, column: 39, scope: !847)
!851 = !{!"376"}
!852 = !DILocation(line: 191, column: 51, scope: !847)
!853 = !{!"377"}
!854 = !DILocation(line: 190, column: 9, scope: !812)
!855 = !{!"378"}
!856 = !DILocation(line: 192, column: 9, scope: !857)
!857 = distinct !DILexicalBlock(scope: !847, file: !60, line: 191, column: 58)
!858 = !{!"379"}
!859 = !{!"380"}
!860 = !DILocation(line: 194, column: 5, scope: !812)
!861 = !{!"381"}
!862 = !DILocation(line: 194, column: 11, scope: !812)
!863 = !{!"382"}
!864 = !DILocation(line: 195, column: 1, scope: !812)
!865 = !{!"383"}
!866 = !{!"384"}
!867 = !{!"385"}
!868 = !DILocalVariable(name: "st", scope: !79, file: !60, line: 105, type: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !870, line: 46, size: 1152, elements: !871)
!870 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!871 = !{!872, !874, !876, !878, !880, !882, !884, !885, !886, !888, !890, !892, !900, !901, !902}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !869, file: !870, line: 48, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !10, line: 145, baseType: !14)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !869, file: !870, line: 53, baseType: !875, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !10, line: 148, baseType: !14)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !869, file: !870, line: 61, baseType: !877, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !10, line: 151, baseType: !14)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !869, file: !870, line: 62, baseType: !879, size: 32, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !10, line: 150, baseType: !11)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !869, file: !870, line: 64, baseType: !881, size: 32, offset: 224)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !10, line: 146, baseType: !11)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !869, file: !870, line: 65, baseType: !883, size: 32, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !10, line: 147, baseType: !11)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !869, file: !870, line: 67, baseType: !52, size: 32, offset: 288)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !869, file: !870, line: 69, baseType: !873, size: 64, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !869, file: !870, line: 74, baseType: !887, size: 64, offset: 384)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !10, line: 152, baseType: !65)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !869, file: !870, line: 78, baseType: !889, size: 64, offset: 448)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !10, line: 174, baseType: !65)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !869, file: !870, line: 80, baseType: !891, size: 64, offset: 512)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !10, line: 179, baseType: !65)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !869, file: !870, line: 91, baseType: !893, size: 128, offset: 576)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !894, line: 10, size: 128, elements: !895)
!894 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!895 = !{!896, !898}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !893, file: !894, line: 12, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !10, line: 160, baseType: !65)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !893, file: !894, line: 16, baseType: !899, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !10, line: 196, baseType: !65)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !869, file: !870, line: 92, baseType: !893, size: 128, offset: 704)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !869, file: !870, line: 93, baseType: !893, size: 128, offset: 832)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !869, file: !870, line: 106, baseType: !903, size: 192, offset: 960)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 192, elements: !81)
!904 = !DILocation(line: 105, column: 24, scope: !79)
!905 = !{!"386"}
!906 = !DILocalVariable(name: "device", scope: !79, file: !60, line: 112, type: !907)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!908 = !DILocation(line: 0, scope: !79)
!909 = !{!"387"}
!910 = !{!"388"}
!911 = !DILocation(line: 115, column: 5, scope: !79)
!912 = !{!"389"}
!913 = !{!"390"}
!914 = !{!"391"}
!915 = !DILocation(line: 116, column: 19, scope: !916)
!916 = distinct !DILexicalBlock(scope: !79, file: !60, line: 115, column: 8)
!917 = !{!"392"}
!918 = !DILocation(line: 116, column: 14, scope: !916)
!919 = !{!"393"}
!920 = !DILocalVariable(name: "fd", scope: !79, file: !60, line: 113, type: !52)
!921 = !{!"394"}
!922 = !DILocation(line: 117, column: 16, scope: !923)
!923 = distinct !DILexicalBlock(scope: !916, file: !60, line: 117, column: 13)
!924 = !{!"395"}
!925 = !DILocation(line: 117, column: 13, scope: !916)
!926 = !{!"396"}
!927 = !DILocation(line: 118, column: 17, scope: !928)
!928 = distinct !DILexicalBlock(scope: !929, file: !60, line: 118, column: 17)
!929 = distinct !DILexicalBlock(scope: !923, file: !60, line: 117, column: 23)
!930 = !{!"397"}
!931 = !DILocation(line: 118, column: 32, scope: !928)
!932 = !{!"398"}
!933 = !DILocation(line: 118, column: 37, scope: !928)
!934 = !{!"399"}
!935 = !DILocation(line: 118, column: 40, scope: !928)
!936 = !{!"400"}
!937 = !{!"401"}
!938 = !{!"402"}
!939 = !{!"403"}
!940 = !DILocation(line: 118, column: 17, scope: !929)
!941 = !{!"404"}
!942 = !DILocation(line: 120, column: 43, scope: !943)
!943 = distinct !DILexicalBlock(scope: !928, file: !60, line: 118, column: 61)
!944 = !{!"405"}
!945 = !DILocation(line: 120, column: 62, scope: !943)
!946 = !{!"406"}
!947 = !DILocation(line: 120, column: 24, scope: !943)
!948 = !{!"407"}
!949 = !DILocation(line: 122, column: 17, scope: !943)
!950 = !{!"408"}
!951 = !DILocation(line: 124, column: 20, scope: !929)
!952 = !{!"409"}
!953 = !DILocation(line: 125, column: 9, scope: !929)
!954 = !{!"410"}
!955 = !DILocation(line: 125, column: 20, scope: !956)
!956 = distinct !DILexicalBlock(scope: !923, file: !60, line: 125, column: 20)
!957 = !{!"411"}
!958 = !{!"412"}
!959 = !DILocation(line: 125, column: 26, scope: !956)
!960 = !{!"413"}
!961 = !DILocation(line: 125, column: 20, scope: !923)
!962 = !{!"414"}
!963 = !DILocation(line: 126, column: 13, scope: !964)
!964 = distinct !DILexicalBlock(scope: !956, file: !60, line: 125, column: 36)
!965 = !{!"415"}
!966 = !{!"416"}
!967 = !DILocation(line: 128, column: 15, scope: !916)
!968 = !{!"417"}
!969 = !{!"418"}
!970 = !DILocation(line: 129, column: 5, scope: !916)
!971 = !{!"419"}
!972 = !{!"420"}
!973 = !{!"421"}
!974 = !DILocation(line: 129, column: 14, scope: !79)
!975 = !{!"422"}
!976 = !DILocation(line: 129, column: 22, scope: !79)
!977 = !{!"423"}
!978 = distinct !{!978, !911, !979, !329}
!979 = !DILocation(line: 129, column: 29, scope: !79)
!980 = !{!"424"}
!981 = !DILocation(line: 131, column: 5, scope: !79)
!982 = !{!"425"}
!983 = !DILocation(line: 131, column: 11, scope: !79)
!984 = !{!"426"}
!985 = !DILocation(line: 132, column: 5, scope: !79)
!986 = !{!"427"}
!987 = !{!"428"}
!988 = !DILocation(line: 134, column: 1, scope: !79)
!989 = !{!"429"}
!990 = distinct !DISubprogram(name: "crypto_stream_chacha20_keybytes", scope: !133, file: !133, line: 5, type: !991, scopeLine: 5, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !132, retainedNodes: !4)
!991 = !DISubroutineType(types: !992)
!992 = !{!12}
!993 = !DILocation(line: 6, column: 5, scope: !990)
!994 = !{!"430"}
