; ModuleID = 'sign.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.br_rsa_private_key = type { i32, i8*, i64, i8*, i64, i8*, i64, i8*, i64, i8*, i64 }
%struct.smack_value = type { i8* }

; Function Attrs: noinline nounwind uwtable
define dso_local void @br_ccopy(i32 %0, i8* %1, i8* %2, i64 %3) #0 !dbg !66 {
  call void @llvm.dbg.value(metadata i32 %0, metadata !71, metadata !DIExpression()), !dbg !72
  call void @llvm.dbg.value(metadata i8* %1, metadata !73, metadata !DIExpression()), !dbg !72
  call void @llvm.dbg.value(metadata i8* %2, metadata !74, metadata !DIExpression()), !dbg !72
  call void @llvm.dbg.value(metadata i64 %3, metadata !75, metadata !DIExpression()), !dbg !72
  call void @llvm.dbg.value(metadata i8* %1, metadata !76, metadata !DIExpression()), !dbg !72
  call void @llvm.dbg.value(metadata i8* %2, metadata !77, metadata !DIExpression()), !dbg !72
  br label %5, !dbg !80

5:                                                ; preds = %8, %4
  %.02 = phi i64 [ %3, %4 ], [ %6, %8 ]
  %.01 = phi i8* [ %1, %4 ], [ %16, %8 ], !dbg !72
  %.0 = phi i8* [ %2, %4 ], [ %9, %8 ], !dbg !72
  call void @llvm.dbg.value(metadata i8* %.0, metadata !77, metadata !DIExpression()), !dbg !72
  call void @llvm.dbg.value(metadata i8* %.01, metadata !76, metadata !DIExpression()), !dbg !72

!1425 = !DILocation(line: 46, column: 9, scope: !1379)
!1426 = !DILocation(line: 47, column: 1, scope: !1379)
!1427 = distinct !DISubprogram(name: "br_i15_sub", scope: !45, file: !45, line: 29, type: !111, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !2)
!1428 = !DILocalVariable(name: "a", arg: 1, scope: !1427, file: !45, line: 29, type: !113)
!1429 = !DILocation(line: 0, scope: !1427)
!1430 = !DILocalVariable(name: "b", arg: 2, scope: !1427, file: !45, line: 29, type: !117)
!1431 = !DILocalVariable(name: "ctl", arg: 3, scope: !1427, file: !45, line: 29, type: !8)
!1432 = !DILocalVariable(name: "cc", scope: !1427, file: !45, line: 31, type: !8)
!1433 = !DILocation(line: 35, column: 7, scope: !1427)
!1434 = !DILocation(line: 35, column: 12, scope: !1427)
!1435 = !DILocation(line: 35, column: 18, scope: !1427)
!1436 = !DILocation(line: 35, column: 6, scope: !1427)
!1437 = !DILocalVariable(name: "m", scope: !1427, file: !45, line: 32, type: !29)
!1438 = !DILocalVariable(name: "u", scope: !1427, file: !45, line: 32, type: !29)
!1439 = !DILocation(line: 36, column: 7, scope: !1440)
!1440 = distinct !DILexicalBlock(scope: !1427, file: !45, line: 36, column: 2)
!1441 = !DILocation(line: 0, scope: !1440)
!1442 = !DILocation(line: 36, column: 16, scope: !1443)
!1443 = distinct !DILexicalBlock(scope: !1440, file: !45, line: 36, column: 2)
!1444 = !DILocation(line: 36, column: 2, scope: !1440)
!1445 = !DILocation(line: 39, column: 8, scope: !1446)
!1446 = distinct !DILexicalBlock(scope: !1443, file: !45, line: 36, column: 27)
!1447 = !DILocalVariable(name: "aw", scope: !1446, file: !45, line: 37, type: !8)
!1448 = !DILocation(line: 0, scope: !1446)
!1449 = !DILocation(line: 40, column: 8, scope: !1446)
!1450 = !DILocalVariable(name: "bw", scope: !1446, file: !45, line: 37, type: !8)
!1451 = !DILocation(line: 41, column: 12, scope: !1446)
!1452 = !DILocation(line: 41, column: 17, scope: !1446)
!1453 = !DILocalVariable(name: "naw", scope: !1446, file: !45, line: 37, type: !8)
!1454 = !DILocation(line: 42, column: 12, scope: !1446)
!1455 = !DILocation(line: 43, column: 23, scope: !1446)
!1456 = !DILocation(line: 43, column: 10, scope: !1446)
!1457 = !DILocation(line: 43, column: 3, scope: !1446)
!1458 = !DILocation(line: 43, column: 8, scope: !1446)
!1459 = !DILocation(line: 44, column: 2, scope: !1446)
!1460 = !DILocation(line: 36, column: 23, scope: !1443)
!1461 = !DILocation(line: 36, column: 2, scope: !1443)
!1462 = distinct !{!1462, !1444, !1463, !95}
!1463 = !DILocation(line: 44, column: 2, scope: !1440)
!1464 = !DILocation(line: 45, column: 2, scope: !1427)
!1465 = distinct !DISubprogram(name: "MUX", scope: !98, file: !98, line: 770, type: !99, scopeLine: 771, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !44, retainedNodes: !2)
!1466 = !DILocalVariable(name: "ctl", arg: 1, scope: !1465, file: !98, line: 770, type: !8)
!1467 = !DILocation(line: 0, scope: !1465)
!1468 = !DILocalVariable(name: "x", arg: 2, scope: !1465, file: !98, line: 770, type: !8)
!1469 = !DILocalVariable(name: "y", arg: 3, scope: !1465, file: !98, line: 770, type: !8)
!1470 = !DILocation(line: 772, column: 14, scope: !1465)
!1471 = !DILocation(line: 772, column: 24, scope: !1465)
!1472 = !DILocation(line: 772, column: 19, scope: !1465)
!1473 = !DILocation(line: 772, column: 11, scope: !1465)
!1474 = !DILocation(line: 772, column: 2, scope: !1465)
!1475 = distinct !DISubprogram(name: "br_i15_to_monty", scope: !47, file: !47, line: 29, type: !1476, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !46, retainedNodes: !2)
!1476 = !DISubroutineType(types: !1477)
!1477 = !{null, !113, !117}
!1478 = !DILocalVariable(name: "x", arg: 1, scope: !1475, file: !47, line: 29, type: !113)
!1479 = !DILocation(line: 0, scope: !1475)
!1480 = !DILocalVariable(name: "m", arg: 2, scope: !1475, file: !47, line: 29, type: !117)
!1481 = !DILocation(line: 33, column: 12, scope: !1482)
!1482 = distinct !DILexicalBlock(scope: !1475, file: !47, line: 33, column: 2)
!1483 = !DILocation(line: 33, column: 17, scope: !1482)
!1484 = !DILocation(line: 33, column: 23, scope: !1482)
!1485 = !DILocalVariable(name: "k", scope: !1475, file: !47, line: 31, type: !12)
!1486 = !DILocation(line: 33, column: 7, scope: !1482)
!1487 = !DILocation(line: 0, scope: !1482)
!1488 = !DILocation(line: 33, column: 31, scope: !1489)
!1489 = distinct !DILexicalBlock(scope: !1482, file: !47, line: 33, column: 2)
!1490 = !DILocation(line: 33, column: 2, scope: !1482)
!1491 = !DILocation(line: 34, column: 3, scope: !1492)
!1492 = distinct !DILexicalBlock(scope: !1489, file: !47, line: 33, column: 42)
!1493 = !DILocation(line: 35, column: 2, scope: !1492)
!1494 = !DILocation(line: 33, column: 38, scope: !1489)
!1495 = !DILocation(line: 33, column: 2, scope: !1489)
!1496 = distinct !{!1496, !1490, !1497, !95}
!1497 = !DILocation(line: 35, column: 2, scope: !1482)
!1498 = !DILocation(line: 36, column: 1, scope: !1475)
!1499 = distinct !DISubprogram(name: "br_rsa_i15_pkcs1_sign", scope: !49, file: !49, line: 29, type: !1500, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !2)
!1500 = !DISubroutineType(types: !1501)
!1501 = !{!8, !78, !78, !29, !1502, !56}
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64)
!1503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1504)
!1504 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_rsa_private_key", file: !1505, line: 205, baseType: !1506)
!1505 = !DIFile(filename: "../BearSSL/inc/bearssl_rsa.h", directory: "/home/luwei/bech-back/BearSSL/RSA_i15_pkcs1")
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1505, line: 182, size: 704, elements: !1507)
!1507 = !{!1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "n_bitlen", scope: !1506, file: !1505, line: 184, baseType: !8, size: 32)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1506, file: !1505, line: 186, baseType: !56, size: 64, offset: 64)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !1506, file: !1505, line: 188, baseType: !29, size: 64, offset: 128)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1506, file: !1505, line: 190, baseType: !56, size: 64, offset: 192)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !1506, file: !1505, line: 192, baseType: !29, size: 64, offset: 256)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "dp", scope: !1506, file: !1505, line: 194, baseType: !56, size: 64, offset: 320)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "dplen", scope: !1506, file: !1505, line: 196, baseType: !29, size: 64, offset: 384)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "dq", scope: !1506, file: !1505, line: 198, baseType: !56, size: 64, offset: 448)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "dqlen", scope: !1506, file: !1505, line: 200, baseType: !29, size: 64, offset: 512)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "iq", scope: !1506, file: !1505, line: 202, baseType: !56, size: 64, offset: 576)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "iqlen", scope: !1506, file: !1505, line: 204, baseType: !29, size: 64, offset: 640)
!1519 = !DILocalVariable(name: "hash_oid", arg: 1, scope: !1499, file: !49, line: 29, type: !78)
!1520 = !DILocation(line: 0, scope: !1499)
!1521 = !DILocalVariable(name: "hash", arg: 2, scope: !1499, file: !49, line: 30, type: !78)
!1522 = !DILocalVariable(name: "hash_len", arg: 3, scope: !1499, file: !49, line: 30, type: !29)
!1523 = !DILocalVariable(name: "sk", arg: 4, scope: !1499, file: !49, line: 31, type: !1502)
!1524 = !DILocalVariable(name: "x", arg: 5, scope: !1499, file: !49, line: 31, type: !56)
!1525 = !DILocation(line: 33, column: 58, scope: !1526)
!1526 = distinct !DILexicalBlock(scope: !1499, file: !49, line: 33, column: 6)
!1527 = !DILocation(line: 33, column: 7, scope: !1526)
!1528 = !DILocation(line: 33, column: 6, scope: !1499)
!1529 = !DILocation(line: 34, column: 3, scope: !1530)
!1530 = distinct !DILexicalBlock(scope: !1526, file: !49, line: 33, column: 72)
!1531 = !DILocation(line: 36, column: 9, scope: !1499)
!1532 = !DILocation(line: 36, column: 2, scope: !1499)
!1533 = !DILocation(line: 37, column: 1, scope: !1499)
!1534 = distinct !DISubprogram(name: "br_rsa_i15_private", scope: !51, file: !51, line: 32, type: !1535, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !2)
!1535 = !DISubroutineType(types: !1536)
!1536 = !{!8, !56, !1537}
!1537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1538, size: 64)
!1538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1539)
!1539 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_rsa_private_key", file: !1505, line: 205, baseType: !1540)
!1540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1505, line: 182, size: 704, elements: !1541)
!1541 = !{!1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "n_bitlen", scope: !1540, file: !1505, line: 184, baseType: !8, size: 32)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1540, file: !1505, line: 186, baseType: !56, size: 64, offset: 64)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !1540, file: !1505, line: 188, baseType: !29, size: 64, offset: 128)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1540, file: !1505, line: 190, baseType: !56, size: 64, offset: 192)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !1540, file: !1505, line: 192, baseType: !29, size: 64, offset: 256)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "dp", scope: !1540, file: !1505, line: 194, baseType: !56, size: 64, offset: 320)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "dplen", scope: !1540, file: !1505, line: 196, baseType: !29, size: 64, offset: 384)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "dq", scope: !1540, file: !1505, line: 198, baseType: !56, size: 64, offset: 448)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "dqlen", scope: !1540, file: !1505, line: 200, baseType: !29, size: 64, offset: 512)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "iq", scope: !1540, file: !1505, line: 202, baseType: !56, size: 64, offset: 576)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "iqlen", scope: !1540, file: !1505, line: 204, baseType: !29, size: 64, offset: 640)
!1553 = !DILocalVariable(name: "x", arg: 1, scope: !1534, file: !51, line: 32, type: !56)
!1554 = !DILocation(line: 0, scope: !1534)
!1555 = !DILocalVariable(name: "sk", arg: 2, scope: !1534, file: !51, line: 32, type: !1537)
!1556 = !DILocalVariable(name: "tmp", scope: !1534, file: !51, line: 39, type: !1557)
!1557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 18064, elements: !1558)
!1558 = !{!1559}
!1559 = !DISubrange(count: 1129)
!1560 = !DILocation(line: 39, column: 11, scope: !1534)
!1561 = !DILocation(line: 49, column: 10, scope: !1534)
!1562 = !DILocalVariable(name: "p", scope: !1534, file: !51, line: 34, type: !78)
!1563 = !DILocation(line: 50, column: 13, scope: !1534)
!1564 = !DILocalVariable(name: "plen", scope: !1534, file: !51, line: 35, type: !29)
!1565 = !DILocation(line: 51, column: 2, scope: !1534)
!1566 = !DILocation(line: 51, column: 14, scope: !1534)
!1567 = !DILocation(line: 51, column: 18, scope: !1534)
!1568 = !DILocation(line: 51, column: 21, scope: !1534)
!1569 = !DILocation(line: 51, column: 24, scope: !1534)
!1570 = !DILocation(line: 52, column: 5, scope: !1571)
!1571 = distinct !DILexicalBlock(scope: !1534, file: !51, line: 51, column: 30)
!1572 = !DILocation(line: 53, column: 8, scope: !1571)
!1573 = distinct !{!1573, !1565, !1574, !95}
!1574 = !DILocation(line: 54, column: 2, scope: !1534)
!1575 = !DILocation(line: 55, column: 10, scope: !1534)
!1576 = !DILocalVariable(name: "q", scope: !1534, file: !51, line: 34, type: !78)
!1577 = !DILocation(line: 56, column: 13, scope: !1534)
!1578 = !DILocalVariable(name: "qlen", scope: !1534, file: !51, line: 35, type: !29)
!1579 = !DILocation(line: 57, column: 2, scope: !1534)
!1580 = !DILocation(line: 57, column: 14, scope: !1534)
!1581 = !DILocation(line: 57, column: 18, scope: !1534)
!1582 = !DILocation(line: 57, column: 21, scope: !1534)
!1583 = !DILocation(line: 57, column: 24, scope: !1534)
!1584 = !DILocation(line: 58, column: 5, scope: !1585)
!1585 = distinct !DILexicalBlock(scope: !1534, file: !51, line: 57, column: 30)
!1586 = !DILocation(line: 59, column: 8, scope: !1585)
!1587 = distinct !{!1587, !1579, !1588, !95}
!1588 = !DILocation(line: 60, column: 2, scope: !1534)
!1589 = !DILocation(line: 65, column: 18, scope: !1534)
!1590 = !DILocation(line: 65, column: 13, scope: !1534)
!1591 = !DILocation(line: 65, column: 40, scope: !1534)
!1592 = !DILocalVariable(name: "z", scope: !1534, file: !51, line: 40, type: !53)
!1593 = !DILocalVariable(name: "fwlen", scope: !1534, file: !51, line: 36, type: !29)
!1594 = !DILocation(line: 67, column: 2, scope: !1534)
!1595 = !DILocation(line: 67, column: 11, scope: !1534)
!1596 = !DILocation(line: 68, column: 5, scope: !1597)
!1597 = distinct !DILexicalBlock(scope: !1534, file: !51, line: 67, column: 16)
!1598 = !DILocation(line: 69, column: 9, scope: !1597)
!1599 = distinct !{!1599, !1594, !1600, !95}
!1600 = !DILocation(line: 70, column: 2, scope: !1534)
!1601 = !DILocation(line: 74, column: 18, scope: !1534)
!1602 = !DILocation(line: 74, column: 8, scope: !1534)
!1603 = !DILocation(line: 79, column: 8, scope: !1604)
!1604 = distinct !DILexicalBlock(scope: !1534, file: !51, line: 79, column: 6)
!1605 = !DILocation(line: 79, column: 16, scope: !1604)
!1606 = !DILocation(line: 79, column: 6, scope: !1534)
!1607 = !DILocation(line: 80, column: 3, scope: !1608)
!1608 = distinct !DILexicalBlock(scope: !1604, file: !51, line: 79, column: 24)
!1609 = !DILocation(line: 86, column: 14, scope: !1534)
!1610 = !DILocation(line: 86, column: 23, scope: !1534)
!1611 = !DILocation(line: 86, column: 28, scope: !1534)
!1612 = !DILocation(line: 86, column: 9, scope: !1534)
!1613 = !DILocalVariable(name: "xlen", scope: !1534, file: !51, line: 38, type: !29)
!1614 = !DILocation(line: 91, column: 7, scope: !1534)
!1615 = !DILocalVariable(name: "mq", scope: !1534, file: !51, line: 41, type: !113)
!1616 = !DILocation(line: 92, column: 7, scope: !1617)
!1617 = distinct !DILexicalBlock(scope: !1534, file: !51, line: 92, column: 6)
!1618 = !DILocation(line: 92, column: 21, scope: !1617)
!1619 = !DILocation(line: 92, column: 26, scope: !1617)
!1620 = !DILocation(line: 92, column: 6, scope: !1534)
!1621 = !DILocation(line: 93, column: 6, scope: !1622)
!1622 = distinct !DILexicalBlock(scope: !1617, file: !51, line: 92, column: 32)
!1623 = !DILocation(line: 94, column: 2, scope: !1622)
!1624 = !DILocation(line: 99, column: 2, scope: !1534)
!1625 = !DILocation(line: 104, column: 10, scope: !1534)
!1626 = !DILocalVariable(name: "t1", scope: !1534, file: !51, line: 41, type: !113)
!1627 = !DILocation(line: 105, column: 2, scope: !1534)
!1628 = !DILocation(line: 112, column: 14, scope: !1534)
!1629 = !DILocation(line: 112, column: 10, scope: !1534)
!1630 = !DILocalVariable(name: "t2", scope: !1534, file: !51, line: 41, type: !113)
!1631 = !DILocation(line: 113, column: 18, scope: !1534)
!1632 = !DILocation(line: 113, column: 2, scope: !1534)
!1633 = !DILocation(line: 114, column: 2, scope: !1534)
!1634 = !DILocation(line: 125, column: 14, scope: !1534)
!1635 = !DILocation(line: 125, column: 10, scope: !1534)
!1636 = !DILocalVariable(name: "t3", scope: !1534, file: !51, line: 41, type: !113)
!1637 = !DILocation(line: 126, column: 16, scope: !1534)
!1638 = !DILocation(line: 126, column: 2, scope: !1534)
!1639 = !DILocalVariable(name: "u", scope: !1534, file: !51, line: 38, type: !29)
!1640 = !DILocalVariable(name: "r", scope: !1534, file: !51, line: 42, type: !8)
!1641 = !DILocation(line: 129, column: 2, scope: !1534)
!1642 = !DILocation(line: 129, column: 11, scope: !1534)
!1643 = !DILocation(line: 132, column: 5, scope: !1644)
!1644 = distinct !DILexicalBlock(scope: !1534, file: !51, line: 129, column: 16)
!1645 = !DILocation(line: 133, column: 8, scope: !1644)
!1646 = !DILocalVariable(name: "wn", scope: !1644, file: !51, line: 130, type: !8)
!1647 = !DILocation(line: 0, scope: !1644)
!1648 = !DILocation(line: 134, column: 8, scope: !1644)
!1649 = !DILocalVariable(name: "wx", scope: !1644, file: !51, line: 130, type: !8)
!1650 = !DILocation(line: 135, column: 18, scope: !1644)
!1651 = !DILocation(line: 135, column: 12, scope: !1644)
!1652 = !DILocation(line: 135, column: 24, scope: !1644)
!1653 = !DILocation(line: 135, column: 30, scope: !1644)
!1654 = distinct !{!1654, !1641, !1655, !95}
!1655 = !DILocation(line: 136, column: 2, scope: !1534)
!1656 = !DILocation(line: 141, column: 14, scope: !1534)
!1657 = !DILocation(line: 141, column: 10, scope: !1534)
!1658 = !DILocalVariable(name: "mp", scope: !1534, file: !51, line: 41, type: !113)
!1659 = !DILocation(line: 142, column: 2, scope: !1534)
!1660 = !DILocation(line: 142, column: 24, scope: !1534)
!1661 = !DILocation(line: 147, column: 22, scope: !1534)
!1662 = !DILocation(line: 147, column: 8, scope: !1534)
!1663 = !DILocalVariable(name: "q0i", scope: !1534, file: !51, line: 37, type: !114)
!1664 = !DILocation(line: 148, column: 10, scope: !1534)
!1665 = !DILocalVariable(name: "s2", scope: !1534, file: !51, line: 41, type: !113)
!1666 = !DILocation(line: 149, column: 2, scope: !1534)
!1667 = !DILocation(line: 150, column: 33, scope: !1534)
!1668 = !DILocation(line: 150, column: 41, scope: !1534)
!1669 = !DILocation(line: 151, column: 10, scope: !1534)
!1670 = !DILocation(line: 151, column: 6, scope: !1534)
!1671 = !DILocation(line: 151, column: 28, scope: !1534)
!1672 = !DILocation(line: 151, column: 24, scope: !1534)
!1673 = !DILocation(line: 150, column: 7, scope: !1534)
!1674 = !DILocation(line: 150, column: 4, scope: !1534)
!1675 = !DILocation(line: 156, column: 22, scope: !1534)
!1676 = !DILocation(line: 156, column: 8, scope: !1534)
!1677 = !DILocalVariable(name: "p0i", scope: !1534, file: !51, line: 37, type: !114)
!1678 = !DILocation(line: 157, column: 14, scope: !1534)
!1679 = !DILocation(line: 157, column: 10, scope: !1534)
!1680 = !DILocalVariable(name: "s1", scope: !1534, file: !51, line: 41, type: !113)
!1681 = !DILocation(line: 158, column: 2, scope: !1534)
!1682 = !DILocation(line: 159, column: 33, scope: !1534)
!1683 = !DILocation(line: 159, column: 41, scope: !1534)
!1684 = !DILocation(line: 160, column: 10, scope: !1534)
!1685 = !DILocation(line: 160, column: 6, scope: !1534)
!1686 = !DILocation(line: 160, column: 28, scope: !1534)
!1687 = !DILocation(line: 160, column: 24, scope: !1534)
!1688 = !DILocation(line: 159, column: 7, scope: !1534)
!1689 = !DILocation(line: 159, column: 4, scope: !1534)
!1690 = !DILocation(line: 175, column: 14, scope: !1534)
!1691 = !DILocation(line: 175, column: 10, scope: !1534)
!1692 = !DILocation(line: 176, column: 14, scope: !1534)
!1693 = !DILocation(line: 176, column: 10, scope: !1534)
!1694 = !DILocation(line: 177, column: 2, scope: !1534)
!1695 = !DILocation(line: 178, column: 21, scope: !1534)
!1696 = !DILocation(line: 178, column: 2, scope: !1534)
!1697 = !DILocation(line: 179, column: 2, scope: !1534)
!1698 = !DILocation(line: 180, column: 31, scope: !1534)
!1699 = !DILocation(line: 180, column: 39, scope: !1534)
!1700 = !DILocation(line: 180, column: 2, scope: !1534)
!1701 = !DILocation(line: 181, column: 2, scope: !1534)
!1702 = !DILocation(line: 196, column: 2, scope: !1534)
!1703 = !DILocation(line: 202, column: 2, scope: !1534)
!1704 = !DILocation(line: 208, column: 9, scope: !1534)
!1705 = !DILocation(line: 208, column: 15, scope: !1534)
!1706 = !DILocation(line: 208, column: 13, scope: !1534)
!1707 = !DILocation(line: 208, column: 19, scope: !1534)
!1708 = !DILocation(line: 208, column: 2, scope: !1534)
!1709 = !DILocation(line: 209, column: 1, scope: !1534)
!1710 = distinct !DISubprogram(name: "br_i15_zero", scope: !98, file: !98, line: 1537, type: !411, scopeLine: 1538, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !50, retainedNodes: !2)
!1711 = !DILocalVariable(name: "x", arg: 1, scope: !1710, file: !98, line: 1537, type: !113)
!1712 = !DILocation(line: 0, scope: !1710)
!1713 = !DILocalVariable(name: "bit_len", arg: 2, scope: !1710, file: !98, line: 1537, type: !114)
!1714 = !DILocation(line: 1539, column: 5, scope: !1710)
!1715 = !DILocation(line: 1539, column: 8, scope: !1710)
!1716 = !DILocation(line: 1540, column: 2, scope: !1710)
!1717 = !DILocation(line: 1540, column: 17, scope: !1710)
!1718 = !DILocation(line: 1540, column: 25, scope: !1710)
!1719 = !DILocation(line: 1540, column: 31, scope: !1710)
!1720 = !DILocation(line: 1540, column: 15, scope: !1710)
!1721 = !DILocation(line: 1540, column: 37, scope: !1710)
!1722 = !DILocation(line: 1541, column: 1, scope: !1710)
!1723 = distinct !DISubprogram(name: "br_rsa_pkcs1_sig_pad", scope: !58, file: !58, line: 29, type: !1724, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !2)
!1724 = !DISubroutineType(types: !1725)
!1725 = !{!8, !78, !78, !29, !8, !56}
!1726 = !DILocalVariable(name: "hash_oid", arg: 1, scope: !1723, file: !58, line: 29, type: !78)
!1727 = !DILocation(line: 0, scope: !1723)
!1728 = !DILocalVariable(name: "hash", arg: 2, scope: !1723, file: !58, line: 30, type: !78)
!1729 = !DILocalVariable(name: "hash_len", arg: 3, scope: !1723, file: !58, line: 30, type: !29)
!1730 = !DILocalVariable(name: "n_bitlen", arg: 4, scope: !1723, file: !58, line: 31, type: !8)
!1731 = !DILocalVariable(name: "x", arg: 5, scope: !1723, file: !58, line: 31, type: !56)
!1732 = !DILocation(line: 60, column: 19, scope: !1723)
!1733 = !DILocation(line: 60, column: 24, scope: !1723)
!1734 = !DILocation(line: 60, column: 9, scope: !1723)
!1735 = !DILocalVariable(name: "xlen", scope: !1723, file: !58, line: 33, type: !29)
!1736 = !DILocation(line: 62, column: 15, scope: !1737)
!1737 = distinct !DILexicalBlock(scope: !1723, file: !58, line: 62, column: 6)
!1738 = !DILocation(line: 62, column: 6, scope: !1723)
!1739 = !DILocation(line: 63, column: 23, scope: !1740)
!1740 = distinct !DILexicalBlock(scope: !1741, file: !58, line: 63, column: 7)
!1741 = distinct !DILexicalBlock(scope: !1737, file: !58, line: 62, column: 24)
!1742 = !DILocation(line: 63, column: 12, scope: !1740)
!1743 = !DILocation(line: 63, column: 7, scope: !1741)
!1744 = !DILocation(line: 64, column: 4, scope: !1745)
!1745 = distinct !DILexicalBlock(scope: !1740, file: !58, line: 63, column: 29)
!1746 = !DILocation(line: 66, column: 3, scope: !1741)
!1747 = !DILocation(line: 66, column: 8, scope: !1741)
!1748 = !DILocation(line: 67, column: 3, scope: !1741)
!1749 = !DILocation(line: 67, column: 8, scope: !1741)
!1750 = !DILocation(line: 68, column: 12, scope: !1741)
!1751 = !DILocalVariable(name: "u", scope: !1723, file: !58, line: 33, type: !29)
!1752 = !DILocation(line: 69, column: 12, scope: !1741)
!1753 = !DILocation(line: 69, column: 25, scope: !1741)
!1754 = !DILocation(line: 69, column: 3, scope: !1741)
!1755 = !DILocation(line: 70, column: 7, scope: !1741)
!1756 = !DILocation(line: 70, column: 3, scope: !1741)
!1757 = !DILocation(line: 70, column: 12, scope: !1741)
!1758 = !DILocation(line: 71, column: 2, scope: !1741)
!1759 = !DILocation(line: 72, column: 8, scope: !1760)
!1760 = distinct !DILexicalBlock(scope: !1737, file: !58, line: 71, column: 9)
!1761 = !DILocalVariable(name: "x3", scope: !1723, file: !58, line: 33, type: !29)
!1762 = !DILocation(line: 78, column: 18, scope: !1763)
!1763 = distinct !DILexicalBlock(scope: !1760, file: !58, line: 78, column: 7)
!1764 = !DILocation(line: 78, column: 29, scope: !1763)
!1765 = !DILocation(line: 78, column: 12, scope: !1763)
!1766 = !DILocation(line: 78, column: 7, scope: !1760)
!1767 = !DILocation(line: 79, column: 4, scope: !1768)
!1768 = distinct !DILexicalBlock(scope: !1763, file: !58, line: 78, column: 36)
!1769 = !DILocation(line: 81, column: 3, scope: !1760)
!1770 = !DILocation(line: 81, column: 8, scope: !1760)
!1771 = !DILocation(line: 82, column: 3, scope: !1760)
!1772 = !DILocation(line: 82, column: 8, scope: !1760)
!1773 = !DILocation(line: 83, column: 12, scope: !1760)
!1774 = !DILocation(line: 83, column: 17, scope: !1760)
!1775 = !DILocation(line: 83, column: 28, scope: !1760)
!1776 = !DILocation(line: 84, column: 12, scope: !1760)
!1777 = !DILocation(line: 84, column: 25, scope: !1760)
!1778 = !DILocation(line: 84, column: 3, scope: !1760)
!1779 = !DILocation(line: 85, column: 3, scope: !1760)
!1780 = !DILocation(line: 85, column: 8, scope: !1760)
!1781 = !DILocation(line: 86, column: 7, scope: !1760)
!1782 = !DILocation(line: 86, column: 3, scope: !1760)
!1783 = !DILocation(line: 86, column: 12, scope: !1760)
!1784 = !DILocation(line: 87, column: 17, scope: !1760)
!1785 = !DILocation(line: 87, column: 28, scope: !1760)
!1786 = !DILocation(line: 87, column: 14, scope: !1760)
!1787 = !DILocation(line: 87, column: 7, scope: !1760)
!1788 = !DILocation(line: 87, column: 3, scope: !1760)
!1789 = !DILocation(line: 87, column: 12, scope: !1760)
!1790 = !DILocation(line: 88, column: 7, scope: !1760)
!1791 = !DILocation(line: 88, column: 3, scope: !1760)
!1792 = !DILocation(line: 88, column: 12, scope: !1760)
!1793 = !DILocation(line: 89, column: 17, scope: !1760)
!1794 = !DILocation(line: 89, column: 14, scope: !1760)
!1795 = !DILocation(line: 89, column: 7, scope: !1760)
!1796 = !DILocation(line: 89, column: 3, scope: !1760)
!1797 = !DILocation(line: 89, column: 12, scope: !1760)
!1798 = !DILocation(line: 90, column: 7, scope: !1760)
!1799 = !DILocation(line: 90, column: 3, scope: !1760)
!1800 = !DILocation(line: 90, column: 12, scope: !1760)
!1801 = !DILocation(line: 91, column: 12, scope: !1760)
!1802 = !DILocation(line: 91, column: 16, scope: !1760)
!1803 = !DILocation(line: 91, column: 34, scope: !1760)
!1804 = !DILocation(line: 91, column: 3, scope: !1760)
!1805 = !DILocation(line: 92, column: 11, scope: !1760)
!1806 = !DILocation(line: 92, column: 5, scope: !1760)
!1807 = !DILocation(line: 93, column: 7, scope: !1760)
!1808 = !DILocation(line: 93, column: 3, scope: !1760)
!1809 = !DILocation(line: 93, column: 11, scope: !1760)
!1810 = !DILocation(line: 94, column: 7, scope: !1760)
!1811 = !DILocation(line: 94, column: 3, scope: !1760)
!1812 = !DILocation(line: 94, column: 11, scope: !1760)
!1813 = !DILocation(line: 95, column: 7, scope: !1760)
!1814 = !DILocation(line: 95, column: 3, scope: !1760)
!1815 = !DILocation(line: 95, column: 11, scope: !1760)
!1816 = !DILocation(line: 96, column: 13, scope: !1760)
!1817 = !DILocation(line: 96, column: 7, scope: !1760)
!1818 = !DILocation(line: 96, column: 3, scope: !1760)
!1819 = !DILocation(line: 96, column: 11, scope: !1760)
!1820 = !DILocation(line: 0, scope: !1737)
!1821 = !DILocation(line: 98, column: 11, scope: !1723)
!1822 = !DILocation(line: 98, column: 2, scope: !1723)
!1823 = !DILocation(line: 99, column: 2, scope: !1723)
!1824 = !DILocation(line: 100, column: 1, scope: !1723)
!1825 = distinct !DISubprogram(name: "sign_wrapper", scope: !61, file: !61, line: 3, type: !1826, scopeLine: 5, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !60, retainedNodes: !2)
!1826 = !DISubroutineType(types: !1827)
!1827 = !{null, !78, !78, !29, !1828, !56}
!1828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1829, size: 64)
!1829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1830)
!1830 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_rsa_private_key", file: !1505, line: 205, baseType: !1831)
!1831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1505, line: 182, size: 704, elements: !1832)
!1832 = !{!1833, !1834, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843}
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "n_bitlen", scope: !1831, file: !1505, line: 184, baseType: !8, size: 32)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !1831, file: !1505, line: 186, baseType: !56, size: 64, offset: 64)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !1831, file: !1505, line: 188, baseType: !29, size: 64, offset: 128)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "q", scope: !1831, file: !1505, line: 190, baseType: !56, size: 64, offset: 192)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "qlen", scope: !1831, file: !1505, line: 192, baseType: !29, size: 64, offset: 256)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "dp", scope: !1831, file: !1505, line: 194, baseType: !56, size: 64, offset: 320)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "dplen", scope: !1831, file: !1505, line: 196, baseType: !29, size: 64, offset: 384)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "dq", scope: !1831, file: !1505, line: 198, baseType: !56, size: 64, offset: 448)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "dqlen", scope: !1831, file: !1505, line: 200, baseType: !29, size: 64, offset: 512)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "iq", scope: !1831, file: !1505, line: 202, baseType: !56, size: 64, offset: 576)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "iqlen", scope: !1831, file: !1505, line: 204, baseType: !29, size: 64, offset: 640)
!1844 = !DILocalVariable(name: "hash_oid", arg: 1, scope: !1825, file: !61, line: 3, type: !78)
!1845 = !DILocation(line: 0, scope: !1825)
!1846 = !DILocalVariable(name: "hash", arg: 2, scope: !1825, file: !61, line: 4, type: !78)
!1847 = !DILocalVariable(name: "hash_len", arg: 3, scope: !1825, file: !61, line: 4, type: !29)
!1848 = !DILocalVariable(name: "sk", arg: 4, scope: !1825, file: !61, line: 5, type: !1828)
!1849 = !DILocalVariable(name: "x", arg: 5, scope: !1825, file: !61, line: 5, type: !56)
!1850 = !DILocation(line: 6, column: 12, scope: !1825)
!1851 = !DILocation(line: 6, column: 2, scope: !1825)
!1852 = !DILocation(line: 7, column: 12, scope: !1825)
!1853 = !DILocation(line: 7, column: 2, scope: !1825)
!1854 = !DILocation(line: 8, column: 12, scope: !1825)
!1855 = !DILocation(line: 8, column: 2, scope: !1825)
!1856 = !DILocation(line: 9, column: 12, scope: !1825)
!1857 = !DILocation(line: 9, column: 2, scope: !1825)
!1858 = !DILocation(line: 10, column: 12, scope: !1825)
!1859 = !DILocation(line: 10, column: 2, scope: !1825)
!1860 = !DILocation(line: 12, column: 30, scope: !1825)
!1861 = !DILocation(line: 12, column: 12, scope: !1825)
!1862 = !DILocation(line: 12, column: 2, scope: !1825)
!1863 = !DILocation(line: 13, column: 30, scope: !1825)
!1864 = !DILocation(line: 13, column: 12, scope: !1825)
!1865 = !DILocation(line: 13, column: 2, scope: !1825)
!1866 = !DILocation(line: 14, column: 30, scope: !1825)
!1867 = !DILocation(line: 14, column: 12, scope: !1825)
!1868 = !DILocation(line: 14, column: 2, scope: !1825)
!1869 = !DILocation(line: 15, column: 30, scope: !1825)
!1870 = !DILocation(line: 15, column: 12, scope: !1825)
!1871 = !DILocation(line: 15, column: 2, scope: !1825)
!1872 = !DILocation(line: 16, column: 30, scope: !1825)
!1873 = !DILocation(line: 16, column: 12, scope: !1825)
!1874 = !DILocation(line: 16, column: 2, scope: !1825)
!1875 = !DILocation(line: 18, column: 30, scope: !1825)
!1876 = !DILocation(line: 18, column: 12, scope: !1825)
!1877 = !DILocation(line: 18, column: 2, scope: !1825)
!1878 = !DILocation(line: 19, column: 30, scope: !1825)
!1879 = !DILocation(line: 19, column: 12, scope: !1825)
!1880 = !DILocation(line: 19, column: 2, scope: !1825)
!1881 = !DILocation(line: 20, column: 30, scope: !1825)
!1882 = !DILocation(line: 20, column: 12, scope: !1825)
!1883 = !DILocation(line: 20, column: 2, scope: !1825)
!1884 = !DILocation(line: 21, column: 30, scope: !1825)
!1885 = !DILocation(line: 21, column: 12, scope: !1825)
!1886 = !DILocation(line: 21, column: 2, scope: !1825)
!1887 = !DILocation(line: 22, column: 30, scope: !1825)
!1888 = !DILocation(line: 22, column: 12, scope: !1825)
!1889 = !DILocation(line: 22, column: 2, scope: !1825)
!1890 = !DILocation(line: 23, column: 30, scope: !1825)
!1891 = !DILocation(line: 23, column: 12, scope: !1825)
!1892 = !DILocation(line: 23, column: 2, scope: !1825)
!1893 = !DILocation(line: 24, column: 30, scope: !1825)
!1894 = !DILocation(line: 24, column: 12, scope: !1825)
!1895 = !DILocation(line: 24, column: 2, scope: !1825)
!1896 = !DILocation(line: 26, column: 12, scope: !1825)
!1897 = !DILocation(line: 26, column: 2, scope: !1825)
!1898 = !DILocation(line: 27, column: 12, scope: !1825)
!1899 = !DILocation(line: 27, column: 2, scope: !1825)
!1900 = !DILocation(line: 28, column: 12, scope: !1825)
!1901 = !DILocation(line: 28, column: 2, scope: !1825)
!1902 = !DILocation(line: 31, column: 2, scope: !1825)
!1903 = !DILocation(line: 32, column: 1, scope: !1825)
!1904 = distinct !DISubprogram(name: "sign_wrapper_t", scope: !61, file: !61, line: 50, type: !1905, scopeLine: 50, spFlags: DISPFlagDefinition, unit: !60, retainedNodes: !2)
!1905 = !DISubroutineType(types: !1906)
!1906 = !{null}
!1907 = !DILocation(line: 52, column: 33, scope: !1904)
!1908 = !DILocalVariable(name: "hash_oid", scope: !1904, file: !61, line: 52, type: !78)
