; ModuleID = 'remove_padding-k.ll'
source_filename = "remove_padding.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ssl_st = type { i8*, i64, %struct.ssl3_state_st*, %struct.evp_cipher_ctx_st*, i32 }
%struct.ssl3_state_st = type { i64, [8 x i8] }
%struct.evp_cipher_ctx_st = type { %struct.evp_cipher_st* }
%struct.evp_cipher_st = type { i64 }
%struct.ssl3_record_st = type { i32, i8*, i32, i8* }
%struct.smack_value = type { i8* }

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @ssl3_cbc_remove_padding(%struct.ssl_st* %0, %struct.ssl3_record_st* %1, i32 %2, i32 %3) #0 !dbg !10 {
  call void @llvm.dbg.value(metadata %struct.ssl_st* %0, metadata !57, metadata !DIExpression()), !dbg !58, !psr.id !59
  call void @llvm.dbg.value(metadata %struct.ssl3_record_st* %1, metadata !60, metadata !DIExpression()), !dbg !58, !psr.id !61
  call void @llvm.dbg.value(metadata i32 %2, metadata !62, metadata !DIExpression()), !dbg !58, !psr.id !63
  call void @llvm.dbg.value(metadata i32 %3, metadata !64, metadata !DIExpression()), !dbg !58, !psr.id !65
  %5 = add i32 1, %3, !dbg !66, !psr.id !67
  call void @llvm.dbg.value(metadata i32 %5, metadata !68, metadata !DIExpression()), !dbg !58, !psr.id !70
  %6 = getelementptr inbounds %struct.ssl3_record_st, %struct.ssl3_record_st* %1, i32 0, i32 0, !dbg !71, !psr.id !73
  %7 = load i32, i32* %6, align 8, !dbg !71, !psr.id !74

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "remove_padding.c", directory: "/home/luwei/bech-back/OpenSSL/ssl3_cbc")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!10 = distinct !DISubprogram(name: "ssl3_cbc_remove_padding", scope: !11, file: !11, line: 52, type: !12, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DIFile(filename: "./../ssl3_cbc_remove_padding.c", directory: "/home/luwei/bech-back/OpenSSL/ssl3_cbc")
!12 = !DISubroutineType(types: !13)
!13 = !{!4, !14, !48, !5, !5}
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !11, line: 32, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !11, line: 26, size: 320, elements: !18)
!18 = !{!19, !22, !24, !35, !47}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "expand", scope: !17, file: !11, line: 27, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !17, file: !11, line: 28, baseType: !23, size: 64, offset: 64)
!23 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "s3", scope: !17, file: !11, line: 29, baseType: !25, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_state_st", file: !11, line: 13, size: 128, elements: !27)
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !26, file: !11, line: 14, baseType: !29, size: 64)
!29 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "read_sequence", scope: !26, file: !11, line: 15, baseType: !31, size: 64, offset: 64)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64, elements: !33)
!32 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!33 = !{!34}
!34 = !DISubrange(count: 8)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "enc_read_ctx", scope: !17, file: !11, line: 30, baseType: !36, size: 64, offset: 192)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER_CTX", file: !11, line: 24, baseType: !38)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_ctx_st", file: !11, line: 22, size: 64, elements: !39)
!39 = !{!40}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !38, file: !11, line: 23, baseType: !41, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !11, line: 20, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !11, line: 18, size: 64, elements: !45)
!45 = !{!46}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !44, file: !11, line: 19, baseType: !23, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "slicing_cheat", scope: !17, file: !11, line: 31, baseType: !4, size: 32, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL3_RECORD", file: !11, line: 11, baseType: !50)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_record_st", file: !11, line: 6, size: 256, elements: !51)
!51 = !{!52, !53, !55, !56}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !50, file: !11, line: 7, baseType: !5, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !50, file: !11, line: 8, baseType: !54, size: 64, offset: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !50, file: !11, line: 9, baseType: !4, size: 32, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !50, file: !11, line: 10, baseType: !54, size: 64, offset: 192)
!57 = !DILocalVariable(name: "s", arg: 1, scope: !10, file: !11, line: 52, type: !14)
!58 = !DILocation(line: 0, scope: !10)
!59 = !{!"0"}
!60 = !DILocalVariable(name: "rec", arg: 2, scope: !10, file: !11, line: 53, type: !48)
!61 = !{!"1"}
!62 = !DILocalVariable(name: "block_size", arg: 3, scope: !10, file: !11, line: 54, type: !5)
!63 = !{!"2"}
!64 = !DILocalVariable(name: "mac_size", arg: 4, scope: !10, file: !11, line: 54, type: !5)
!65 = !{!"3"}
!66 = !DILocation(line: 57, column: 60, scope: !10)
!67 = !{!"4"}
!68 = !DILocalVariable(name: "overhead", scope: !10, file: !11, line: 57, type: !69)
!69 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!70 = !{!"5"}
!71 = !DILocation(line: 62, column: 25, scope: !72)
!72 = distinct !DILexicalBlock(scope: !10, file: !11, line: 62, column: 9)
!73 = !{!"6"}
!74 = !{!"7"}
!75 = !DILocation(line: 62, column: 18, scope: !72)
!76 = !{!"8"}
!77 = !DILocation(line: 62, column: 9, scope: !10)
!78 = !{!"9"}
!79 = !DILocation(line: 63, column: 9, scope: !72)
!80 = !{!"10"}
!81 = !DILocation(line: 65, column: 27, scope: !10)
!82 = !{!"11"}
!83 = !{!"12"}
!84 = !{!"PointTainted"}
!85 = !DILocation(line: 65, column: 37, scope: !10)
!86 = !{!"13"}
!87 = !{!"14"}
!88 = !DILocation(line: 65, column: 44, scope: !10)
!89 = !{!"15"}
!90 = !DILocation(line: 65, column: 22, scope: !10)
!91 = !{!"16"}
!92 = !{!"17"}
!93 = !{!"18"}
!94 = !{!"ValueTainted"}
!95 = !{!"19"}
!96 = !DILocalVariable(name: "padding_length", scope: !10, file: !11, line: 56, type: !5)
!97 = !{!"20"}
!98 = !DILocation(line: 66, column: 34, scope: !10)
!99 = !{!"21"}
!100 = !{!"22"}
!101 = !DILocation(line: 66, column: 57, scope: !10)
!102 = !{!"23"}
!103 = !DILocation(line: 66, column: 12, scope: !10)
!104 = !{!"24"}
!105 = !DILocalVariable(name: "good", scope: !10, file: !11, line: 56, type: !5)
!106 = !{!"25"}
!107 = !DILocation(line: 68, column: 57, scope: !10)
!108 = !{!"26"}
!109 = !DILocation(line: 68, column: 13, scope: !10)
!110 = !{!"27"}
!111 = !DILocation(line: 68, column: 10, scope: !10)
!112 = !{!"28"}
!113 = !{!"29"}
!114 = !DILocation(line: 69, column: 45, scope: !10)
!115 = !{!"30"}
!116 = !DILocation(line: 69, column: 27, scope: !10)
!117 = !{!"31"}
!118 = !{!"32"}
!119 = !DILocation(line: 70, column: 10, scope: !10)
!120 = !{!"33"}
!121 = !DILocation(line: 70, column: 17, scope: !10)
!122 = !{!"34"}
!123 = !{!"35"}
!124 = !{!"36"}
!125 = !DILocation(line: 71, column: 33, scope: !10)
!126 = !{!"37"}
!127 = !DILocation(line: 71, column: 10, scope: !10)
!128 = !{!"38"}
!129 = !DILocation(line: 71, column: 15, scope: !10)
!130 = !{!"39"}
!131 = !{!"40"}
!132 = !{!"41"}
!133 = !DILocation(line: 72, column: 12, scope: !10)
!134 = !{!"42"}
!135 = !DILocation(line: 72, column: 5, scope: !10)
!136 = !{!"43"}
!137 = !{!"44"}
!138 = !DILocation(line: 73, column: 1, scope: !10)
!139 = !{!"45"}
!140 = distinct !DISubprogram(name: "constant_time_ge", scope: !141, file: !141, line: 148, type: !142, scopeLine: 149, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !0, retainedNodes: !2)
!141 = !DIFile(filename: "./../constant_time_locl.h", directory: "/home/luwei/bech-back/OpenSSL/ssl3_cbc")
!142 = !DISubroutineType(types: !143)
!143 = !{!5, !5, !5}
!144 = !DILocalVariable(name: "a", arg: 1, scope: !140, file: !141, line: 148, type: !5)
!145 = !DILocation(line: 0, scope: !140)
!146 = !{!"46"}
!147 = !DILocalVariable(name: "b", arg: 2, scope: !140, file: !141, line: 148, type: !5)
!148 = !{!"47"}
!149 = !DILocation(line: 150, column: 13, scope: !140)
!150 = !{!"48"}
!151 = !DILocation(line: 150, column: 12, scope: !140)
!152 = !{!"49"}
!153 = !DILocation(line: 150, column: 5, scope: !140)
!154 = !{!"50"}
