; ModuleID = 'api_mul.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.br_ec_impl = type { i32, i8* (i32, i64*)*, i8* (i32, i64*)*, i64 (i32, i64*)*, i32 (i8*, i64, i8*, i64, i32)*, i64 (i8*, i8*, i64, i32)*, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* }
%struct.smack_value = type { i8* }
%struct.p256_jacobian = type { [9 x i32], [9 x i32], [9 x i32] }

@br_ec_p256_m31 = dso_local constant %struct.br_ec_impl { i32 8388608, i8* (i32, i64*)* @api_generator, i8* (i32, i64*)* @api_order, i64 (i32, i64*)* @api_xoff, i32 (i8*, i64, i8*, i64, i32)* @api_mul, i64 (i8*, i8*, i64, i32)* @api_mulgen, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* @api_muladd }, align 8, !dbg !0
@F256 = internal constant [9 x i32] [i32 1073741823, i32 1073741823, i32 1073741823, i32 63, i32 0, i32 0, i32 4096, i32 1073725440, i32 65535], align 16, !dbg !37

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "br_ec_p256_m31", scope: !2, file: !3, line: 1461, type: !51, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !25, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../BearSSL/src/ec/ec_p256_m31.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m31")
!4 = !{}
!5 = !{!6, !12, !16, !20, !23, !24}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !8, line: 27, baseType: !9)
!8 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !10, line: 44, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!11 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 26, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 42, baseType: !15)
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !8, line: 26, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !10, line: 41, baseType: !19)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !13, line: 27, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !10, line: 45, baseType: !22)
!22 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !{!0, !26, !32, !37, !43, !45}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "P256_G", scope: !2, file: !3, line: 1338, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 520, elements: !30)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!30 = !{!31}
!31 = !DISubrange(count: 65)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "P256_N", scope: !2, file: !3, line: 1348, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 32)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "F256", scope: !2, file: !3, line: 298, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 288, elements: !41)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!41 = !{!42}
!42 = !DISubrange(count: 9)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "P256_B", scope: !2, file: !3, line: 307, type: !39, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "Gwin", scope: !2, file: !3, line: 1172, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8640, elements: !48)
!48 = !{!49, !50}
!49 = !DISubrange(count: 15)
!50 = !DISubrange(count: 18)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !53, line: 415, baseType: !54)
!53 = !DIFile(filename: "../BearSSL/inc/bearssl_ec.h", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m31")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 270, size: 448, elements: !55)
!55 = !{!56, !57, !65, !66, !70, !75, !79}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !54, file: !53, line: 279, baseType: !12, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !54, file: !53, line: 292, baseType: !58, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !19, !62}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 46, baseType: !22)
!64 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !54, file: !53, line: 306, baseType: !58, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !54, file: !53, line: 318, baseType: !67, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!63, !19, !62}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !54, file: !53, line: 350, baseType: !71, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!12, !74, !63, !61, !63, !19}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !54, file: !53, line: 366, baseType: !76, size: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!63, !74, !61, !63, !19}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !54, file: !53, line: 412, baseType: !80, size: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!12, !74, !61, !63, !61, !63, !61, !63, !19}
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !84, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!84 = !DIFile(filename: "api_mul.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m31")
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!86 = !DIFile(filename: "../BearSSL/src/codec/ccopy.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m31")
!87 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!88 = !{i32 7, !"Dwarf Version", i32 4}
!89 = !{i32 2, !"Debug Info Version", i32 3}
!90 = !{i32 1, !"wchar_size", i32 4}
!91 = distinct !DISubprogram(name: "api_mul_wrapper", scope: !84, file: !84, line: 7, type: !92, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !83, retainedNodes: !4)
!92 = !DISubroutineType(types: !93)
!93 = !{null, !74, !63, !61, !63, !19}
!94 = !DILocalVariable(name: "G", arg: 1, scope: !91, file: !84, line: 7, type: !74)
!95 = !DILocation(line: 0, scope: !91)
!96 = !DILocalVariable(name: "Glen", arg: 2, scope: !91, file: !84, line: 7, type: !63)
!97 = !DILocalVariable(name: "kb", arg: 3, scope: !91, file: !84, line: 8, type: !61)
!98 = !DILocalVariable(name: "kblen", arg: 4, scope: !91, file: !84, line: 8, type: !63)
!99 = !DILocalVariable(name: "curve", arg: 5, scope: !91, file: !84, line: 8, type: !19)
!100 = !DILocation(line: 9, column: 12, scope: !91)
!101 = !DILocation(line: 9, column: 2, scope: !91)
!102 = !DILocation(line: 10, column: 12, scope: !91)
!103 = !DILocation(line: 10, column: 2, scope: !91)
!104 = !DILocation(line: 11, column: 12, scope: !91)
!105 = !DILocation(line: 11, column: 2, scope: !91)
!106 = !DILocation(line: 12, column: 12, scope: !91)
!107 = !DILocation(line: 12, column: 2, scope: !91)
!108 = !DILocation(line: 13, column: 12, scope: !91)
!109 = !DILocation(line: 13, column: 2, scope: !91)
!110 = !DILocation(line: 15, column: 12, scope: !91)
!111 = !DILocation(line: 15, column: 2, scope: !91)
!112 = !DILocalVariable(name: "iec", scope: !91, file: !84, line: 16, type: !113)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !53, line: 415, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 270, size: 448, elements: !117)
!117 = !{!118, !119, !120, !121, !122, !123, !124}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !116, file: !53, line: 279, baseType: !12, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !116, file: !53, line: 292, baseType: !58, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !116, file: !53, line: 306, baseType: !58, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !116, file: !53, line: 318, baseType: !67, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !116, file: !53, line: 350, baseType: !71, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !116, file: !53, line: 366, baseType: !76, size: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !116, file: !53, line: 412, baseType: !80, size: 64, offset: 384)
!125 = !DILocation(line: 18, column: 7, scope: !91)
!126 = !DILocation(line: 18, column: 2, scope: !91)
!127 = !DILocation(line: 19, column: 1, scope: !91)
!128 = distinct !DISubprogram(name: "api_mul_wrapper_t", scope: !84, file: !84, line: 30, type: !129, scopeLine: 30, spFlags: DISPFlagDefinition, unit: !83, retainedNodes: !4)
!129 = !DISubroutineType(types: !130)
!130 = !{null}
!131 = !DILocation(line: 32, column: 21, scope: !128)
!132 = !DILocalVariable(name: "G", scope: !128, file: !84, line: 32, type: !74)
!133 = !DILocation(line: 0, scope: !128)
!134 = !DILocation(line: 33, column: 17, scope: !128)
!135 = !DILocalVariable(name: "Glen", scope: !128, file: !84, line: 33, type: !63)
!136 = !DILocation(line: 34, column: 28, scope: !128)
!137 = !DILocalVariable(name: "kb", scope: !128, file: !84, line: 34, type: !61)
!138 = !DILocation(line: 35, column: 18, scope: !128)
!139 = !DILocalVariable(name: "kblen", scope: !128, file: !84, line: 35, type: !63)
!140 = !DILocalVariable(name: "curve", scope: !128, file: !84, line: 36, type: !19)
!141 = !DILocalVariable(name: "iec", scope: !128, file: !84, line: 38, type: !113)
!142 = !DILocation(line: 40, column: 7, scope: !128)
!143 = !DILocation(line: 40, column: 2, scope: !128)
!144 = !DILocation(line: 41, column: 1, scope: !128)
!145 = distinct !DISubprogram(name: "br_ccopy", scope: !86, file: !86, line: 29, type: !146, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !85, retainedNodes: !4)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !12, !24, !148, !63}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!150 = !DILocalVariable(name: "ctl", arg: 1, scope: !145, file: !86, line: 29, type: !12)
!151 = !DILocation(line: 0, scope: !145)
!152 = !DILocalVariable(name: "dst", arg: 2, scope: !145, file: !86, line: 29, type: !24)
!153 = !DILocalVariable(name: "src", arg: 3, scope: !145, file: !86, line: 29, type: !148)
!154 = !DILocalVariable(name: "len", arg: 4, scope: !145, file: !86, line: 29, type: !63)
!155 = !DILocalVariable(name: "d", scope: !145, file: !86, line: 31, type: !74)
!156 = !DILocalVariable(name: "s", scope: !145, file: !86, line: 32, type: !61)
!157 = !DILocation(line: 36, column: 2, scope: !145)
!158 = !DILocation(line: 36, column: 13, scope: !145)
!159 = !DILocation(line: 36, column: 16, scope: !145)
!160 = !DILocation(line: 39, column: 10, scope: !161)
!161 = distinct !DILexicalBlock(scope: !145, file: !86, line: 36, column: 21)
!162 = !DILocation(line: 39, column: 7, scope: !161)
!163 = !DILocalVariable(name: "x", scope: !161, file: !86, line: 37, type: !12)
!164 = !DILocation(line: 0, scope: !161)
!165 = !DILocation(line: 40, column: 7, scope: !161)
!166 = !DILocalVariable(name: "y", scope: !161, file: !86, line: 37, type: !12)
!167 = !DILocation(line: 41, column: 8, scope: !161)
!168 = !DILocation(line: 41, column: 6, scope: !161)
!169 = !DILocation(line: 42, column: 5, scope: !161)
!170 = distinct !{!170, !157, !171, !172}
!171 = !DILocation(line: 43, column: 2, scope: !145)
!172 = !{!"llvm.loop.mustprogress"}
!173 = !DILocation(line: 44, column: 1, scope: !145)
!174 = distinct !DISubprogram(name: "MUX", scope: !175, file: !175, line: 770, type: !176, scopeLine: 771, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !85, retainedNodes: !4)
!175 = !DIFile(filename: "../BearSSL/src/inner.h", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m31")
!176 = !DISubroutineType(types: !177)
!177 = !{!12, !12, !12, !12}
!178 = !DILocalVariable(name: "ctl", arg: 1, scope: !174, file: !175, line: 770, type: !12)
!179 = !DILocation(line: 0, scope: !174)
!180 = !DILocalVariable(name: "x", arg: 2, scope: !174, file: !175, line: 770, type: !12)
!181 = !DILocalVariable(name: "y", arg: 3, scope: !174, file: !175, line: 770, type: !12)
!182 = !DILocation(line: 772, column: 14, scope: !174)
!183 = !DILocation(line: 772, column: 24, scope: !174)
!184 = !DILocation(line: 772, column: 19, scope: !174)
!185 = !DILocation(line: 772, column: 11, scope: !174)
!186 = !DILocation(line: 772, column: 2, scope: !174)
!187 = distinct !DISubprogram(name: "api_generator", scope: !3, file: !3, line: 1356, type: !59, scopeLine: 1357, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!188 = !DILocalVariable(name: "curve", arg: 1, scope: !187, file: !3, line: 1356, type: !19)
!189 = !DILocation(line: 0, scope: !187)
!190 = !DILocalVariable(name: "len", arg: 2, scope: !187, file: !3, line: 1356, type: !62)
!191 = !DILocation(line: 1359, column: 7, scope: !187)
!192 = !DILocation(line: 1360, column: 2, scope: !187)
!193 = distinct !DISubprogram(name: "api_order", scope: !3, file: !3, line: 1364, type: !59, scopeLine: 1365, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!194 = !DILocalVariable(name: "curve", arg: 1, scope: !193, file: !3, line: 1364, type: !19)
!195 = !DILocation(line: 0, scope: !193)
!196 = !DILocalVariable(name: "len", arg: 2, scope: !193, file: !3, line: 1364, type: !62)
!197 = !DILocation(line: 1367, column: 7, scope: !193)
!198 = !DILocation(line: 1368, column: 2, scope: !193)
!199 = distinct !DISubprogram(name: "api_xoff", scope: !3, file: !3, line: 1372, type: !68, scopeLine: 1373, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!200 = !DILocalVariable(name: "curve", arg: 1, scope: !199, file: !3, line: 1372, type: !19)
!201 = !DILocation(line: 0, scope: !199)
!202 = !DILocalVariable(name: "len", arg: 2, scope: !199, file: !3, line: 1372, type: !62)
!203 = !DILocation(line: 1375, column: 7, scope: !199)
!204 = !DILocation(line: 1376, column: 2, scope: !199)
!205 = distinct !DISubprogram(name: "api_mul", scope: !3, file: !3, line: 1380, type: !72, scopeLine: 1382, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!206 = !DILocalVariable(name: "G", arg: 1, scope: !205, file: !3, line: 1380, type: !74)
!207 = !DILocation(line: 0, scope: !205)
!208 = !DILocalVariable(name: "Glen", arg: 2, scope: !205, file: !3, line: 1380, type: !63)
!209 = !DILocalVariable(name: "x", arg: 3, scope: !205, file: !3, line: 1381, type: !61)
!210 = !DILocalVariable(name: "xlen", arg: 4, scope: !205, file: !3, line: 1381, type: !63)
!211 = !DILocalVariable(name: "curve", arg: 5, scope: !205, file: !3, line: 1381, type: !19)
!212 = !DILocalVariable(name: "P", scope: !205, file: !3, line: 1384, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "p256_jacobian", file: !3, line: 654, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 650, size: 864, elements: !215)
!215 = !{!216, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !214, file: !3, line: 651, baseType: !217, size: 288)
!217 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 288, elements: !41)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !214, file: !3, line: 652, baseType: !217, size: 288, offset: 288)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !214, file: !3, line: 653, baseType: !217, size: 288, offset: 576)
!220 = !DILocation(line: 1384, column: 16, scope: !205)
!221 = !DILocation(line: 1387, column: 11, scope: !222)
!222 = distinct !DILexicalBlock(scope: !205, file: !3, line: 1387, column: 6)
!223 = !DILocation(line: 1387, column: 6, scope: !205)
!224 = !DILocation(line: 1388, column: 3, scope: !225)
!225 = distinct !DILexicalBlock(scope: !222, file: !3, line: 1387, column: 18)
!226 = !DILocation(line: 1390, column: 6, scope: !205)
!227 = !DILocalVariable(name: "r", scope: !205, file: !3, line: 1383, type: !12)
!228 = !DILocation(line: 1391, column: 2, scope: !205)
!229 = !DILocation(line: 1392, column: 2, scope: !205)
!230 = !DILocation(line: 1393, column: 2, scope: !205)
!231 = !DILocation(line: 1394, column: 2, scope: !205)
!232 = !DILocation(line: 1395, column: 1, scope: !205)
!233 = distinct !DISubprogram(name: "api_mulgen", scope: !3, file: !3, line: 1398, type: !77, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!234 = !DILocalVariable(name: "R", arg: 1, scope: !233, file: !3, line: 1398, type: !74)
!235 = !DILocation(line: 0, scope: !233)
!236 = !DILocalVariable(name: "x", arg: 2, scope: !233, file: !3, line: 1399, type: !61)
!237 = !DILocalVariable(name: "xlen", arg: 3, scope: !233, file: !3, line: 1399, type: !63)
!238 = !DILocalVariable(name: "curve", arg: 4, scope: !233, file: !3, line: 1399, type: !19)
!239 = !DILocalVariable(name: "P", scope: !233, file: !3, line: 1401, type: !213)
!240 = !DILocation(line: 1401, column: 16, scope: !233)
!241 = !DILocation(line: 1404, column: 2, scope: !233)
!242 = !DILocation(line: 1405, column: 2, scope: !233)
!243 = !DILocation(line: 1406, column: 2, scope: !233)
!244 = !DILocation(line: 1407, column: 2, scope: !233)
!245 = distinct !DISubprogram(name: "api_muladd", scope: !3, file: !3, line: 1411, type: !81, scopeLine: 1414, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!246 = !DILocalVariable(name: "A", arg: 1, scope: !245, file: !3, line: 1411, type: !74)
!247 = !DILocation(line: 0, scope: !245)
!248 = !DILocalVariable(name: "B", arg: 2, scope: !245, file: !3, line: 1411, type: !61)
!249 = !DILocalVariable(name: "len", arg: 3, scope: !245, file: !3, line: 1411, type: !63)
!250 = !DILocalVariable(name: "x", arg: 4, scope: !245, file: !3, line: 1412, type: !61)
!251 = !DILocalVariable(name: "xlen", arg: 5, scope: !245, file: !3, line: 1412, type: !63)
!252 = !DILocalVariable(name: "y", arg: 6, scope: !245, file: !3, line: 1413, type: !61)
!253 = !DILocalVariable(name: "ylen", arg: 7, scope: !245, file: !3, line: 1413, type: !63)
!254 = !DILocalVariable(name: "curve", arg: 8, scope: !245, file: !3, line: 1413, type: !19)
!255 = !DILocalVariable(name: "P", scope: !245, file: !3, line: 1415, type: !213)
!256 = !DILocation(line: 1415, column: 16, scope: !245)
!257 = !DILocalVariable(name: "Q", scope: !245, file: !3, line: 1415, type: !213)
!258 = !DILocation(line: 1415, column: 19, scope: !245)
!259 = !DILocation(line: 1420, column: 10, scope: !260)
!260 = distinct !DILexicalBlock(scope: !245, file: !3, line: 1420, column: 6)
!261 = !DILocation(line: 1420, column: 6, scope: !245)
!262 = !DILocation(line: 1421, column: 3, scope: !263)
!263 = distinct !DILexicalBlock(scope: !260, file: !3, line: 1420, column: 17)
!264 = !DILocation(line: 1423, column: 6, scope: !245)
!265 = !DILocalVariable(name: "r", scope: !245, file: !3, line: 1416, type: !12)
!266 = !DILocation(line: 1424, column: 2, scope: !245)
!267 = !DILocation(line: 1425, column: 8, scope: !268)
!268 = distinct !DILexicalBlock(scope: !245, file: !3, line: 1425, column: 6)
!269 = !DILocation(line: 1425, column: 6, scope: !245)
!270 = !DILocation(line: 1426, column: 3, scope: !271)
!271 = distinct !DILexicalBlock(scope: !268, file: !3, line: 1425, column: 17)
