; ModuleID = 'api_mul-k.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.br_ec_impl = type { i32, i8* (i32, i64*)*, i8* (i32, i64*)*, i64 (i32, i64*)*, i32 (i8*, i64, i8*, i64, i32)*, i64 (i8*, i8*, i64, i32)*, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* }
%struct.smack_value = type { i8* }
%struct.p256_jacobian = type { [9 x i32], [9 x i32], [9 x i32] }

@br_ec_p256_m31 = dso_local constant %struct.br_ec_impl { i32 8388608, i8* (i32, i64*)* @api_generator, i8* (i32, i64*)* @api_order, i64 (i32, i64*)* @api_xoff, i32 (i8*, i64, i8*, i64, i32)* @api_mul, i64 (i8*, i8*, i64, i32)* @api_mulgen, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* @api_muladd }, align 8, !dbg !0, !psr.id !83
@F256 = internal constant [9 x i32] [i32 1073741823, i32 1073741823, i32 1073741823, i32 63, i32 0, i32 0, i32 4096, i32 1073725440, i32 65535], align 16, !dbg !37, !psr.id !84

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "br_ec_p256_m31", scope: !2, file: !3, line: 1461, type: !51, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !25, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../BearSSL/src/ec/ec_p256_m31.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m31")
!4 = !{}
!5 = !{!6, !12, !16, !20, !23, !24}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !8, line: 27, baseType: !9)
!8 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !10, line: 44, baseType: !11)
!10 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!11 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !13, line: 26, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 42, baseType: !15)
!15 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !8, line: 26, baseType: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !10, line: 41, baseType: !19)
!19 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !13, line: 27, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !10, line: 45, baseType: !22)
!22 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!23 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!25 = !{!0, !26, !32, !37, !43, !45}
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "P256_G", scope: !2, file: !3, line: 1338, type: !28, isLocal: true, isDefinition: true)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 520, elements: !30)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!30 = !{!31}
!31 = !DISubrange(count: 65)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "P256_N", scope: !2, file: !3, line: 1348, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 256, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 32)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "F256", scope: !2, file: !3, line: 298, type: !39, isLocal: true, isDefinition: true)
!39 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 288, elements: !41)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!41 = !{!42}
!42 = !DISubrange(count: 9)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "P256_B", scope: !2, file: !3, line: 307, type: !39, isLocal: true, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "Gwin", scope: !2, file: !3, line: 1172, type: !47, isLocal: true, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 8640, elements: !48)
!48 = !{!49, !50}
!49 = !DISubrange(count: 15)
!50 = !DISubrange(count: 18)
!51 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !52)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !53, line: 415, baseType: !54)
!53 = !DIFile(filename: "../BearSSL/inc/bearssl_ec.h", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m31")
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 270, size: 448, elements: !55)
!55 = !{!56, !57, !65, !66, !70, !75, !79}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !54, file: !53, line: 279, baseType: !12, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !54, file: !53, line: 292, baseType: !58, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DISubroutineType(types: !60)
!60 = !{!61, !19, !62}
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !64, line: 46, baseType: !22)
!64 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!65 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !54, file: !53, line: 306, baseType: !58, size: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !54, file: !53, line: 318, baseType: !67, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DISubroutineType(types: !69)
!69 = !{!63, !19, !62}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !54, file: !53, line: 350, baseType: !71, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DISubroutineType(types: !73)
!73 = !{!12, !74, !63, !61, !63, !19}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !54, file: !53, line: 366, baseType: !76, size: 64, offset: 320)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DISubroutineType(types: !78)
!78 = !{!63, !74, !61, !63, !19}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !54, file: !53, line: 412, baseType: !80, size: 64, offset: 384)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{!12, !74, !61, !63, !61, !63, !61, !63, !19}
!83 = !{!"0"}
!84 = !{!"1"}
!85 = !{!"2"}
!86 = !{!"3"}
!87 = !{!"4"}
!88 = !{!"5"}
!89 = distinct !DICompileUnit(language: DW_LANG_C99, file: !90, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!90 = !DIFile(filename: "api_mul.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m31")
!91 = distinct !DICompileUnit(language: DW_LANG_C99, file: !92, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!92 = !DIFile(filename: "../BearSSL/src/codec/ccopy.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m31")
!93 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!94 = !{i32 7, !"Dwarf Version", i32 4}
!95 = !{i32 2, !"Debug Info Version", i32 3}
!96 = !{i32 1, !"wchar_size", i32 4}
!97 = distinct !DISubprogram(name: "api_mul_wrapper", scope: !90, file: !90, line: 7, type: !98, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !89, retainedNodes: !4)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !74, !63, !61, !63, !19}
!100 = !DILocalVariable(name: "G", arg: 1, scope: !97, file: !90, line: 7, type: !74)
!101 = !DILocation(line: 0, scope: !97)
!102 = !{!"6"}
!103 = !DILocalVariable(name: "Glen", arg: 2, scope: !97, file: !90, line: 7, type: !63)
!104 = !{!"7"}
!105 = !DILocalVariable(name: "kb", arg: 3, scope: !97, file: !90, line: 8, type: !61)
!106 = !{!"8"}
!107 = !DILocalVariable(name: "kblen", arg: 4, scope: !97, file: !90, line: 8, type: !63)
!108 = !{!"9"}
!109 = !DILocalVariable(name: "curve", arg: 5, scope: !97, file: !90, line: 8, type: !19)
!110 = !{!"10"}
!111 = !DILocation(line: 9, column: 12, scope: !97)
!112 = !{!"11"}
!113 = !DILocation(line: 9, column: 2, scope: !97)
!114 = !{!"12"}
!115 = !DILocation(line: 10, column: 12, scope: !97)
!116 = !{!"13"}
!117 = !DILocation(line: 10, column: 2, scope: !97)
!118 = !{!"14"}
!119 = !DILocation(line: 11, column: 12, scope: !97)
!120 = !{!"15"}
!121 = !DILocation(line: 11, column: 2, scope: !97)
!122 = !{!"16"}
!123 = !DILocation(line: 12, column: 12, scope: !97)
!124 = !{!"17"}
!125 = !DILocation(line: 12, column: 2, scope: !97)
!126 = !{!"18"}
!127 = !DILocation(line: 13, column: 12, scope: !97)
!128 = !{!"19"}
!129 = !DILocation(line: 13, column: 2, scope: !97)
!130 = !{!"20"}
!131 = !DILocation(line: 15, column: 12, scope: !97)
!132 = !{!"21"}
!133 = !DILocation(line: 15, column: 2, scope: !97)
!134 = !{!"22"}
!135 = !DILocalVariable(name: "iec", scope: !97, file: !90, line: 16, type: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !53, line: 415, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !53, line: 270, size: 448, elements: !140)
!140 = !{!141, !142, !143, !144, !145, !146, !147}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !139, file: !53, line: 279, baseType: !12, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !139, file: !53, line: 292, baseType: !58, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !139, file: !53, line: 306, baseType: !58, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !139, file: !53, line: 318, baseType: !67, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !139, file: !53, line: 350, baseType: !71, size: 64, offset: 256)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !139, file: !53, line: 366, baseType: !76, size: 64, offset: 320)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !139, file: !53, line: 412, baseType: !80, size: 64, offset: 384)
!148 = !{!"23"}
!149 = !DILocation(line: 18, column: 7, scope: !97)
!150 = !{!"24"}
!151 = !{!"25"}
!152 = !DILocation(line: 18, column: 2, scope: !97)
!153 = !{!"26"}
!154 = !DILocation(line: 19, column: 1, scope: !97)
!155 = !{!"27"}
!156 = distinct !DISubprogram(name: "api_mul_wrapper_t", scope: !90, file: !90, line: 30, type: !157, scopeLine: 30, spFlags: DISPFlagDefinition, unit: !89, retainedNodes: !4)
!157 = !DISubroutineType(types: !158)
!158 = !{null}
!159 = !DILocation(line: 32, column: 21, scope: !156)
!160 = !{!"28"}
!161 = !DILocalVariable(name: "G", scope: !156, file: !90, line: 32, type: !74)
!162 = !DILocation(line: 0, scope: !156)
!163 = !{!"29"}
!164 = !DILocation(line: 33, column: 17, scope: !156)
!165 = !{!"30"}
!166 = !DILocalVariable(name: "Glen", scope: !156, file: !90, line: 33, type: !63)
!167 = !{!"31"}
!168 = !DILocation(line: 34, column: 28, scope: !156)
!169 = !{!"32"}
!170 = !DILocalVariable(name: "kb", scope: !156, file: !90, line: 34, type: !61)
!171 = !{!"33"}
!172 = !DILocation(line: 35, column: 18, scope: !156)
!173 = !{!"34"}
!174 = !DILocalVariable(name: "kblen", scope: !156, file: !90, line: 35, type: !63)
!175 = !{!"35"}
!176 = !DILocalVariable(name: "curve", scope: !156, file: !90, line: 36, type: !19)
!177 = !{!"36"}
!178 = !DILocalVariable(name: "iec", scope: !156, file: !90, line: 38, type: !136)
!179 = !{!"37"}
!180 = !DILocation(line: 40, column: 7, scope: !156)
!181 = !{!"38"}
!182 = !{!"39"}
!183 = !DILocation(line: 40, column: 2, scope: !156)
!184 = !{!"40"}
!185 = !DILocation(line: 41, column: 1, scope: !156)
!186 = !{!"41"}
!187 = distinct !DISubprogram(name: "br_ccopy", scope: !92, file: !92, line: 29, type: !188, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !91, retainedNodes: !4)
!188 = !DISubroutineType(types: !189)
!189 = !{null, !12, !24, !190, !63}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!192 = !DILocalVariable(name: "ctl", arg: 1, scope: !187, file: !92, line: 29, type: !12)
!193 = !DILocation(line: 0, scope: !187)
!194 = !{!"42"}
!195 = !DILocalVariable(name: "dst", arg: 2, scope: !187, file: !92, line: 29, type: !24)
!196 = !{!"43"}
!197 = !DILocalVariable(name: "src", arg: 3, scope: !187, file: !92, line: 29, type: !190)
!198 = !{!"44"}
!199 = !DILocalVariable(name: "len", arg: 4, scope: !187, file: !92, line: 29, type: !63)
!200 = !{!"45"}
!201 = !DILocalVariable(name: "d", scope: !187, file: !92, line: 31, type: !74)
!202 = !{!"46"}
!203 = !DILocalVariable(name: "s", scope: !187, file: !92, line: 32, type: !61)
!204 = !{!"47"}
!205 = !DILocation(line: 36, column: 2, scope: !187)
!206 = !{!"48"}
!207 = !{!"49"}
!208 = !{!"50"}
!209 = !{!"PointTainted"}
!210 = !{!"51"}
!211 = !{!"52"}
!212 = !{!"53"}
!213 = !{!"54"}
!214 = !DILocation(line: 36, column: 13, scope: !187)
!215 = !{!"55"}
!216 = !{!"56"}
!217 = !DILocation(line: 36, column: 16, scope: !187)
!218 = !{!"57"}
!219 = !{!"58"}
!220 = !DILocation(line: 39, column: 10, scope: !221)
!221 = distinct !DILexicalBlock(scope: !187, file: !92, line: 36, column: 21)
!222 = !{!"59"}
!223 = !{!"60"}
!224 = !DILocation(line: 39, column: 7, scope: !221)
!225 = !{!"61"}
!226 = !{!"ValueTainted"}
!227 = !{!"62"}
!228 = !DILocalVariable(name: "x", scope: !221, file: !92, line: 37, type: !12)
!229 = !DILocation(line: 0, scope: !221)
!230 = !{!"63"}
!231 = !DILocation(line: 40, column: 7, scope: !221)
!232 = !{!"64"}
!233 = !{!"65"}
!234 = !DILocalVariable(name: "y", scope: !221, file: !92, line: 37, type: !12)
!235 = !{!"66"}
!236 = !DILocation(line: 41, column: 8, scope: !221)
!237 = !{!"67"}
!238 = !{!"68"}
!239 = !DILocation(line: 41, column: 6, scope: !221)
!240 = !{!"69"}
!241 = !DILocation(line: 42, column: 5, scope: !221)
!242 = !{!"70"}
!243 = !{!"71"}
!244 = distinct !{!244, !205, !245, !246}
!245 = !DILocation(line: 43, column: 2, scope: !187)
!246 = !{!"llvm.loop.mustprogress"}
!247 = !{!"72"}
!248 = !DILocation(line: 44, column: 1, scope: !187)
!249 = !{!"73"}
!250 = distinct !DISubprogram(name: "MUX", scope: !251, file: !251, line: 770, type: !252, scopeLine: 771, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !91, retainedNodes: !4)
!251 = !DIFile(filename: "../BearSSL/src/inner.h", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m31")
!252 = !DISubroutineType(types: !253)
!253 = !{!12, !12, !12, !12}
!254 = !DILocalVariable(name: "ctl", arg: 1, scope: !250, file: !251, line: 770, type: !12)
!255 = !DILocation(line: 0, scope: !250)
!256 = !{!"74"}
!257 = !DILocalVariable(name: "x", arg: 2, scope: !250, file: !251, line: 770, type: !12)
!258 = !{!"75"}
!259 = !DILocalVariable(name: "y", arg: 3, scope: !250, file: !251, line: 770, type: !12)
!260 = !{!"76"}
!261 = !DILocation(line: 772, column: 14, scope: !250)
!262 = !{!"77"}
!263 = !DILocation(line: 772, column: 24, scope: !250)
!264 = !{!"78"}
!265 = !DILocation(line: 772, column: 19, scope: !250)
!266 = !{!"79"}
!267 = !DILocation(line: 772, column: 11, scope: !250)
!268 = !{!"80"}
!269 = !DILocation(line: 772, column: 2, scope: !250)
!270 = !{!"81"}
!271 = distinct !DISubprogram(name: "api_generator", scope: !3, file: !3, line: 1356, type: !59, scopeLine: 1357, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!272 = !DILocalVariable(name: "curve", arg: 1, scope: !271, file: !3, line: 1356, type: !19)
!273 = !DILocation(line: 0, scope: !271)
!274 = !{!"82"}
!275 = !DILocalVariable(name: "len", arg: 2, scope: !271, file: !3, line: 1356, type: !62)
!276 = !{!"83"}
!277 = !DILocation(line: 1359, column: 7, scope: !271)
!278 = !{!"84"}
!279 = !{!"85"}
!280 = !DILocation(line: 1360, column: 2, scope: !271)
!281 = !{!"86"}
!282 = distinct !DISubprogram(name: "api_order", scope: !3, file: !3, line: 1364, type: !59, scopeLine: 1365, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!283 = !DILocalVariable(name: "curve", arg: 1, scope: !282, file: !3, line: 1364, type: !19)
!284 = !DILocation(line: 0, scope: !282)
!285 = !{!"87"}
!286 = !DILocalVariable(name: "len", arg: 2, scope: !282, file: !3, line: 1364, type: !62)
!287 = !{!"88"}
!288 = !DILocation(line: 1367, column: 7, scope: !282)
!289 = !{!"89"}
!290 = !{!"90"}
!291 = !DILocation(line: 1368, column: 2, scope: !282)
!292 = !{!"91"}
!293 = distinct !DISubprogram(name: "api_xoff", scope: !3, file: !3, line: 1372, type: !68, scopeLine: 1373, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!294 = !DILocalVariable(name: "curve", arg: 1, scope: !293, file: !3, line: 1372, type: !19)
!295 = !DILocation(line: 0, scope: !293)
!296 = !{!"92"}
!297 = !DILocalVariable(name: "len", arg: 2, scope: !293, file: !3, line: 1372, type: !62)
!298 = !{!"93"}
!299 = !DILocation(line: 1375, column: 7, scope: !293)
!300 = !{!"94"}
!301 = !DILocation(line: 1376, column: 2, scope: !293)
!302 = !{!"95"}
!303 = distinct !DISubprogram(name: "api_mul", scope: !3, file: !3, line: 1380, type: !72, scopeLine: 1382, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!304 = !{!"96"}
!305 = !DILocalVariable(name: "G", arg: 1, scope: !303, file: !3, line: 1380, type: !74)
!306 = !DILocation(line: 0, scope: !303)
!307 = !{!"97"}
!308 = !DILocalVariable(name: "Glen", arg: 2, scope: !303, file: !3, line: 1380, type: !63)
!309 = !{!"98"}
!310 = !DILocalVariable(name: "x", arg: 3, scope: !303, file: !3, line: 1381, type: !61)
!311 = !{!"99"}
!312 = !DILocalVariable(name: "xlen", arg: 4, scope: !303, file: !3, line: 1381, type: !63)
!313 = !{!"100"}
!314 = !DILocalVariable(name: "curve", arg: 5, scope: !303, file: !3, line: 1381, type: !19)
!315 = !{!"101"}
!316 = !DILocalVariable(name: "P", scope: !303, file: !3, line: 1384, type: !317)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "p256_jacobian", file: !3, line: 654, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 650, size: 864, elements: !319)
!319 = !{!320, !322, !323}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !318, file: !3, line: 651, baseType: !321, size: 288)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 288, elements: !41)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !318, file: !3, line: 652, baseType: !321, size: 288, offset: 288)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !318, file: !3, line: 653, baseType: !321, size: 288, offset: 576)
!324 = !DILocation(line: 1384, column: 16, scope: !303)
!325 = !{!"102"}
!326 = !DILocation(line: 1387, column: 11, scope: !327)
!327 = distinct !DILexicalBlock(scope: !303, file: !3, line: 1387, column: 6)
!328 = !{!"103"}
!329 = !DILocation(line: 1387, column: 6, scope: !303)
!330 = !{!"104"}
!331 = !DILocation(line: 1388, column: 3, scope: !332)
!332 = distinct !DILexicalBlock(scope: !327, file: !3, line: 1387, column: 18)
!333 = !{!"105"}
!334 = !DILocation(line: 1390, column: 6, scope: !303)
!335 = !{!"106"}
!336 = !DILocalVariable(name: "r", scope: !303, file: !3, line: 1383, type: !12)
!337 = !{!"107"}
!338 = !DILocation(line: 1391, column: 2, scope: !303)
!339 = !{!"108"}
!340 = !DILocation(line: 1392, column: 2, scope: !303)
!341 = !{!"109"}
!342 = !DILocation(line: 1393, column: 2, scope: !303)
!343 = !{!"110"}
!344 = !DILocation(line: 1394, column: 2, scope: !303)
!345 = !{!"111"}
!346 = !{!"112"}
!347 = !DILocation(line: 1395, column: 1, scope: !303)
!348 = !{!"113"}
!349 = distinct !DISubprogram(name: "api_mulgen", scope: !3, file: !3, line: 1398, type: !77, scopeLine: 1400, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!350 = !{!"114"}
!351 = !DILocalVariable(name: "R", arg: 1, scope: !349, file: !3, line: 1398, type: !74)
!352 = !DILocation(line: 0, scope: !349)
!353 = !{!"115"}
!354 = !DILocalVariable(name: "x", arg: 2, scope: !349, file: !3, line: 1399, type: !61)
!355 = !{!"116"}
!356 = !DILocalVariable(name: "xlen", arg: 3, scope: !349, file: !3, line: 1399, type: !63)
!357 = !{!"117"}
!358 = !DILocalVariable(name: "curve", arg: 4, scope: !349, file: !3, line: 1399, type: !19)
!359 = !{!"118"}
!360 = !DILocalVariable(name: "P", scope: !349, file: !3, line: 1401, type: !317)
!361 = !DILocation(line: 1401, column: 16, scope: !349)
!362 = !{!"119"}
!363 = !DILocation(line: 1404, column: 2, scope: !349)
!364 = !{!"120"}
!365 = !DILocation(line: 1405, column: 2, scope: !349)
!366 = !{!"121"}
!367 = !DILocation(line: 1406, column: 2, scope: !349)
!368 = !{!"122"}
!369 = !DILocation(line: 1407, column: 2, scope: !349)
!370 = !{!"123"}
!371 = distinct !DISubprogram(name: "api_muladd", scope: !3, file: !3, line: 1411, type: !81, scopeLine: 1414, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!372 = !{!"124"}
!373 = !{!"125"}
!374 = !DILocalVariable(name: "A", arg: 1, scope: !371, file: !3, line: 1411, type: !74)
!375 = !DILocation(line: 0, scope: !371)
!376 = !{!"126"}
!377 = !DILocalVariable(name: "B", arg: 2, scope: !371, file: !3, line: 1411, type: !61)
!378 = !{!"127"}
!379 = !DILocalVariable(name: "len", arg: 3, scope: !371, file: !3, line: 1411, type: !63)
!380 = !{!"128"}
!381 = !DILocalVariable(name: "x", arg: 4, scope: !371, file: !3, line: 1412, type: !61)
!382 = !{!"129"}
!383 = !DILocalVariable(name: "xlen", arg: 5, scope: !371, file: !3, line: 1412, type: !63)
!384 = !{!"130"}
!385 = !DILocalVariable(name: "y", arg: 6, scope: !371, file: !3, line: 1413, type: !61)
!386 = !{!"131"}
!387 = !DILocalVariable(name: "ylen", arg: 7, scope: !371, file: !3, line: 1413, type: !63)
!388 = !{!"132"}
!389 = !DILocalVariable(name: "curve", arg: 8, scope: !371, file: !3, line: 1413, type: !19)
!390 = !{!"133"}
!391 = !DILocalVariable(name: "P", scope: !371, file: !3, line: 1415, type: !317)
!392 = !DILocation(line: 1415, column: 16, scope: !371)
!393 = !{!"134"}
!394 = !DILocalVariable(name: "Q", scope: !371, file: !3, line: 1415, type: !317)
!395 = !DILocation(line: 1415, column: 19, scope: !371)
!396 = !{!"135"}
!397 = !DILocation(line: 1420, column: 10, scope: !398)
!398 = distinct !DILexicalBlock(scope: !371, file: !3, line: 1420, column: 6)
!399 = !{!"136"}
!400 = !DILocation(line: 1420, column: 6, scope: !371)
!401 = !{!"137"}
!402 = !DILocation(line: 1421, column: 3, scope: !403)
