; ModuleID = 'remove_padding-k.ll'
source_filename = "remove_padding.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ssl_st = type { i8*, i64, %struct.ssl3_state_st*, %struct.evp_cipher_ctx_st*, i32 }
%struct.ssl3_state_st = type { i64, [8 x i8] }
%struct.evp_cipher_ctx_st = type { %struct.evp_cipher_st* }
%struct.evp_cipher_st = type { i64 }
%struct.ssl3_record_st = type { i32, i8*, i32, i8* }
%struct.smack_value = type { i8* }

@.str = private unnamed_addr constant [9 x i8] zeroinitializer, align 1, !psr.id !0

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @CRYPTO_memcmp(i8* %0, i8* %1, i64 %2) #0 !dbg !12 {
  call void @llvm.dbg.value(metadata i8* %0, metadata !24, metadata !DIExpression()), !dbg !25, !psr.id !26
  call void @llvm.dbg.value(metadata i8* %1, metadata !27, metadata !DIExpression()), !dbg !25, !psr.id !28
  call void @llvm.dbg.value(metadata i64 %2, metadata !29, metadata !DIExpression()), !dbg !25, !psr.id !30
  call void @llvm.dbg.value(metadata i8* %0, metadata !31, metadata !DIExpression()), !dbg !25, !psr.id !32
  call void @llvm.dbg.value(metadata i8* %1, metadata !33, metadata !DIExpression()), !dbg !25, !psr.id !34
  call void @llvm.dbg.value(metadata i8 0, metadata !35, metadata !DIExpression()), !dbg !25, !psr.id !36
  call void @llvm.dbg.value(metadata i64 0, metadata !37, metadata !DIExpression()), !dbg !25, !psr.id !38

!0 = !{!"0"}
!1 = distinct !DICompileUnit(language: DW_LANG_C99, file: !2, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !3, retainedTypes: !4, splitDebugInlining: false, nameTableKind: None)
!2 = !DIFile(filename: "remove_padding.c", directory: "/home/luwei/bech-back/OpenSSL/tls1_cbc")
!3 = !{}
!4 = !{!5, !6, !7}
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{i32 7, !"Dwarf Version", i32 4}
!9 = !{i32 2, !"Debug Info Version", i32 3}
!10 = !{i32 1, !"wchar_size", i32 4}
!11 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!12 = distinct !DISubprogram(name: "CRYPTO_memcmp", scope: !13, file: !13, line: 42, type: !14, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1, retainedNodes: !3)
!13 = !DIFile(filename: "./../tls1_cbc_remove_padding.c", directory: "/home/luwei/bech-back/OpenSSL/tls1_cbc")
!14 = !DISubroutineType(types: !15)
!15 = !{!6, !16, !18, !21}
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !22, line: 46, baseType: !23)
!22 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!23 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!24 = !DILocalVariable(name: "in_a", arg: 1, scope: !12, file: !13, line: 42, type: !16)
!25 = !DILocation(line: 0, scope: !12)
!26 = !{!"1"}
!27 = !DILocalVariable(name: "in_b", arg: 2, scope: !12, file: !13, line: 42, type: !18)
!28 = !{!"2"}
!29 = !DILocalVariable(name: "len", arg: 3, scope: !12, file: !13, line: 42, type: !21)
!30 = !{!"3"}
!31 = !DILocalVariable(name: "a", scope: !12, file: !13, line: 45, type: !16)
!32 = !{!"4"}
!33 = !DILocalVariable(name: "b", scope: !12, file: !13, line: 46, type: !18)
!34 = !{!"5"}
!35 = !DILocalVariable(name: "x", scope: !12, file: !13, line: 47, type: !5)
!36 = !{!"6"}
!37 = !DILocalVariable(name: "i", scope: !12, file: !13, line: 44, type: !21)
!38 = !{!"7"}
!39 = !DILocation(line: 49, column: 10, scope: !40)
!40 = distinct !DILexicalBlock(scope: !12, file: !13, line: 49, column: 5)
!41 = !{!"8"}
!42 = !DILocation(line: 0, scope: !40)
!43 = !{!"9"}
!44 = !{!"10"}
!45 = !{!"11"}
!46 = !{!"12"}
!47 = !DILocation(line: 49, column: 19, scope: !48)
!48 = distinct !DILexicalBlock(scope: !40, file: !13, line: 49, column: 5)
!49 = !{!"13"}
!50 = !DILocation(line: 49, column: 5, scope: !40)
!51 = !{!"14"}
!52 = !DILocation(line: 50, column: 14, scope: !48)
!53 = !{!"15"}
!54 = !{!"16"}
!55 = !{!"17"}
!56 = !DILocation(line: 50, column: 21, scope: !48)
!57 = !{!"18"}
!58 = !{!"19"}
!59 = !{!"20"}
!60 = !DILocation(line: 50, column: 19, scope: !48)
!61 = !{!"21"}
!62 = !DILocation(line: 50, column: 11, scope: !48)
!63 = !{!"22"}
!64 = !{!"23"}
!65 = !{!"24"}
!66 = !{!"25"}
!67 = !DILocation(line: 50, column: 9, scope: !48)
!68 = !{!"26"}
!69 = !DILocation(line: 49, column: 27, scope: !48)
!70 = !{!"27"}
!71 = !{!"28"}
!72 = !DILocation(line: 49, column: 5, scope: !48)
!73 = distinct !{!73, !50, !74, !75}
!74 = !DILocation(line: 50, column: 24, scope: !40)
!75 = !{!"llvm.loop.mustprogress"}
!76 = !{!"29"}
!77 = !DILocation(line: 52, column: 12, scope: !12)
!78 = !{!"30"}
!79 = !DILocation(line: 52, column: 5, scope: !12)
!80 = !{!"31"}
!81 = distinct !DISubprogram(name: "tls1_cbc_remove_padding", scope: !13, file: !13, line: 68, type: !82, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !1, retainedNodes: !3)
!82 = !DISubroutineType(types: !83)
!83 = !{!6, !84, !115, !7, !7}
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !13, line: 32, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !13, line: 26, size: 320, elements: !88)
!88 = !{!89, !91, !92, !102, !114}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "expand", scope: !87, file: !13, line: 27, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !87, file: !13, line: 28, baseType: !23, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "s3", scope: !87, file: !13, line: 29, baseType: !93, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_state_st", file: !13, line: 13, size: 128, elements: !95)
!95 = !{!96, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !94, file: !13, line: 14, baseType: !97, size: 64)
!97 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "read_sequence", scope: !94, file: !13, line: 15, baseType: !99, size: 64, offset: 64)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 8)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "enc_read_ctx", scope: !87, file: !13, line: 30, baseType: !103, size: 64, offset: 192)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER_CTX", file: !13, line: 24, baseType: !105)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_ctx_st", file: !13, line: 22, size: 64, elements: !106)
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !105, file: !13, line: 23, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !13, line: 20, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !13, line: 18, size: 64, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !111, file: !13, line: 19, baseType: !23, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "slicing_cheat", scope: !87, file: !13, line: 31, baseType: !6, size: 32, offset: 256)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL3_RECORD", file: !13, line: 11, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_record_st", file: !13, line: 6, size: 256, elements: !118)
!118 = !{!119, !120, !122, !123}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !117, file: !13, line: 7, baseType: !7, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !13, line: 8, baseType: !121, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !117, file: !13, line: 9, baseType: !6, size: 32, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !117, file: !13, line: 10, baseType: !121, size: 64, offset: 192)
!124 = !DILocalVariable(name: "s", arg: 1, scope: !81, file: !13, line: 68, type: !84)
!125 = !DILocation(line: 0, scope: !81)
!126 = !{!"32"}
!127 = !DILocalVariable(name: "rec", arg: 2, scope: !81, file: !13, line: 69, type: !115)
!128 = !{!"33"}
!129 = !DILocalVariable(name: "block_size", arg: 3, scope: !81, file: !13, line: 70, type: !7)
!130 = !{!"34"}
!131 = !DILocalVariable(name: "mac_size", arg: 4, scope: !81, file: !13, line: 70, type: !7)
!132 = !{!"35"}
!133 = !DILocation(line: 73, column: 60, scope: !81)
!134 = !{!"36"}
!135 = !DILocalVariable(name: "overhead", scope: !81, file: !13, line: 73, type: !136)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!137 = !{!"37"}
!138 = !DILocation(line: 75, column: 9, scope: !139)
!139 = distinct !DILexicalBlock(scope: !81, file: !13, line: 75, column: 9)
!140 = !{!"38"}
!141 = !{!"39"}
!142 = !{!"40"}
!143 = !{!"41"}
!144 = !DILocation(line: 75, column: 9, scope: !81)
!145 = !{!"42"}
!146 = !DILocation(line: 80, column: 22, scope: !147)
!147 = distinct !DILexicalBlock(scope: !148, file: !13, line: 80, column: 13)
!148 = distinct !DILexicalBlock(scope: !139, file: !13, line: 75, column: 33)
!149 = !{!"43"}
!150 = !DILocation(line: 80, column: 42, scope: !147)
!151 = !{!"44"}
!152 = !{!"45"}
!153 = !DILocation(line: 80, column: 35, scope: !147)
!154 = !{!"46"}
!155 = !DILocation(line: 80, column: 13, scope: !148)
!156 = !{!"47"}
!157 = !DILocation(line: 81, column: 13, scope: !147)
!158 = !{!"48"}
!159 = !DILocation(line: 83, column: 14, scope: !148)
!160 = !{!"49"}
!161 = !DILocation(line: 83, column: 19, scope: !148)
!162 = !{!"50"}
!163 = !{!"PointTainted"}
!164 = !{!"51"}
!165 = !{!"52"}
!166 = !{!"53"}
!167 = !DILocation(line: 84, column: 14, scope: !148)
!168 = !{!"54"}
!169 = !DILocation(line: 84, column: 20, scope: !148)
!170 = !{!"55"}
!171 = !{!"56"}
!172 = !{!"57"}
!173 = !{!"58"}
!174 = !DILocation(line: 85, column: 14, scope: !148)
!175 = !{!"59"}
!176 = !DILocation(line: 85, column: 21, scope: !148)
!177 = !{!"60"}
!178 = !{!"61"}
!179 = !{!"62"}
!180 = !DILocation(line: 86, column: 5, scope: !148)
!181 = !{!"63"}
!182 = !DILocation(line: 86, column: 32, scope: !183)
!183 = distinct !DILexicalBlock(scope: !139, file: !13, line: 86, column: 16)
!184 = !{!"64"}
!185 = !{!"65"}
!186 = !DILocation(line: 86, column: 25, scope: !183)
!187 = !{!"66"}
!188 = !DILocation(line: 86, column: 16, scope: !139)
!189 = !{!"67"}
!190 = !DILocation(line: 87, column: 9, scope: !183)
!191 = !{!"68"}
!192 = !{!"69"}
!193 = !DILocation(line: 88, column: 27, scope: !81)
!194 = !{!"70"}
!195 = !{!"71"}
!196 = !DILocation(line: 88, column: 37, scope: !81)
!197 = !{!"72"}
!198 = !{!"73"}
!199 = !DILocation(line: 88, column: 44, scope: !81)
!200 = !{!"74"}
!201 = !DILocation(line: 88, column: 22, scope: !81)
!202 = !{!"75"}
!203 = !{!"76"}
!204 = !{!"77"}
!205 = !{!"ValueTainted"}
!206 = !{!"78"}
!207 = !DILocalVariable(name: "padding_length", scope: !81, file: !13, line: 72, type: !7)
!208 = !{!"79"}
!209 = !DILocation(line: 97, column: 13, scope: !210)
!210 = distinct !DILexicalBlock(scope: !81, file: !13, line: 97, column: 9)
!211 = !{!"80"}
!212 = !{!"81"}
!213 = !DILocation(line: 97, column: 21, scope: !210)
!214 = !{!"82"}
!215 = !{!"83"}
!216 = !DILocation(line: 97, column: 53, scope: !210)
!217 = !{!"84"}
!218 = !DILocation(line: 97, column: 60, scope: !210)
!219 = !{!"85"}
!220 = !{!"86"}
!221 = !DILocation(line: 97, column: 57, scope: !210)
!222 = !{!"87"}
!223 = !DILocation(line: 97, column: 9, scope: !81)
!224 = !{!"88"}
!225 = !DILocation(line: 98, column: 12, scope: !226)
!226 = distinct !DILexicalBlock(scope: !227, file: !13, line: 98, column: 12)
!227 = distinct !DILexicalBlock(scope: !210, file: !13, line: 97, column: 68)
!228 = !{!"89"}
!229 = !DILocation(line: 98, column: 12, scope: !227)
!230 = !{!"90"}
!231 = !{!"Tainted"}
