; ModuleID = 'crypt_cbc-k.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.mbedtls_des_context = type { [32 x i32] }
%struct.smack_value = type { i8* }
%struct.mbedtls_des3_context = type { [96 x i32] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@__const.crypt_cbc_wrapper_t.iv = private unnamed_addr constant <{ i8, [15 x i8] }> <{ i8 97, [15 x i8] zeroinitializer }>, align 16, !psr.id !0
@odd_parity_table = internal constant [128 x i8] c"\01\02\04\07\08\0B\0D\0E\10\13\15\16\19\1A\1C\1F #%&)*,/12478;=>@CEFIJLOQRTWX[]^abdghkmnpsuvyz|\7F\80\83\85\86\89\8A\8C\8F\91\92\94\97\98\9B\9D\9E\A1\A2\A4\A7\A8\AB\AD\AE\B0\B3\B5\B6\B9\BA\BC\BF\C1\C2\C4\C7\C8\CB\CD\CE\D0\D3\D5\D6\D9\DA\DC\DF\E0\E3\E5\E6\E9\EA\EC\EF\F1\F2\F4\F7\F8\FB\FD\FE", align 16, !dbg !1, !psr.id !73

!3240 = !DILocation(line: 1013, column: 13, scope: !3168)
!3241 = !{!"1989"}
!3242 = !DILocation(line: 1015, column: 13, scope: !3169)
!3243 = !{!"1990"}
!3244 = !{!"1991"}
!3245 = !{!"1992"}
!3246 = !{!"1993"}
!3247 = !DILocation(line: 976, column: 17, scope: !3055)
!3248 = !{!"1994"}
!3249 = !{!"1995"}
!3250 = !DILocation(line: 1018, column: 17, scope: !3251)
!3251 = distinct !DILexicalBlock(scope: !3015, file: !4, line: 1018, column: 13)
!3252 = !{!"1996"}
!3253 = !DILocation(line: 1018, column: 40, scope: !3251)
!3254 = !{!"1997"}
!3255 = !DILocation(line: 1019, column: 25, scope: !3251)
!3256 = !{!"1998"}
!3257 = !DILocation(line: 1019, column: 30, scope: !3251)
!3258 = !{!"1999"}
!3259 = !{!"2000"}
!3260 = !{!"2001"}
!3261 = !DILocation(line: 1019, column: 17, scope: !3251)
!3262 = !{!"2002"}
!3263 = !DILocation(line: 1019, column: 56, scope: !3251)
!3264 = !{!"2003"}
!3265 = !DILocation(line: 1019, column: 63, scope: !3251)
!3266 = !{!"2004"}
!3267 = !DILocation(line: 1020, column: 17, scope: !3251)
!3268 = !{!"2005"}
!3269 = !DILocation(line: 1020, column: 40, scope: !3251)
!3270 = !{!"2006"}
!3271 = !DILocation(line: 1021, column: 25, scope: !3251)
!3272 = !{!"2007"}
!3273 = !DILocation(line: 1021, column: 30, scope: !3251)
!3274 = !{!"2008"}
!3275 = !{!"2009"}
!3276 = !{!"2010"}
!3277 = !DILocation(line: 1021, column: 17, scope: !3251)
!3278 = !{!"2011"}
!3279 = !DILocation(line: 1021, column: 56, scope: !3251)
!3280 = !{!"2012"}
!3281 = !DILocation(line: 1018, column: 13, scope: !3015)
!3282 = !{!"2013"}
!3283 = !DILocation(line: 1023, column: 25, scope: !3284)
!3284 = distinct !DILexicalBlock(scope: !3285, file: !4, line: 1023, column: 17)
!3285 = distinct !DILexicalBlock(scope: !3251, file: !4, line: 1022, column: 9)
!3286 = !{!"2014"}
!3287 = !DILocation(line: 1023, column: 17, scope: !3285)
!3288 = !{!"2015"}
!3289 = !DILocation(line: 1024, column: 17, scope: !3284)
!3290 = !{!"2016"}
!3291 = !{!"2017"}
!3292 = !{!"2018"}
!3293 = !DILocation(line: 1027, column: 13, scope: !3285)
!3294 = !{!"2019"}
!3295 = !DILocation(line: 1030, column: 21, scope: !3296)
!3296 = distinct !DILexicalBlock(scope: !3015, file: !4, line: 1030, column: 13)
!3297 = !{!"2020"}
!3298 = !DILocation(line: 1030, column: 13, scope: !3015)
!3299 = !{!"2021"}
!3300 = !DILocation(line: 1031, column: 13, scope: !3296)
!3301 = !{!"2022"}
!3302 = !{!"2023"}
!3303 = !DILocation(line: 1032, column: 5, scope: !3015)
!3304 = !{!"2024"}
!3305 = !DILocation(line: 939, column: 25, scope: !3010)
!3306 = !{!"2025"}
!3307 = !{!"2026"}
!3308 = !DILocation(line: 939, column: 5, scope: !3010)
!3309 = distinct !{!3309, !3012, !3310, !346}
!3310 = !DILocation(line: 1032, column: 5, scope: !3002)
!3311 = !{!"2027"}
!3312 = !DILocation(line: 1035, column: 17, scope: !3313)
!3313 = distinct !DILexicalBlock(scope: !2745, file: !4, line: 1035, column: 9)
!3314 = !{!"2028"}
!3315 = !DILocation(line: 1035, column: 9, scope: !2745)
!3316 = !{!"2029"}
!3317 = !DILocation(line: 1036, column: 9, scope: !3313)
!3318 = !{!"2030"}
!3319 = !{!"2031"}
!3320 = !DILocation(line: 1035, column: 20, scope: !3313)
!3321 = !{!"2032"}
!3322 = !{!"2033"}
!3323 = !{!"2034"}
!3324 = !DILabel(scope: !2745, name: "exit", file: !4, line: 1038)
!3325 = !DILocation(line: 1038, column: 1, scope: !2745)
!3326 = !{!"2035"}
!3327 = !DILocation(line: 1039, column: 5, scope: !2745)
!3328 = !{!"2036"}
!3329 = !DILocation(line: 1040, column: 5, scope: !2745)
!3330 = !{!"2037"}
!3331 = !DILocation(line: 1042, column: 13, scope: !3332)
!3332 = distinct !DILexicalBlock(scope: !2745, file: !4, line: 1042, column: 9)
!3333 = !{!"2038"}
!3334 = !DILocation(line: 1042, column: 9, scope: !2745)
!3335 = !{!"2039"}
!3336 = !{!"2040"}
!3337 = !DILocation(line: 1043, column: 9, scope: !3332)
!3338 = !{!"2041"}
!3339 = !{!"2042"}
!3340 = !{!"2043"}
!3341 = !DILocation(line: 1044, column: 5, scope: !2745)
!3342 = !{!"2044"}
!3343 = !{!"2045"}
!3344 = !DILocation(line: 1045, column: 1, scope: !2745)
!3345 = !{!"2046"}
!3346 = distinct !DISubprogram(name: "mbedtls_platform_zeroize", scope: !102, file: !102, line: 67, type: !3347, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !101, retainedNodes: !5)
!3347 = !DISubroutineType(types: !3348)
!3348 = !{null, !7, !110}
!3349 = !DILocalVariable(name: "buf", arg: 1, scope: !3346, file: !102, line: 67, type: !7)
!3350 = !DILocation(line: 0, scope: !3346)
!3351 = !{!"2047"}
!3352 = !DILocalVariable(name: "len", arg: 2, scope: !3346, file: !102, line: 67, type: !110)
!3353 = !{!"2048"}
!3354 = !DILocation(line: 69, column: 5, scope: !3346)
!3355 = !{!"2049"}
!3356 = !DILocation(line: 69, column: 5, scope: !3357)
!3357 = distinct !DILexicalBlock(scope: !3346, file: !102, line: 69, column: 5)
!3358 = !{!"2050"}
!3359 = !DILocation(line: 71, column: 13, scope: !3360)
!3360 = distinct !DILexicalBlock(scope: !3346, file: !102, line: 71, column: 9)
!3361 = !{!"2051"}
!3362 = !DILocation(line: 71, column: 9, scope: !3346)
!3363 = !{!"2052"}
!3364 = !DILocation(line: 72, column: 9, scope: !3360)
!3365 = !{!"2053"}
!3366 = !{!"2054"}
!3367 = !{!"2055"}
!3368 = !DILocation(line: 73, column: 1, scope: !3346)
!3369 = !{!"2056"}
!3370 = distinct !DISubprogram(name: "mbedtls_platform_gmtime_r", scope: !102, file: !102, line: 105, type: !3371, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !101, retainedNodes: !5)
!3371 = !DISubroutineType(types: !3372)
!3372 = !{!3373, !3392, !3373}
!3373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3374, size: 64)
!3374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !3375, line: 7, size: 448, elements: !3376)
!3375 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!3376 = !{!3377, !3378, !3379, !3380, !3381, !3382, !3383, !3384, !3385, !3386, !3388}
!3377 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !3374, file: !3375, line: 9, baseType: !109, size: 32)
!3378 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !3374, file: !3375, line: 10, baseType: !109, size: 32, offset: 32)
!3379 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !3374, file: !3375, line: 11, baseType: !109, size: 32, offset: 64)
!3380 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !3374, file: !3375, line: 12, baseType: !109, size: 32, offset: 96)
!3381 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !3374, file: !3375, line: 13, baseType: !109, size: 32, offset: 128)
!3382 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !3374, file: !3375, line: 14, baseType: !109, size: 32, offset: 160)
!3383 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !3374, file: !3375, line: 15, baseType: !109, size: 32, offset: 192)
!3384 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !3374, file: !3375, line: 16, baseType: !109, size: 32, offset: 224)
!3385 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !3374, file: !3375, line: 17, baseType: !109, size: 32, offset: 256)
!3386 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !3374, file: !3375, line: 23, baseType: !3387, size: 64, offset: 320)
!3387 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!3388 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !3374, file: !3375, line: 24, baseType: !3389, size: 64, offset: 384)
!3389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3390, size: 64)
!3390 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3391)
!3391 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!3392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3393, size: 64)
!3393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3394)
!3394 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbedtls_time_t", file: !3395, line: 39, baseType: !3396)
!3395 = !DIFile(filename: "../mbedtls/include/mbedtls/platform_time.h", directory: "/home/luwei/bech/Mbed/des")
!3396 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !3397, line: 7, baseType: !3398)
!3397 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!3398 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !11, line: 160, baseType: !3387)
!3399 = !DILocalVariable(name: "tt", arg: 1, scope: !3370, file: !102, line: 105, type: !3392)
!3400 = !DILocation(line: 0, scope: !3370)
!3401 = !{!"2057"}
!3402 = !DILocalVariable(name: "tm_buf", arg: 2, scope: !3370, file: !102, line: 106, type: !3373)
!3403 = !{!"2058"}
!3404 = !DILocation(line: 116, column: 13, scope: !3370)
!3405 = !{!"2059"}
!3406 = !DILocation(line: 116, column: 5, scope: !3370)
!3407 = !{!"2060"}
!3408 = distinct !DISubprogram(name: "mbedtls_xor", scope: !3409, file: !3409, line: 123, type: !3410, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !101, retainedNodes: !5)
!3409 = !DIFile(filename: "../mbedtls/library/common.h", directory: "/home/luwei/bech/Mbed/des")
!3410 = !DISubroutineType(types: !3411)
!3411 = !{null, !132, !133, !133, !110}
!3412 = !DILocalVariable(name: "r", arg: 1, scope: !3408, file: !3409, line: 123, type: !132)
!3413 = !DILocation(line: 0, scope: !3408)
!3414 = !{!"2061"}
!3415 = !DILocalVariable(name: "a", arg: 2, scope: !3408, file: !3409, line: 123, type: !133)
!3416 = !{!"2062"}
!3417 = !DILocalVariable(name: "b", arg: 3, scope: !3408, file: !3409, line: 123, type: !133)
!3418 = !{!"2063"}
!3419 = !DILocalVariable(name: "n", arg: 4, scope: !3408, file: !3409, line: 123, type: !110)
!3420 = !{!"2064"}
!3421 = !DILocalVariable(name: "i", scope: !3408, file: !3409, line: 125, type: !110)
!3422 = !{!"2065"}
!3423 = !DILocation(line: 126, column: 11, scope: !3424)
!3424 = distinct !DILexicalBlock(scope: !3408, file: !3409, line: 126, column: 5)
!3425 = !{!"2066"}
!3426 = !DILocation(line: 0, scope: !3424)
!3427 = !{!"2067"}
!3428 = !{!"2068"}
!3429 = !DILocation(line: 126, column: 22, scope: !3430)
!3430 = distinct !DILexicalBlock(scope: !3424, file: !3409, line: 126, column: 5)
!3431 = !{!"2069"}
!3432 = !DILocation(line: 126, column: 28, scope: !3430)
!3433 = !{!"2070"}
!3434 = !DILocation(line: 126, column: 5, scope: !3424)
!3435 = !{!"2071"}
!3436 = !DILocation(line: 128, column: 54, scope: !3437)
!3437 = distinct !DILexicalBlock(scope: !3430, file: !3409, line: 127, column: 5)
!3438 = !{!"2072"}
!3439 = !DILocation(line: 128, column: 22, scope: !3437)
!3440 = !{!"2073"}
!3441 = !DILocation(line: 128, column: 94, scope: !3437)
!3442 = !{!"2074"}
!3443 = !DILocation(line: 128, column: 62, scope: !3437)
!3444 = !{!"2075"}
!3445 = !DILocation(line: 128, column: 60, scope: !3437)
!3446 = !{!"2076"}
!3447 = !DILocalVariable(name: "x", scope: !3437, file: !3409, line: 128, type: !8)
!3448 = !DILocation(line: 0, scope: !3437)
!3449 = !{!"2077"}
!3450 = !DILocation(line: 129, column: 41, scope: !3437)
!3451 = !{!"2078"}
!3452 = !DILocation(line: 129, column: 9, scope: !3437)
!3453 = !{!"2079"}
!3454 = !DILocation(line: 130, column: 5, scope: !3437)
!3455 = !{!"2080"}
!3456 = !DILocation(line: 126, column: 36, scope: !3430)
!3457 = !{!"2081"}
!3458 = !{!"2082"}
!3459 = !DILocation(line: 126, column: 5, scope: !3430)
!3460 = distinct !{!3460, !3434, !3461, !346}
