; ModuleID = 'hmac.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.br_hmac_context = type { %union.br_hash_compat_context, [64 x i8], i64 }
%union.br_hash_compat_context = type { %struct.br_sha384_context }
%struct.br_sha384_context = type { %struct.br_hash_class_*, [128 x i8], i64, [8 x i64] }
%struct.br_hash_class_ = type { i64, i32, void (%struct.br_hash_class_**)*, void (%struct.br_hash_class_**, i8*, i64)*, void (%struct.br_hash_class_**, i8*)*, i64 (%struct.br_hash_class_**, i8*)*, void (%struct.br_hash_class_**, i8*, i64)* }
%struct.smack_value = type { i8* }

; Function Attrs: noinline nounwind uwtable
define dso_local void @hmac_wrapper(%struct.br_hmac_context* %0, i8* %1, i64 %2, i64 %3, i64 %4, i8* %5) #0 !dbg !23 {
  call void @llvm.dbg.value(metadata %struct.br_hmac_context* %0, metadata !134, metadata !DIExpression()), !dbg !135
  call void @llvm.dbg.value(metadata i8* %1, metadata !136, metadata !DIExpression()), !dbg !135
  call void @llvm.dbg.value(metadata i64 %2, metadata !137, metadata !DIExpression()), !dbg !135
  call void @llvm.dbg.value(metadata i64 %3, metadata !138, metadata !DIExpression()), !dbg !135
  call void @llvm.dbg.value(metadata i64 %4, metadata !139, metadata !DIExpression()), !dbg !135
  call void @llvm.dbg.value(metadata i8* %5, metadata !140, metadata !DIExpression()), !dbg !135

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "hmac.c", directory: "/home/luwei/bech-back/BearSSL/hmac")
!2 = !{}
!3 = distinct !DICompileUnit(language: DW_LANG_C99, file: !4, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !5, splitDebugInlining: false, nameTableKind: None)
!4 = !DIFile(filename: "../BearSSL/src/mac/hmac_ct.c", directory: "/home/luwei/bech-back/BearSSL/hmac")
!5 = !{!6, !11, !14, !16, !10}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !7, line: 26, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !9, line: 42, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !7, line: 27, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !9, line: 45, baseType: !13)
!13 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !15, line: 46, baseType: !13)
!15 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!19 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!20 = !{i32 7, !"Dwarf Version", i32 4}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = !{i32 1, !"wchar_size", i32 4}
!23 = distinct !DISubprogram(name: "hmac_wrapper", scope: !1, file: !1, line: 3, type: !24, scopeLine: 5, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !26, !54, !14, !14, !14, !62}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_hmac_context", file: !29, line: 116, baseType: !30)
!29 = !DIFile(filename: "../BearSSL/inc/bearssl_hmac.h", directory: "/home/luwei/bech-back/BearSSL/hmac")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 110, size: 2240, elements: !31)
!31 = !{!32, !132, !133}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "dig", scope: !30, file: !29, line: 112, baseType: !33, size: 1664)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_hash_compat_context", file: !34, line: 1086, baseType: !35)
!34 = !DIFile(filename: "../BearSSL/inc/bearssl_hash.h", directory: "/home/luwei/bech-back/BearSSL/hmac")
!35 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !34, line: 1077, size: 1664, elements: !36)
!36 = !{!37, !71, !85, !96, !107, !109, !121, !123}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !35, file: !34, line: 1078, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_hash_class", file: !34, line: 221, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "br_hash_class_", file: !34, line: 222, size: 448, elements: !42)
!42 = !{!43, !44, !45, !50, !56, !63, !67}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "context_size", scope: !41, file: !34, line: 227, baseType: !14, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !41, file: !34, line: 257, baseType: !6, size: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !41, file: !34, line: 269, baseType: !46, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !41, file: !34, line: 285, baseType: !51, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !49, !54, !14}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !41, file: !34, line: 300, baseType: !57, size: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !62}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !41, file: !34, line: 316, baseType: !64, size: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!11, !60, !62}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "set_state", scope: !41, file: !34, line: 327, baseType: !68, size: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !49, !54, !11}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "md5", scope: !35, file: !34, line: 1079, baseType: !72, size: 768)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_md5_context", file: !34, line: 399, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 389, size: 768, elements: !74)
!74 = !{!75, !76, !80, !81}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !73, file: !34, line: 393, baseType: !38, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !73, file: !34, line: 395, baseType: !77, size: 512, offset: 64)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 512, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !73, file: !34, line: 396, baseType: !11, size: 64, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !73, file: !34, line: 397, baseType: !82, size: 128, offset: 640)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 4)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sha1", scope: !35, file: !34, line: 1080, baseType: !86, size: 832)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha1_context", file: !34, line: 494, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 484, size: 832, elements: !88)
!88 = !{!89, !90, !91, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !87, file: !34, line: 488, baseType: !38, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !87, file: !34, line: 490, baseType: !77, size: 512, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !87, file: !34, line: 491, baseType: !11, size: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !87, file: !34, line: 492, baseType: !93, size: 160, offset: 640)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 160, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 5)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "sha224", scope: !35, file: !34, line: 1081, baseType: !97, size: 896)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha224_context", file: !34, line: 589, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 579, size: 896, elements: !99)
!99 = !{!100, !101, !102, !103}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !98, file: !34, line: 583, baseType: !38, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !98, file: !34, line: 585, baseType: !77, size: 512, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !98, file: !34, line: 586, baseType: !11, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !98, file: !34, line: 587, baseType: !104, size: 256, offset: 640)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 8)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !35, file: !34, line: 1082, baseType: !108, size: 896)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha256_context", file: !34, line: 683, baseType: !97)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sha384", scope: !35, file: !34, line: 1083, baseType: !110, size: 1664)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha384_context", file: !34, line: 792, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 782, size: 1664, elements: !112)
!112 = !{!113, !114, !118, !119}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !111, file: !34, line: 786, baseType: !38, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !111, file: !34, line: 788, baseType: !115, size: 1024, offset: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 1024, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !111, file: !34, line: 789, baseType: !11, size: 64, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !111, file: !34, line: 790, baseType: !120, size: 512, offset: 1152)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 512, elements: !105)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "sha512", scope: !35, file: !34, line: 1084, baseType: !122, size: 1664)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha512_context", file: !34, line: 886, baseType: !110)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "md5sha1", scope: !35, file: !34, line: 1085, baseType: !124, size: 960)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_md5sha1_context", file: !34, line: 1006, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 995, size: 960, elements: !126)
!126 = !{!127, !128, !129, !130, !131}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !125, file: !34, line: 999, baseType: !38, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !125, file: !34, line: 1001, baseType: !77, size: 512, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !125, file: !34, line: 1002, baseType: !11, size: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val_md5", scope: !125, file: !34, line: 1003, baseType: !82, size: 128, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "val_sha1", scope: !125, file: !34, line: 1004, baseType: !93, size: 160, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "kso", scope: !30, file: !29, line: 113, baseType: !77, size: 512, offset: 1664)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !30, file: !29, line: 114, baseType: !14, size: 64, offset: 2176)
!134 = !DILocalVariable(name: "ctx", arg: 1, scope: !23, file: !1, line: 3, type: !26)
!135 = !DILocation(line: 0, scope: !23)
!136 = !DILocalVariable(name: "data", arg: 2, scope: !23, file: !1, line: 4, type: !54)
!137 = !DILocalVariable(name: "len", arg: 3, scope: !23, file: !1, line: 4, type: !14)
!138 = !DILocalVariable(name: "min_len", arg: 4, scope: !23, file: !1, line: 4, type: !14)
!139 = !DILocalVariable(name: "max_len", arg: 5, scope: !23, file: !1, line: 4, type: !14)
!140 = !DILocalVariable(name: "out", arg: 6, scope: !23, file: !1, line: 5, type: !62)
!141 = !DILocation(line: 6, column: 12, scope: !23)
!142 = !DILocation(line: 6, column: 2, scope: !23)
!143 = !DILocation(line: 7, column: 12, scope: !23)
!144 = !DILocation(line: 7, column: 2, scope: !23)
!145 = !DILocation(line: 8, column: 12, scope: !23)
!146 = !DILocation(line: 8, column: 2, scope: !23)
!147 = !DILocation(line: 9, column: 12, scope: !23)
!148 = !DILocation(line: 9, column: 2, scope: !23)
!149 = !DILocation(line: 10, column: 12, scope: !23)
!150 = !DILocation(line: 10, column: 2, scope: !23)
!151 = !DILocation(line: 11, column: 12, scope: !23)
!152 = !DILocation(line: 11, column: 2, scope: !23)
!153 = !DILocation(line: 13, column: 31, scope: !23)
!154 = !DILocation(line: 13, column: 12, scope: !23)
!155 = !DILocation(line: 13, column: 2, scope: !23)
!156 = !DILocation(line: 14, column: 31, scope: !23)
!157 = !DILocation(line: 14, column: 12, scope: !23)
!158 = !DILocation(line: 14, column: 2, scope: !23)
!159 = !DILocation(line: 15, column: 31, scope: !23)
!160 = !DILocation(line: 15, column: 26, scope: !23)
!161 = !DILocation(line: 15, column: 12, scope: !23)
!162 = !DILocation(line: 15, column: 2, scope: !23)
!163 = !DILocation(line: 26, column: 12, scope: !23)
!164 = !DILocation(line: 26, column: 2, scope: !23)
!165 = !DILocation(line: 28, column: 2, scope: !23)
!166 = !DILocation(line: 30, column: 1, scope: !23)
!167 = distinct !DISubprogram(name: "vfct_tmp", scope: !1, file: !1, line: 33, type: !168, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170, !26, !54, !14, !14, !14, !62}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!171 = !DILocalVariable(name: "k", arg: 1, scope: !167, file: !1, line: 33, type: !170)
!172 = !DILocation(line: 0, scope: !167)
!173 = !DILocalVariable(name: "ctx", arg: 2, scope: !167, file: !1, line: 33, type: !26)
!174 = !DILocalVariable(name: "data", arg: 3, scope: !167, file: !1, line: 34, type: !54)
!175 = !DILocalVariable(name: "len", arg: 4, scope: !167, file: !1, line: 34, type: !14)
!176 = !DILocalVariable(name: "min_len", arg: 5, scope: !167, file: !1, line: 34, type: !14)
!177 = !DILocalVariable(name: "max_len", arg: 6, scope: !167, file: !1, line: 34, type: !14)
!178 = !DILocalVariable(name: "out", arg: 7, scope: !167, file: !1, line: 35, type: !62)
!179 = !DILocation(line: 36, column: 2, scope: !167)
!180 = !DILocation(line: 38, column: 1, scope: !167)
!181 = distinct !DISubprogram(name: "hmac_wrapper_t", scope: !1, file: !1, line: 45, type: !182, scopeLine: 45, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!182 = !DISubroutineType(types: !183)
!183 = !{null}
!184 = !DILocalVariable(name: "cctx", scope: !181, file: !1, line: 46, type: !28)
!185 = !DILocation(line: 46, column: 18, scope: !181)
!186 = !DILocation(line: 46, column: 25, scope: !181)
!187 = !DILocalVariable(name: "ctx", scope: !181, file: !1, line: 47, type: !26)
!188 = !DILocation(line: 0, scope: !181)
!189 = !DILocation(line: 48, column: 21, scope: !181)
!190 = !DILocalVariable(name: "data", scope: !181, file: !1, line: 48, type: !54)
!191 = !DILocation(line: 49, column: 15, scope: !181)
!192 = !DILocalVariable(name: "len", scope: !181, file: !1, line: 49, type: !14)
!193 = !DILocation(line: 50, column: 19, scope: !181)
!194 = !DILocalVariable(name: "min_len", scope: !181, file: !1, line: 50, type: !14)
!195 = !DILocation(line: 51, column: 19, scope: !181)
!196 = !DILocalVariable(name: "max_len", scope: !181, file: !1, line: 51, type: !14)
!197 = !DILocation(line: 52, column: 14, scope: !181)
!198 = !DILocalVariable(name: "out", scope: !181, file: !1, line: 52, type: !62)
!199 = !DILocation(line: 53, column: 26, scope: !181)
!200 = !DILocation(line: 53, column: 21, scope: !181)
!201 = !DILocalVariable(name: "k", scope: !181, file: !1, line: 53, type: !170)
!202 = !DILocation(line: 54, column: 2, scope: !181)
!203 = !DILocation(line: 56, column: 1, scope: !181)
!204 = distinct !DISubprogram(name: "br_hmac_outCT", scope: !4, file: !4, line: 46, type: !205, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !2)
!205 = !DISubroutineType(types: !206)
!206 = !{!14, !207, !54, !14, !14, !14, !62}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_hmac_context", file: !29, line: 116, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 110, size: 2240, elements: !211)
!211 = !{!212, !292, !293}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "dig", scope: !210, file: !29, line: 112, baseType: !213, size: 1664)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_hash_compat_context", file: !34, line: 1086, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !34, line: 1077, size: 1664, elements: !215)
!215 = !{!216, !247, !255, !263, !271, !273, !281, !283}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !214, file: !34, line: 1078, baseType: !217, size: 64)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_hash_class", file: !34, line: 221, baseType: !220)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "br_hash_class_", file: !34, line: 222, size: 448, elements: !221)
!221 = !{!222, !223, !224, !229, !233, !239, !243}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "context_size", scope: !220, file: !34, line: 227, baseType: !14, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !220, file: !34, line: 257, baseType: !6, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !220, file: !34, line: 269, baseType: !225, size: 64, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DISubroutineType(types: !227)
!227 = !{null, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !220, file: !34, line: 285, baseType: !230, size: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !228, !54, !14}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !220, file: !34, line: 300, baseType: !234, size: 64, offset: 256)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DISubroutineType(types: !236)
!236 = !{null, !237, !62}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !217)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !220, file: !34, line: 316, baseType: !240, size: 64, offset: 320)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!11, !237, !62}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "set_state", scope: !220, file: !34, line: 327, baseType: !244, size: 64, offset: 384)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !228, !54, !11}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "md5", scope: !214, file: !34, line: 1079, baseType: !248, size: 768)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_md5_context", file: !34, line: 399, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 389, size: 768, elements: !250)
!250 = !{!251, !252, !253, !254}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !249, file: !34, line: 393, baseType: !217, size: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !249, file: !34, line: 395, baseType: !77, size: 512, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !249, file: !34, line: 396, baseType: !11, size: 64, offset: 576)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !249, file: !34, line: 397, baseType: !82, size: 128, offset: 640)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "sha1", scope: !214, file: !34, line: 1080, baseType: !256, size: 832)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha1_context", file: !34, line: 494, baseType: !257)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 484, size: 832, elements: !258)
!258 = !{!259, !260, !261, !262}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !257, file: !34, line: 488, baseType: !217, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !257, file: !34, line: 490, baseType: !77, size: 512, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !257, file: !34, line: 491, baseType: !11, size: 64, offset: 576)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !257, file: !34, line: 492, baseType: !93, size: 160, offset: 640)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sha224", scope: !214, file: !34, line: 1081, baseType: !264, size: 896)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha224_context", file: !34, line: 589, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 579, size: 896, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !265, file: !34, line: 583, baseType: !217, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !265, file: !34, line: 585, baseType: !77, size: 512, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !265, file: !34, line: 586, baseType: !11, size: 64, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !265, file: !34, line: 587, baseType: !104, size: 256, offset: 640)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !214, file: !34, line: 1082, baseType: !272, size: 896)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha256_context", file: !34, line: 683, baseType: !264)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "sha384", scope: !214, file: !34, line: 1083, baseType: !274, size: 1664)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha384_context", file: !34, line: 792, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 782, size: 1664, elements: !276)
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !275, file: !34, line: 786, baseType: !217, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !275, file: !34, line: 788, baseType: !115, size: 1024, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !275, file: !34, line: 789, baseType: !11, size: 64, offset: 1088)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !275, file: !34, line: 790, baseType: !120, size: 512, offset: 1152)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "sha512", scope: !214, file: !34, line: 1084, baseType: !282, size: 1664)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha512_context", file: !34, line: 886, baseType: !274)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "md5sha1", scope: !214, file: !34, line: 1085, baseType: !284, size: 960)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_md5sha1_context", file: !34, line: 1006, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 995, size: 960, elements: !286)
!286 = !{!287, !288, !289, !290, !291}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !285, file: !34, line: 999, baseType: !217, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !285, file: !34, line: 1001, baseType: !77, size: 512, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !285, file: !34, line: 1002, baseType: !11, size: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "val_md5", scope: !285, file: !34, line: 1003, baseType: !82, size: 128, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "val_sha1", scope: !285, file: !34, line: 1004, baseType: !93, size: 160, offset: 768)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "kso", scope: !210, file: !29, line: 113, baseType: !77, size: 512, offset: 1664)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !210, file: !29, line: 114, baseType: !14, size: 64, offset: 2176)
!294 = !DILocalVariable(name: "ctx", arg: 1, scope: !204, file: !4, line: 46, type: !207)
!295 = !DILocation(line: 0, scope: !204)
!296 = !DILocalVariable(name: "data", arg: 2, scope: !204, file: !4, line: 47, type: !54)
!297 = !DILocalVariable(name: "len", arg: 3, scope: !204, file: !4, line: 47, type: !14)
!298 = !DILocalVariable(name: "min_len", arg: 4, scope: !204, file: !4, line: 47, type: !14)
!299 = !DILocalVariable(name: "max_len", arg: 5, scope: !204, file: !4, line: 47, type: !14)
!300 = !DILocalVariable(name: "out", arg: 6, scope: !204, file: !4, line: 48, type: !62)
!301 = !DILocalVariable(name: "hc", scope: !204, file: !4, line: 66, type: !213)
!302 = !DILocation(line: 66, column: 25, scope: !204)
!303 = !DILocalVariable(name: "tmp1", scope: !204, file: !4, line: 71, type: !77)
!304 = !DILocation(line: 71, column: 16, scope: !204)
!305 = !DILocalVariable(name: "tmp2", scope: !204, file: !4, line: 71, type: !77)
!306 = !DILocation(line: 71, column: 26, scope: !204)
!307 = !DILocation(line: 77, column: 12, scope: !204)
!308 = !DILocation(line: 82, column: 11, scope: !204)
!309 = !DILocalVariable(name: "dig", scope: !204, file: !4, line: 65, type: !217)
!310 = !DILocation(line: 83, column: 13, scope: !204)
!311 = !DILocation(line: 83, column: 18, scope: !204)
!312 = !DILocation(line: 83, column: 47, scope: !204)
!313 = !DILocalVariable(name: "be", scope: !204, file: !4, line: 67, type: !314)
!314 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!315 = !DILocalVariable(name: "po", scope: !204, file: !4, line: 68, type: !6)
!316 = !DILocation(line: 85, column: 11, scope: !317)
!317 = distinct !DILexicalBlock(scope: !204, file: !4, line: 85, column: 6)
!318 = !DILocation(line: 85, column: 16, scope: !317)
!319 = !DILocation(line: 85, column: 6, scope: !204)
!320 = !DILocation(line: 86, column: 6, scope: !321)
!321 = distinct !DILexicalBlock(scope: !317, file: !4, line: 85, column: 46)
!322 = !DILocation(line: 87, column: 2, scope: !321)
!323 = !DILocation(line: 88, column: 7, scope: !204)
!324 = !DILocalVariable(name: "bs", scope: !204, file: !4, line: 68, type: !6)
!325 = !DILocation(line: 89, column: 9, scope: !204)
!326 = !DILocalVariable(name: "hlen", scope: !204, file: !4, line: 72, type: !14)
!327 = !DILocation(line: 94, column: 15, scope: !204)
!328 = !DILocation(line: 94, column: 25, scope: !204)
!329 = !DILocation(line: 94, column: 33, scope: !204)
!330 = !DILocation(line: 94, column: 10, scope: !204)
!331 = !DILocalVariable(name: "count", scope: !204, file: !4, line: 70, type: !11)
!332 = !DILocation(line: 95, column: 19, scope: !204)
!333 = !DILocation(line: 95, column: 36, scope: !204)
!334 = !DILocalVariable(name: "bit_len", scope: !204, file: !4, line: 70, type: !11)
!335 = !DILocation(line: 102, column: 18, scope: !204)
!336 = !DILocation(line: 102, column: 56, scope: !204)
!337 = !DILocation(line: 102, column: 42, scope: !204)
!338 = !DILocation(line: 102, column: 41, scope: !204)
!339 = !DILocation(line: 102, column: 39, scope: !204)
!340 = !DILocalVariable(name: "ncount", scope: !204, file: !4, line: 70, type: !11)
!341 = !DILocation(line: 103, column: 13, scope: !342)
!342 = distinct !DILexicalBlock(scope: !204, file: !4, line: 103, column: 6)
!343 = !DILocation(line: 103, column: 6, scope: !204)
!344 = !DILocation(line: 106, column: 26, scope: !345)
!345 = distinct !DILexicalBlock(scope: !342, file: !4, line: 103, column: 22)
!346 = !DILocalVariable(name: "zlen", scope: !345, file: !4, line: 104, type: !14)
!347 = !DILocation(line: 0, scope: !345)
!348 = !DILocation(line: 107, column: 8, scope: !345)
!349 = !DILocation(line: 107, column: 19, scope: !345)
!350 = !DILocation(line: 107, column: 3, scope: !345)
!351 = !DILocation(line: 108, column: 38, scope: !345)
!352 = !DILocation(line: 109, column: 7, scope: !345)
!353 = !DILocation(line: 110, column: 11, scope: !345)
