; ModuleID = 'api_mul-k.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.br_ec_impl = type { i32, i8* (i32, i64*)*, i8* (i32, i64*)*, i64 (i32, i64*)*, i32 (i8*, i64, i8*, i64, i32)*, i64 (i8*, i8*, i64, i32)*, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* }
%struct.smack_value = type { i8* }
%struct.p256_jacobian = type { [20 x i32], [20 x i32], [20 x i32] }

@br_ec_p256_m15 = dso_local constant %struct.br_ec_impl { i32 8388608, i8* (i32, i64*)* @api_generator, i8* (i32, i64*)* @api_order, i64 (i32, i64*)* @api_xoff, i32 (i8*, i64, i8*, i64, i32)* @api_mul, i64 (i8*, i8*, i64, i32)* @api_mulgen, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* @api_muladd }, align 8, !dbg !0, !psr.id !76
@F256 = internal constant [20 x i32] [i32 8191, i32 8191, i32 8191, i32 8191, i32 8191, i32 8191, i32 8191, i32 31, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 1024, i32 0, i32 0, i32 8184, i32 8191, i32 511], align 16, !dbg !30, !psr.id !77

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "br_ec_p256_m15", scope: !2, file: !3, line: 2116, type: !43, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !18, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../BearSSL/src/ec/ec_p256_m15.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m15")
!4 = !{}
!5 = !{!6, !11, !16, !17}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !7, line: 26, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !9, line: 42, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !13, line: 26, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !9, line: 41, baseType: !15)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !{!0, !19, !25, !30, !36, !38}
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "P256_G", scope: !2, file: !3, line: 1993, type: !21, isLocal: true, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 520, elements: !23)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!23 = !{!24}
!24 = !DISubrange(count: 65)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "P256_N", scope: !2, file: !3, line: 2003, type: !27, isLocal: true, isDefinition: true)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 256, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 32)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "F256", scope: !2, file: !3, line: 992, type: !32, isLocal: true, isDefinition: true)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 640, elements: !34)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!34 = !{!35}
!35 = !DISubrange(count: 20)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "P256_B", scope: !2, file: !3, line: 1001, type: !32, isLocal: true, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "Gwin", scope: !2, file: !3, line: 1823, type: !40, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 9600, elements: !41)
!41 = !{!42, !35}
!42 = !DISubrange(count: 15)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !45, line: 415, baseType: !46)
!45 = !DIFile(filename: "../BearSSL/inc/bearssl_ec.h", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m15")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 270, size: 448, elements: !47)
!47 = !{!48, !49, !58, !59, !63, !68, !72}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !46, file: !45, line: 279, baseType: !6, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !46, file: !45, line: 292, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !15, !54}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !46, file: !45, line: 306, baseType: !50, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !46, file: !45, line: 318, baseType: !60, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!55, !15, !54}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !46, file: !45, line: 350, baseType: !64, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!6, !67, !55, !53, !55, !15}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !46, file: !45, line: 366, baseType: !69, size: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!55, !67, !53, !55, !15}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !46, file: !45, line: 412, baseType: !73, size: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!6, !67, !53, !55, !53, !55, !53, !55, !15}
!76 = !{!"0"}
!77 = !{!"1"}
!78 = !{!"2"}
!79 = !{!"3"}
!80 = !{!"4"}
!81 = !{!"5"}
!82 = distinct !DICompileUnit(language: DW_LANG_C99, file: !83, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!83 = !DIFile(filename: "api_mul.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m15")
!84 = distinct !DICompileUnit(language: DW_LANG_C99, file: !85, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!85 = !DIFile(filename: "../BearSSL/src/codec/ccopy.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m15")
!86 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!87 = !{i32 7, !"Dwarf Version", i32 4}
!88 = !{i32 2, !"Debug Info Version", i32 3}
!89 = !{i32 1, !"wchar_size", i32 4}
!90 = distinct !DISubprogram(name: "api_mul_wrapper", scope: !83, file: !83, line: 7, type: !91, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !82, retainedNodes: !4)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !67, !55, !53, !55, !15}
!93 = !DILocalVariable(name: "G", arg: 1, scope: !90, file: !83, line: 7, type: !67)
!94 = !DILocation(line: 0, scope: !90)
!95 = !{!"6"}
!96 = !DILocalVariable(name: "Glen", arg: 2, scope: !90, file: !83, line: 7, type: !55)
!97 = !{!"7"}
!98 = !DILocalVariable(name: "kb", arg: 3, scope: !90, file: !83, line: 8, type: !53)
!99 = !{!"8"}
!100 = !DILocalVariable(name: "kblen", arg: 4, scope: !90, file: !83, line: 8, type: !55)
!101 = !{!"9"}
!102 = !DILocalVariable(name: "curve", arg: 5, scope: !90, file: !83, line: 8, type: !15)
!103 = !{!"10"}
!104 = !DILocation(line: 9, column: 12, scope: !90)
!105 = !{!"11"}
!106 = !DILocation(line: 9, column: 2, scope: !90)
!107 = !{!"12"}
!108 = !DILocation(line: 10, column: 12, scope: !90)
!109 = !{!"13"}
!110 = !DILocation(line: 10, column: 2, scope: !90)
!111 = !{!"14"}
!112 = !DILocation(line: 11, column: 12, scope: !90)
!113 = !{!"15"}
!114 = !DILocation(line: 11, column: 2, scope: !90)
!115 = !{!"16"}
!116 = !DILocation(line: 12, column: 12, scope: !90)
!117 = !{!"17"}
!118 = !DILocation(line: 12, column: 2, scope: !90)
!119 = !{!"18"}
!120 = !DILocation(line: 13, column: 12, scope: !90)
!121 = !{!"19"}
!122 = !DILocation(line: 13, column: 2, scope: !90)
!123 = !{!"20"}
!124 = !DILocation(line: 15, column: 12, scope: !90)
!125 = !{!"21"}
!126 = !DILocation(line: 15, column: 2, scope: !90)
!127 = !{!"22"}
!128 = !DILocalVariable(name: "iec", scope: !90, file: !83, line: 16, type: !129)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !45, line: 415, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 270, size: 448, elements: !133)
!133 = !{!134, !135, !136, !137, !138, !139, !140}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !132, file: !45, line: 279, baseType: !6, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !132, file: !45, line: 292, baseType: !50, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !132, file: !45, line: 306, baseType: !50, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !132, file: !45, line: 318, baseType: !60, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !132, file: !45, line: 350, baseType: !64, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !132, file: !45, line: 366, baseType: !69, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !132, file: !45, line: 412, baseType: !73, size: 64, offset: 384)
!141 = !{!"23"}
!142 = !DILocation(line: 18, column: 7, scope: !90)
!143 = !{!"24"}
!144 = !{!"25"}
!145 = !DILocation(line: 18, column: 2, scope: !90)
!146 = !{!"26"}
!147 = !DILocation(line: 19, column: 1, scope: !90)
!148 = !{!"27"}
!149 = distinct !DISubprogram(name: "api_mul_wrapper_t", scope: !83, file: !83, line: 30, type: !150, scopeLine: 30, spFlags: DISPFlagDefinition, unit: !82, retainedNodes: !4)
!150 = !DISubroutineType(types: !151)
!151 = !{null}
!152 = !DILocation(line: 32, column: 21, scope: !149)
!153 = !{!"28"}
!154 = !DILocalVariable(name: "G", scope: !149, file: !83, line: 32, type: !67)
!155 = !DILocation(line: 0, scope: !149)
!156 = !{!"29"}
!157 = !DILocation(line: 33, column: 17, scope: !149)
!158 = !{!"30"}
!159 = !DILocalVariable(name: "Glen", scope: !149, file: !83, line: 33, type: !55)
!160 = !{!"31"}
!161 = !DILocation(line: 34, column: 28, scope: !149)
!162 = !{!"32"}
!163 = !DILocalVariable(name: "kb", scope: !149, file: !83, line: 34, type: !53)
!164 = !{!"33"}
!165 = !DILocation(line: 35, column: 18, scope: !149)
!166 = !{!"34"}
!167 = !DILocalVariable(name: "kblen", scope: !149, file: !83, line: 35, type: !55)
!168 = !{!"35"}
!169 = !DILocalVariable(name: "curve", scope: !149, file: !83, line: 36, type: !15)
!170 = !{!"36"}
!171 = !DILocalVariable(name: "iec", scope: !149, file: !83, line: 38, type: !129)
!172 = !{!"37"}
!173 = !DILocation(line: 40, column: 7, scope: !149)
!174 = !{!"38"}
!175 = !{!"39"}
!176 = !DILocation(line: 40, column: 2, scope: !149)
!177 = !{!"40"}
!178 = !DILocation(line: 41, column: 1, scope: !149)
!179 = !{!"41"}
!180 = distinct !DISubprogram(name: "br_ccopy", scope: !85, file: !85, line: 29, type: !181, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !84, retainedNodes: !4)
!181 = !DISubroutineType(types: !182)
!182 = !{null, !6, !17, !183, !55}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!185 = !DILocalVariable(name: "ctl", arg: 1, scope: !180, file: !85, line: 29, type: !6)
!186 = !DILocation(line: 0, scope: !180)
!187 = !{!"42"}
!188 = !DILocalVariable(name: "dst", arg: 2, scope: !180, file: !85, line: 29, type: !17)
!189 = !{!"43"}
!190 = !DILocalVariable(name: "src", arg: 3, scope: !180, file: !85, line: 29, type: !183)
!191 = !{!"44"}
!192 = !DILocalVariable(name: "len", arg: 4, scope: !180, file: !85, line: 29, type: !55)
!193 = !{!"45"}
!194 = !DILocalVariable(name: "d", scope: !180, file: !85, line: 31, type: !67)
!195 = !{!"46"}
!196 = !DILocalVariable(name: "s", scope: !180, file: !85, line: 32, type: !53)
!197 = !{!"47"}
!198 = !DILocation(line: 36, column: 2, scope: !180)
!199 = !{!"48"}
!200 = !{!"49"}
!201 = !{!"50"}
!202 = !{!"PointTainted"}
!203 = !{!"51"}
!204 = !{!"52"}
!205 = !{!"53"}
!206 = !{!"54"}
!207 = !DILocation(line: 36, column: 13, scope: !180)
!208 = !{!"55"}
!209 = !{!"56"}
!210 = !DILocation(line: 36, column: 16, scope: !180)
!211 = !{!"57"}
!212 = !{!"58"}
!213 = !DILocation(line: 39, column: 10, scope: !214)
!214 = distinct !DILexicalBlock(scope: !180, file: !85, line: 36, column: 21)
!215 = !{!"59"}
!216 = !{!"60"}
!217 = !DILocation(line: 39, column: 7, scope: !214)
!218 = !{!"61"}
!219 = !{!"ValueTainted"}
!220 = !{!"62"}
!221 = !DILocalVariable(name: "x", scope: !214, file: !85, line: 37, type: !6)
!222 = !DILocation(line: 0, scope: !214)
!223 = !{!"63"}
!224 = !DILocation(line: 40, column: 7, scope: !214)
!225 = !{!"64"}
!226 = !{!"65"}
!227 = !DILocalVariable(name: "y", scope: !214, file: !85, line: 37, type: !6)
!228 = !{!"66"}
!229 = !DILocation(line: 41, column: 8, scope: !214)
!230 = !{!"67"}
!231 = !{!"68"}
!232 = !DILocation(line: 41, column: 6, scope: !214)
!233 = !{!"69"}
!234 = !DILocation(line: 42, column: 5, scope: !214)
!235 = !{!"70"}
!236 = !{!"71"}
!237 = distinct !{!237, !198, !238, !239}
!238 = !DILocation(line: 43, column: 2, scope: !180)
!239 = !{!"llvm.loop.mustprogress"}
!240 = !{!"72"}
!241 = !DILocation(line: 44, column: 1, scope: !180)
!242 = !{!"73"}
!243 = distinct !DISubprogram(name: "MUX", scope: !244, file: !244, line: 770, type: !245, scopeLine: 771, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !84, retainedNodes: !4)
!244 = !DIFile(filename: "../BearSSL/src/inner.h", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m15")
!245 = !DISubroutineType(types: !246)
!246 = !{!6, !6, !6, !6}
!247 = !DILocalVariable(name: "ctl", arg: 1, scope: !243, file: !244, line: 770, type: !6)
!248 = !DILocation(line: 0, scope: !243)
!249 = !{!"74"}
!250 = !DILocalVariable(name: "x", arg: 2, scope: !243, file: !244, line: 770, type: !6)
!251 = !{!"75"}
!252 = !DILocalVariable(name: "y", arg: 3, scope: !243, file: !244, line: 770, type: !6)
!253 = !{!"76"}
!254 = !DILocation(line: 772, column: 14, scope: !243)
!255 = !{!"77"}
!256 = !DILocation(line: 772, column: 24, scope: !243)
!257 = !{!"78"}
!258 = !DILocation(line: 772, column: 19, scope: !243)
!259 = !{!"79"}
!260 = !DILocation(line: 772, column: 11, scope: !243)
!261 = !{!"80"}
!262 = !DILocation(line: 772, column: 2, scope: !243)
!263 = !{!"81"}
!264 = distinct !DISubprogram(name: "api_generator", scope: !3, file: !3, line: 2011, type: !51, scopeLine: 2012, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!265 = !DILocalVariable(name: "curve", arg: 1, scope: !264, file: !3, line: 2011, type: !15)
!266 = !DILocation(line: 0, scope: !264)
!267 = !{!"82"}
!268 = !DILocalVariable(name: "len", arg: 2, scope: !264, file: !3, line: 2011, type: !54)
!269 = !{!"83"}
!270 = !DILocation(line: 2014, column: 7, scope: !264)
!271 = !{!"84"}
!272 = !{!"85"}
!273 = !DILocation(line: 2015, column: 2, scope: !264)
!274 = !{!"86"}
!275 = distinct !DISubprogram(name: "api_order", scope: !3, file: !3, line: 2019, type: !51, scopeLine: 2020, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!276 = !DILocalVariable(name: "curve", arg: 1, scope: !275, file: !3, line: 2019, type: !15)
!277 = !DILocation(line: 0, scope: !275)
!278 = !{!"87"}
!279 = !DILocalVariable(name: "len", arg: 2, scope: !275, file: !3, line: 2019, type: !54)
!280 = !{!"88"}
!281 = !DILocation(line: 2022, column: 7, scope: !275)
!282 = !{!"89"}
!283 = !{!"90"}
!284 = !DILocation(line: 2023, column: 2, scope: !275)
!285 = !{!"91"}
!286 = distinct !DISubprogram(name: "api_xoff", scope: !3, file: !3, line: 2027, type: !61, scopeLine: 2028, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!287 = !DILocalVariable(name: "curve", arg: 1, scope: !286, file: !3, line: 2027, type: !15)
!288 = !DILocation(line: 0, scope: !286)
!289 = !{!"92"}
!290 = !DILocalVariable(name: "len", arg: 2, scope: !286, file: !3, line: 2027, type: !54)
!291 = !{!"93"}
!292 = !DILocation(line: 2030, column: 7, scope: !286)
!293 = !{!"94"}
!294 = !DILocation(line: 2031, column: 2, scope: !286)
!295 = !{!"95"}
!296 = distinct !DISubprogram(name: "api_mul", scope: !3, file: !3, line: 2035, type: !65, scopeLine: 2037, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!297 = !{!"96"}
!298 = !DILocalVariable(name: "G", arg: 1, scope: !296, file: !3, line: 2035, type: !67)
!299 = !DILocation(line: 0, scope: !296)
!300 = !{!"97"}
!301 = !DILocalVariable(name: "Glen", arg: 2, scope: !296, file: !3, line: 2035, type: !55)
!302 = !{!"98"}
!303 = !DILocalVariable(name: "x", arg: 3, scope: !296, file: !3, line: 2036, type: !53)
!304 = !{!"99"}
!305 = !DILocalVariable(name: "xlen", arg: 4, scope: !296, file: !3, line: 2036, type: !55)
!306 = !{!"100"}
!307 = !DILocalVariable(name: "curve", arg: 5, scope: !296, file: !3, line: 2036, type: !15)
!308 = !{!"101"}
!309 = !DILocalVariable(name: "P", scope: !296, file: !3, line: 2039, type: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "p256_jacobian", file: !3, line: 1249, baseType: !311)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 1245, size: 1920, elements: !312)
!312 = !{!313, !315, !316}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !311, file: !3, line: 1246, baseType: !314, size: 640)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 640, elements: !34)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !311, file: !3, line: 1247, baseType: !314, size: 640, offset: 640)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !311, file: !3, line: 1248, baseType: !314, size: 640, offset: 1280)
!317 = !DILocation(line: 2039, column: 16, scope: !296)
!318 = !{!"102"}
!319 = !DILocation(line: 2042, column: 11, scope: !320)
!320 = distinct !DILexicalBlock(scope: !296, file: !3, line: 2042, column: 6)
!321 = !{!"103"}
!322 = !DILocation(line: 2042, column: 6, scope: !296)
!323 = !{!"104"}
!324 = !DILocation(line: 2043, column: 3, scope: !325)
!325 = distinct !DILexicalBlock(scope: !320, file: !3, line: 2042, column: 18)
!326 = !{!"105"}
!327 = !DILocation(line: 2045, column: 6, scope: !296)
!328 = !{!"106"}
!329 = !DILocalVariable(name: "r", scope: !296, file: !3, line: 2038, type: !6)
!330 = !{!"107"}
!331 = !DILocation(line: 2046, column: 2, scope: !296)
!332 = !{!"108"}
!333 = !DILocation(line: 2047, column: 2, scope: !296)
!334 = !{!"109"}
!335 = !DILocation(line: 2048, column: 2, scope: !296)
!336 = !{!"110"}
!337 = !DILocation(line: 2049, column: 2, scope: !296)
!338 = !{!"111"}
!339 = !{!"112"}
!340 = !DILocation(line: 2050, column: 1, scope: !296)
!341 = !{!"113"}
!342 = distinct !DISubprogram(name: "api_mulgen", scope: !3, file: !3, line: 2053, type: !70, scopeLine: 2055, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!343 = !{!"114"}
!344 = !DILocalVariable(name: "R", arg: 1, scope: !342, file: !3, line: 2053, type: !67)
!345 = !DILocation(line: 0, scope: !342)
!346 = !{!"115"}
!347 = !DILocalVariable(name: "x", arg: 2, scope: !342, file: !3, line: 2054, type: !53)
!348 = !{!"116"}
!349 = !DILocalVariable(name: "xlen", arg: 3, scope: !342, file: !3, line: 2054, type: !55)
!350 = !{!"117"}
!351 = !DILocalVariable(name: "curve", arg: 4, scope: !342, file: !3, line: 2054, type: !15)
!352 = !{!"118"}
!353 = !DILocalVariable(name: "P", scope: !342, file: !3, line: 2056, type: !310)
!354 = !DILocation(line: 2056, column: 16, scope: !342)
!355 = !{!"119"}
!356 = !DILocation(line: 2059, column: 2, scope: !342)
!357 = !{!"120"}
!358 = !DILocation(line: 2060, column: 2, scope: !342)
!359 = !{!"121"}
!360 = !DILocation(line: 2061, column: 2, scope: !342)
!361 = !{!"122"}
!362 = !DILocation(line: 2062, column: 2, scope: !342)
!363 = !{!"123"}
!364 = distinct !DISubprogram(name: "api_muladd", scope: !3, file: !3, line: 2066, type: !74, scopeLine: 2069, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!365 = !{!"124"}
!366 = !{!"125"}
!367 = !DILocalVariable(name: "A", arg: 1, scope: !364, file: !3, line: 2066, type: !67)
!368 = !DILocation(line: 0, scope: !364)
!369 = !{!"126"}
!370 = !DILocalVariable(name: "B", arg: 2, scope: !364, file: !3, line: 2066, type: !53)
!371 = !{!"127"}
!372 = !DILocalVariable(name: "len", arg: 3, scope: !364, file: !3, line: 2066, type: !55)
!373 = !{!"128"}
!374 = !DILocalVariable(name: "x", arg: 4, scope: !364, file: !3, line: 2067, type: !53)
!375 = !{!"129"}
!376 = !DILocalVariable(name: "xlen", arg: 5, scope: !364, file: !3, line: 2067, type: !55)
!377 = !{!"130"}
!378 = !DILocalVariable(name: "y", arg: 6, scope: !364, file: !3, line: 2068, type: !53)
!379 = !{!"131"}
!380 = !DILocalVariable(name: "ylen", arg: 7, scope: !364, file: !3, line: 2068, type: !55)
!381 = !{!"132"}
!382 = !DILocalVariable(name: "curve", arg: 8, scope: !364, file: !3, line: 2068, type: !15)
!383 = !{!"133"}
!384 = !DILocalVariable(name: "P", scope: !364, file: !3, line: 2070, type: !310)
!385 = !DILocation(line: 2070, column: 16, scope: !364)
!386 = !{!"134"}
!387 = !DILocalVariable(name: "Q", scope: !364, file: !3, line: 2070, type: !310)
!388 = !DILocation(line: 2070, column: 19, scope: !364)
!389 = !{!"135"}
!390 = !DILocation(line: 2075, column: 10, scope: !391)
!391 = distinct !DILexicalBlock(scope: !364, file: !3, line: 2075, column: 6)
!392 = !{!"136"}
!393 = !DILocation(line: 2075, column: 6, scope: !364)
!394 = !{!"137"}
!395 = !DILocation(line: 2076, column: 3, scope: !396)
