; ModuleID = 'api_mul-k.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.br_ec_impl = type { i32, i8* (i32, i64*)*, i8* (i32, i64*)*, i64 (i32, i64*)*, i32 (i8*, i64, i8*, i64, i32)*, i64 (i8*, i8*, i64, i32)*, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* }
%struct.p256_affine = type { [4 x i64], [4 x i64] }
%struct.smack_value = type { i8* }
%struct.p256_jacobian = type { [4 x i64], [4 x i64], [4 x i64] }
%union.anon = type { [15 x %struct.p256_jacobian] }

@br_ec_p256_m64 = dso_local constant %struct.br_ec_impl { i32 8388608, i8* (i32, i64*)* @api_generator, i8* (i32, i64*)* @api_order, i64 (i32, i64*)* @api_xoff, i32 (i8*, i64, i8*, i64, i32)* @api_mul, i64 (i8*, i8*, i64, i32)* @api_mulgen, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* @api_muladd }, align 8, !dbg !0, !psr.id !95
@f256_frommonty.one = internal constant [4 x i64] [i64 1, i64 0, i64 0, i64 0], align 16, !dbg !48, !psr.id !96

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "br_ec_p256_m64", scope: !2, file: !3, line: 1755, type: !63, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !21, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../BearSSL/src/ec/ec_p256_m64.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m64")
!4 = !{}
!5 = !{!6, !11, !15, !18, !19, !20}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !7, line: 26, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !9, line: 41, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!10 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !12, line: 26, baseType: !13)
!12 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !9, line: 42, baseType: !14)
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !12, line: 27, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !9, line: 45, baseType: !17)
!17 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!18 = !DIBasicType(name: "unsigned __int128", size: 128, encoding: DW_ATE_unsigned)
!19 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!21 = !{!0, !22, !28, !33, !44, !46, !48, !51}
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(name: "P256_G", scope: !2, file: !3, line: 33, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 520, elements: !26)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!26 = !{!27}
!27 = !DISubrange(count: 65)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "P256_N", scope: !2, file: !3, line: 43, type: !30, isLocal: true, isDefinition: true)
!30 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 256, elements: !31)
!31 = !{!32}
!32 = !DISubrange(count: 32)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "R2", scope: !35, file: !3, line: 516, type: !41, isLocal: true, isDefinition: true)
!35 = distinct !DISubprogram(name: "f256_tomonty", scope: !3, file: !3, line: 508, type: !36, scopeLine: 509, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!36 = !DISubroutineType(types: !37)
!37 = !{null, !38, !39}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!40 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !40, size: 256, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 4)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "P256_B_MONTY", scope: !2, file: !3, line: 87, type: !41, isLocal: true, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "F256_R", scope: !2, file: !3, line: 80, type: !41, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "one", scope: !50, file: !3, line: 535, type: !41, isLocal: true, isDefinition: true)
!50 = distinct !DISubprogram(name: "f256_frommonty", scope: !3, file: !3, line: 530, type: !36, scopeLine: 531, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "P256_Gwin", scope: !2, file: !3, line: 1508, type: !53, isLocal: true, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 7680, elements: !61)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "p256_affine", file: !3, line: 652, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 649, size: 512, elements: !57)
!57 = !{!58, !60}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !56, file: !3, line: 650, baseType: !59, size: 256)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 256, elements: !42)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !56, file: !3, line: 651, baseType: !59, size: 256, offset: 256)
!61 = !{!62}
!62 = !DISubrange(count: 15)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !65, line: 415, baseType: !66)
!65 = !DIFile(filename: "../BearSSL/inc/bearssl_ec.h", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m64")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 270, size: 448, elements: !67)
!67 = !{!68, !69, !77, !78, !82, !87, !91}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !66, file: !65, line: 279, baseType: !11, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !66, file: !65, line: 292, baseType: !70, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !10, !74}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !17)
!76 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!77 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !66, file: !65, line: 306, baseType: !70, size: 64, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !66, file: !65, line: 318, baseType: !79, size: 64, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DISubroutineType(types: !81)
!81 = !{!75, !10, !74}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !66, file: !65, line: 350, baseType: !83, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!11, !86, !75, !73, !75, !10}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !66, file: !65, line: 366, baseType: !88, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!75, !86, !73, !75, !10}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !66, file: !65, line: 412, baseType: !92, size: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DISubroutineType(types: !94)
!94 = !{!11, !86, !73, !75, !73, !75, !73, !75, !10}
!95 = !{!"0"}
!96 = !{!"1"}
!97 = !{!"2"}
!98 = !{!"3"}
!99 = !{!"4"}
!100 = !{!"5"}
!101 = !{!"6"}
!102 = !{!"7"}
!103 = distinct !DICompileUnit(language: DW_LANG_C99, file: !104, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!104 = !DIFile(filename: "api_mul.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m64")
!105 = distinct !DICompileUnit(language: DW_LANG_C99, file: !106, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!106 = !DIFile(filename: "../BearSSL/src/codec/ccopy.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m64")
!107 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!108 = !{i32 7, !"Dwarf Version", i32 4}
!109 = !{i32 2, !"Debug Info Version", i32 3}
!110 = !{i32 1, !"wchar_size", i32 4}
!111 = distinct !DISubprogram(name: "api_mul_wrapper", scope: !104, file: !104, line: 7, type: !112, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !103, retainedNodes: !4)
!112 = !DISubroutineType(types: !113)
!113 = !{null, !86, !75, !73, !75, !10}
!114 = !DILocalVariable(name: "G", arg: 1, scope: !111, file: !104, line: 7, type: !86)
!115 = !DILocation(line: 0, scope: !111)
!116 = !{!"8"}
!117 = !DILocalVariable(name: "Glen", arg: 2, scope: !111, file: !104, line: 7, type: !75)
!118 = !{!"9"}
!119 = !DILocalVariable(name: "kb", arg: 3, scope: !111, file: !104, line: 8, type: !73)
!120 = !{!"10"}
!121 = !DILocalVariable(name: "kblen", arg: 4, scope: !111, file: !104, line: 8, type: !75)
!122 = !{!"11"}
!123 = !DILocalVariable(name: "curve", arg: 5, scope: !111, file: !104, line: 8, type: !10)
!124 = !{!"12"}
!125 = !DILocation(line: 9, column: 12, scope: !111)
!126 = !{!"13"}
!127 = !DILocation(line: 9, column: 2, scope: !111)
!128 = !{!"14"}
!129 = !DILocation(line: 10, column: 12, scope: !111)
!130 = !{!"15"}
!131 = !DILocation(line: 10, column: 2, scope: !111)
!132 = !{!"16"}
!133 = !DILocation(line: 11, column: 12, scope: !111)
!134 = !{!"17"}
!135 = !DILocation(line: 11, column: 2, scope: !111)
!136 = !{!"18"}
!137 = !DILocation(line: 12, column: 12, scope: !111)
!138 = !{!"19"}
!139 = !DILocation(line: 12, column: 2, scope: !111)
!140 = !{!"20"}
!141 = !DILocation(line: 13, column: 12, scope: !111)
!142 = !{!"21"}
!143 = !DILocation(line: 13, column: 2, scope: !111)
!144 = !{!"22"}
!145 = !DILocation(line: 15, column: 12, scope: !111)
!146 = !{!"23"}
!147 = !DILocation(line: 15, column: 2, scope: !111)
!148 = !{!"24"}
!149 = !DILocalVariable(name: "iec", scope: !111, file: !104, line: 16, type: !150)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !65, line: 415, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !65, line: 270, size: 448, elements: !154)
!154 = !{!155, !156, !157, !158, !159, !160, !161}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !153, file: !65, line: 279, baseType: !11, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !153, file: !65, line: 292, baseType: !70, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !153, file: !65, line: 306, baseType: !70, size: 64, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !153, file: !65, line: 318, baseType: !79, size: 64, offset: 192)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !153, file: !65, line: 350, baseType: !83, size: 64, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !153, file: !65, line: 366, baseType: !88, size: 64, offset: 320)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !153, file: !65, line: 412, baseType: !92, size: 64, offset: 384)
!162 = !{!"25"}
!163 = !DILocation(line: 18, column: 7, scope: !111)
!164 = !{!"26"}
!165 = !{!"27"}
!166 = !DILocation(line: 18, column: 2, scope: !111)
!167 = !{!"28"}
!168 = !DILocation(line: 19, column: 1, scope: !111)
!169 = !{!"29"}
!170 = distinct !DISubprogram(name: "api_mul_wrapper_t", scope: !104, file: !104, line: 30, type: !171, scopeLine: 30, spFlags: DISPFlagDefinition, unit: !103, retainedNodes: !4)
!171 = !DISubroutineType(types: !172)
!172 = !{null}
!173 = !DILocation(line: 32, column: 21, scope: !170)
!174 = !{!"30"}
!175 = !DILocalVariable(name: "G", scope: !170, file: !104, line: 32, type: !86)
!176 = !DILocation(line: 0, scope: !170)
!177 = !{!"31"}
!178 = !DILocation(line: 33, column: 17, scope: !170)
!179 = !{!"32"}
!180 = !DILocalVariable(name: "Glen", scope: !170, file: !104, line: 33, type: !75)
!181 = !{!"33"}
!182 = !DILocation(line: 34, column: 28, scope: !170)
!183 = !{!"34"}
!184 = !DILocalVariable(name: "kb", scope: !170, file: !104, line: 34, type: !73)
!185 = !{!"35"}
!186 = !DILocation(line: 35, column: 18, scope: !170)
!187 = !{!"36"}
!188 = !DILocalVariable(name: "kblen", scope: !170, file: !104, line: 35, type: !75)
!189 = !{!"37"}
!190 = !DILocalVariable(name: "curve", scope: !170, file: !104, line: 36, type: !10)
!191 = !{!"38"}
!192 = !DILocalVariable(name: "iec", scope: !170, file: !104, line: 38, type: !150)
!193 = !{!"39"}
!194 = !DILocation(line: 40, column: 7, scope: !170)
!195 = !{!"40"}
!196 = !{!"41"}
!197 = !DILocation(line: 40, column: 2, scope: !170)
!198 = !{!"42"}
!199 = !DILocation(line: 41, column: 1, scope: !170)
!200 = !{!"43"}
!201 = distinct !DISubprogram(name: "br_ccopy", scope: !106, file: !106, line: 29, type: !202, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !105, retainedNodes: !4)
!202 = !DISubroutineType(types: !203)
!203 = !{null, !11, !20, !204, !75}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!206 = !DILocalVariable(name: "ctl", arg: 1, scope: !201, file: !106, line: 29, type: !11)
!207 = !DILocation(line: 0, scope: !201)
!208 = !{!"44"}
!209 = !DILocalVariable(name: "dst", arg: 2, scope: !201, file: !106, line: 29, type: !20)
!210 = !{!"45"}
!211 = !DILocalVariable(name: "src", arg: 3, scope: !201, file: !106, line: 29, type: !204)
!212 = !{!"46"}
!213 = !DILocalVariable(name: "len", arg: 4, scope: !201, file: !106, line: 29, type: !75)
!214 = !{!"47"}
!215 = !DILocalVariable(name: "d", scope: !201, file: !106, line: 31, type: !86)
!216 = !{!"48"}
!217 = !DILocalVariable(name: "s", scope: !201, file: !106, line: 32, type: !73)
!218 = !{!"49"}
!219 = !DILocation(line: 36, column: 2, scope: !201)
!220 = !{!"50"}
!221 = !{!"51"}
!222 = !{!"52"}
!223 = !{!"PointTainted"}
!224 = !{!"53"}
!225 = !{!"54"}
!226 = !{!"55"}
!227 = !{!"56"}
!228 = !DILocation(line: 36, column: 13, scope: !201)
!229 = !{!"57"}
!230 = !{!"58"}
!231 = !DILocation(line: 36, column: 16, scope: !201)
!232 = !{!"59"}
!233 = !{!"60"}
!234 = !DILocation(line: 39, column: 10, scope: !235)
!235 = distinct !DILexicalBlock(scope: !201, file: !106, line: 36, column: 21)
!236 = !{!"61"}
!237 = !{!"62"}
!238 = !DILocation(line: 39, column: 7, scope: !235)
!239 = !{!"63"}
!240 = !{!"64"}
!241 = !DILocalVariable(name: "x", scope: !235, file: !106, line: 37, type: !11)
!242 = !DILocation(line: 0, scope: !235)
!243 = !{!"65"}
!244 = !DILocation(line: 40, column: 7, scope: !235)
!245 = !{!"66"}
!246 = !{!"ValueTainted"}
!247 = !{!"67"}
!248 = !DILocalVariable(name: "y", scope: !235, file: !106, line: 37, type: !11)
!249 = !{!"68"}
!250 = !DILocation(line: 41, column: 8, scope: !235)
!251 = !{!"69"}
!252 = !{!"70"}
!253 = !DILocation(line: 41, column: 6, scope: !235)
!254 = !{!"71"}
!255 = !DILocation(line: 42, column: 5, scope: !235)
!256 = !{!"72"}
!257 = !{!"73"}
!258 = distinct !{!258, !219, !259, !260}
!259 = !DILocation(line: 43, column: 2, scope: !201)
!260 = !{!"llvm.loop.mustprogress"}
!261 = !{!"74"}
!262 = !DILocation(line: 44, column: 1, scope: !201)
!263 = !{!"75"}
!264 = distinct !DISubprogram(name: "MUX", scope: !265, file: !265, line: 770, type: !266, scopeLine: 771, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !105, retainedNodes: !4)
!265 = !DIFile(filename: "../BearSSL/src/inner.h", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m64")
!266 = !DISubroutineType(types: !267)
!267 = !{!11, !11, !11, !11}
!268 = !DILocalVariable(name: "ctl", arg: 1, scope: !264, file: !265, line: 770, type: !11)
!269 = !DILocation(line: 0, scope: !264)
!270 = !{!"76"}
!271 = !DILocalVariable(name: "x", arg: 2, scope: !264, file: !265, line: 770, type: !11)
!272 = !{!"77"}
!273 = !DILocalVariable(name: "y", arg: 3, scope: !264, file: !265, line: 770, type: !11)
!274 = !{!"78"}
!275 = !DILocation(line: 772, column: 14, scope: !264)
!276 = !{!"79"}
!277 = !DILocation(line: 772, column: 24, scope: !264)
!278 = !{!"80"}
!279 = !DILocation(line: 772, column: 19, scope: !264)
!280 = !{!"81"}
!281 = !DILocation(line: 772, column: 11, scope: !264)
!282 = !{!"82"}
!283 = !DILocation(line: 772, column: 2, scope: !264)
!284 = !{!"83"}
!285 = distinct !DISubprogram(name: "api_generator", scope: !3, file: !3, line: 51, type: !71, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!286 = !DILocalVariable(name: "curve", arg: 1, scope: !285, file: !3, line: 51, type: !10)
!287 = !DILocation(line: 0, scope: !285)
!288 = !{!"84"}
!289 = !DILocalVariable(name: "len", arg: 2, scope: !285, file: !3, line: 51, type: !74)
!290 = !{!"85"}
!291 = !DILocation(line: 54, column: 7, scope: !285)
!292 = !{!"86"}
!293 = !{!"87"}
!294 = !DILocation(line: 55, column: 2, scope: !285)
!295 = !{!"88"}
!296 = distinct !DISubprogram(name: "api_order", scope: !3, file: !3, line: 59, type: !71, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!297 = !DILocalVariable(name: "curve", arg: 1, scope: !296, file: !3, line: 59, type: !10)
!298 = !DILocation(line: 0, scope: !296)
!299 = !{!"89"}
!300 = !DILocalVariable(name: "len", arg: 2, scope: !296, file: !3, line: 59, type: !74)
!301 = !{!"90"}
!302 = !DILocation(line: 62, column: 7, scope: !296)
!303 = !{!"91"}
!304 = !{!"92"}
!305 = !DILocation(line: 63, column: 2, scope: !296)
!306 = !{!"93"}
!307 = distinct !DISubprogram(name: "api_xoff", scope: !3, file: !3, line: 67, type: !80, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!308 = !DILocalVariable(name: "curve", arg: 1, scope: !307, file: !3, line: 67, type: !10)
!309 = !DILocation(line: 0, scope: !307)
!310 = !{!"94"}
!311 = !DILocalVariable(name: "len", arg: 2, scope: !307, file: !3, line: 67, type: !74)
!312 = !{!"95"}
!313 = !DILocation(line: 70, column: 7, scope: !307)
!314 = !{!"96"}
!315 = !DILocation(line: 71, column: 2, scope: !307)
!316 = !{!"97"}
!317 = distinct !DISubprogram(name: "api_mul", scope: !3, file: !3, line: 1651, type: !84, scopeLine: 1653, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!318 = !{!"98"}
!319 = !DILocalVariable(name: "G", arg: 1, scope: !317, file: !3, line: 1651, type: !86)
!320 = !DILocation(line: 0, scope: !317)
!321 = !{!"99"}
!322 = !DILocalVariable(name: "Glen", arg: 2, scope: !317, file: !3, line: 1651, type: !75)
!323 = !{!"100"}
!324 = !DILocalVariable(name: "k", arg: 3, scope: !317, file: !3, line: 1652, type: !73)
!325 = !{!"101"}
!326 = !DILocalVariable(name: "klen", arg: 4, scope: !317, file: !3, line: 1652, type: !75)
!327 = !{!"102"}
!328 = !DILocalVariable(name: "curve", arg: 5, scope: !317, file: !3, line: 1652, type: !10)
!329 = !{!"103"}
!330 = !DILocalVariable(name: "P", scope: !317, file: !3, line: 1655, type: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "p256_jacobian", file: !3, line: 658, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 654, size: 768, elements: !333)
!333 = !{!334, !335, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !332, file: !3, line: 655, baseType: !59, size: 256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !332, file: !3, line: 656, baseType: !59, size: 256, offset: 256)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !332, file: !3, line: 657, baseType: !59, size: 256, offset: 512)
!337 = !DILocation(line: 1655, column: 16, scope: !317)
!338 = !{!"104"}
!339 = !DILocation(line: 1658, column: 11, scope: !340)
!340 = distinct !DILexicalBlock(scope: !317, file: !3, line: 1658, column: 6)
!341 = !{!"105"}
!342 = !DILocation(line: 1658, column: 6, scope: !317)
!343 = !{!"106"}
!344 = !DILocation(line: 1659, column: 3, scope: !345)
!345 = distinct !DILexicalBlock(scope: !340, file: !3, line: 1658, column: 18)
!346 = !{!"107"}
!347 = !DILocation(line: 1661, column: 6, scope: !317)
!348 = !{!"108"}
!349 = !DILocalVariable(name: "r", scope: !317, file: !3, line: 1654, type: !11)
!350 = !{!"109"}
!351 = !DILocation(line: 1662, column: 7, scope: !317)
!352 = !{!"110"}
!353 = !DILocation(line: 1662, column: 4, scope: !317)
!354 = !{!"111"}
!355 = !{!"112"}
!356 = !DILocation(line: 1663, column: 2, scope: !317)
!357 = !{!"113"}
!358 = !DILocation(line: 1664, column: 7, scope: !317)
!359 = !{!"114"}
!360 = !DILocation(line: 1664, column: 4, scope: !317)
!361 = !{!"115"}
!362 = !{!"116"}
!363 = !DILocation(line: 1665, column: 2, scope: !317)
!364 = !{!"117"}
!365 = !{!"118"}
!366 = !DILocation(line: 1666, column: 1, scope: !317)
!367 = !{!"119"}
!368 = distinct !DISubprogram(name: "api_mulgen", scope: !3, file: !3, line: 1669, type: !89, scopeLine: 1671, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!369 = !{!"120"}
!370 = !DILocalVariable(name: "R", arg: 1, scope: !368, file: !3, line: 1669, type: !86)
!371 = !DILocation(line: 0, scope: !368)
!372 = !{!"121"}
!373 = !DILocalVariable(name: "k", arg: 2, scope: !368, file: !3, line: 1670, type: !73)
!374 = !{!"122"}
!375 = !DILocalVariable(name: "klen", arg: 3, scope: !368, file: !3, line: 1670, type: !75)
!376 = !{!"123"}
!377 = !DILocalVariable(name: "curve", arg: 4, scope: !368, file: !3, line: 1670, type: !10)
!378 = !{!"124"}
!379 = !DILocalVariable(name: "P", scope: !368, file: !3, line: 1672, type: !331)
!380 = !DILocation(line: 1672, column: 16, scope: !368)
!381 = !{!"125"}
!382 = !DILocation(line: 1675, column: 2, scope: !368)
!383 = !{!"126"}
!384 = !DILocation(line: 1676, column: 2, scope: !368)
!385 = !{!"127"}
!386 = !DILocation(line: 1677, column: 2, scope: !368)
!387 = !{!"128"}
!388 = distinct !DISubprogram(name: "api_muladd", scope: !3, file: !3, line: 1681, type: !93, scopeLine: 1684, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!389 = !{!"129"}
!390 = !{!"130"}
!391 = !DILocalVariable(name: "A", arg: 1, scope: !388, file: !3, line: 1681, type: !86)
!392 = !DILocation(line: 0, scope: !388)
!393 = !{!"131"}
!394 = !DILocalVariable(name: "B", arg: 2, scope: !388, file: !3, line: 1681, type: !73)
!395 = !{!"132"}
!396 = !DILocalVariable(name: "len", arg: 3, scope: !388, file: !3, line: 1681, type: !75)
!397 = !{!"133"}
!398 = !DILocalVariable(name: "x", arg: 4, scope: !388, file: !3, line: 1682, type: !73)
!399 = !{!"134"}
!400 = !DILocalVariable(name: "xlen", arg: 5, scope: !388, file: !3, line: 1682, type: !75)
!401 = !{!"135"}
!402 = !DILocalVariable(name: "y", arg: 6, scope: !388, file: !3, line: 1683, type: !73)
!403 = !{!"136"}
!404 = !DILocalVariable(name: "ylen", arg: 7, scope: !388, file: !3, line: 1683, type: !75)
!405 = !{!"137"}
!406 = !DILocalVariable(name: "curve", arg: 8, scope: !388, file: !3, line: 1683, type: !10)
!407 = !{!"138"}
!408 = !DILocalVariable(name: "P", scope: !388, file: !3, line: 1713, type: !331)
!409 = !DILocation(line: 1713, column: 16, scope: !388)
!410 = !{!"139"}
!411 = !DILocalVariable(name: "Q", scope: !388, file: !3, line: 1713, type: !331)
!412 = !DILocation(line: 1713, column: 19, scope: !388)
!413 = !{!"140"}
!414 = !DILocation(line: 1718, column: 10, scope: !415)
!415 = distinct !DILexicalBlock(scope: !388, file: !3, line: 1718, column: 6)
!416 = !{!"141"}
