; ModuleID = 'remove_padding.ll'
source_filename = "remove_padding.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.ssl_st = type { i8*, i64, %struct.ssl3_state_st*, %struct.evp_cipher_ctx_st*, i32 }
%struct.ssl3_state_st = type { i64, [8 x i8] }
%struct.evp_cipher_ctx_st = type { %struct.evp_cipher_st* }
%struct.evp_cipher_st = type { i64 }
%struct.ssl3_record_st = type { i32, i8*, i32, i8* }
%struct.smack_value = type { i8* }

@.str = private unnamed_addr constant [9 x i8] zeroinitializer, align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @CRYPTO_memcmp(i8* %0, i8* %1, i64 %2) #0 !dbg !11 {
  call void @llvm.dbg.value(metadata i8* %0, metadata !23, metadata !DIExpression()), !dbg !24
  call void @llvm.dbg.value(metadata i8* %1, metadata !25, metadata !DIExpression()), !dbg !24
  call void @llvm.dbg.value(metadata i64 %2, metadata !26, metadata !DIExpression()), !dbg !24
  call void @llvm.dbg.value(metadata i8* %0, metadata !27, metadata !DIExpression()), !dbg !24
  call void @llvm.dbg.value(metadata i8* %1, metadata !28, metadata !DIExpression()), !dbg !24
  call void @llvm.dbg.value(metadata i8 0, metadata !29, metadata !DIExpression()), !dbg !24
  call void @llvm.dbg.value(metadata i64 0, metadata !30, metadata !DIExpression()), !dbg !24
  br label %4, !dbg !31

4:                                                ; preds = %17, %3

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "remove_padding.c", directory: "/home/luwei/bech-back/OpenSSL/tls1_cbc")
!2 = !{}
!3 = !{!4, !5, !6}
!4 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!7 = !{i32 7, !"Dwarf Version", i32 4}
!8 = !{i32 2, !"Debug Info Version", i32 3}
!9 = !{i32 1, !"wchar_size", i32 4}
!10 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!11 = distinct !DISubprogram(name: "CRYPTO_memcmp", scope: !12, file: !12, line: 42, type: !13, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!12 = !DIFile(filename: "./../tls1_cbc_remove_padding.c", directory: "/home/luwei/bech-back/OpenSSL/tls1_cbc")
!13 = !DISubroutineType(types: !14)
!14 = !{!5, !15, !17, !20}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !21, line: 46, baseType: !22)
!21 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!22 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!23 = !DILocalVariable(name: "in_a", arg: 1, scope: !11, file: !12, line: 42, type: !15)
!24 = !DILocation(line: 0, scope: !11)
!25 = !DILocalVariable(name: "in_b", arg: 2, scope: !11, file: !12, line: 42, type: !17)
!26 = !DILocalVariable(name: "len", arg: 3, scope: !11, file: !12, line: 42, type: !20)
!27 = !DILocalVariable(name: "a", scope: !11, file: !12, line: 45, type: !15)
!28 = !DILocalVariable(name: "b", scope: !11, file: !12, line: 46, type: !17)
!29 = !DILocalVariable(name: "x", scope: !11, file: !12, line: 47, type: !4)
!30 = !DILocalVariable(name: "i", scope: !11, file: !12, line: 44, type: !20)
!31 = !DILocation(line: 49, column: 10, scope: !32)
!32 = distinct !DILexicalBlock(scope: !11, file: !12, line: 49, column: 5)
!33 = !DILocation(line: 0, scope: !32)
!34 = !DILocation(line: 49, column: 19, scope: !35)
!35 = distinct !DILexicalBlock(scope: !32, file: !12, line: 49, column: 5)
!36 = !DILocation(line: 49, column: 5, scope: !32)
!37 = !DILocation(line: 50, column: 14, scope: !35)
!38 = !DILocation(line: 50, column: 21, scope: !35)
!39 = !DILocation(line: 50, column: 19, scope: !35)
!40 = !DILocation(line: 50, column: 11, scope: !35)
!41 = !DILocation(line: 50, column: 9, scope: !35)
!42 = !DILocation(line: 49, column: 27, scope: !35)
!43 = !DILocation(line: 49, column: 5, scope: !35)
!44 = distinct !{!44, !36, !45, !46}
!45 = !DILocation(line: 50, column: 24, scope: !32)
!46 = !{!"llvm.loop.mustprogress"}
!47 = !DILocation(line: 52, column: 12, scope: !11)
!48 = !DILocation(line: 52, column: 5, scope: !11)
!49 = distinct !DISubprogram(name: "tls1_cbc_remove_padding", scope: !12, file: !12, line: 68, type: !50, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!50 = !DISubroutineType(types: !51)
!51 = !{!5, !52, !83, !6, !6}
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL", file: !12, line: 32, baseType: !55)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl_st", file: !12, line: 26, size: 320, elements: !56)
!56 = !{!57, !59, !60, !70, !82}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "expand", scope: !55, file: !12, line: 27, baseType: !58, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !55, file: !12, line: 28, baseType: !22, size: 64, offset: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "s3", scope: !55, file: !12, line: 29, baseType: !61, size: 64, offset: 128)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_state_st", file: !12, line: 13, size: 128, elements: !63)
!63 = !{!64, !66}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !62, file: !12, line: 14, baseType: !65, size: 64)
!65 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "read_sequence", scope: !62, file: !12, line: 15, baseType: !67, size: 64, offset: 64)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 64, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 8)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "enc_read_ctx", scope: !55, file: !12, line: 30, baseType: !71, size: 64, offset: 192)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER_CTX", file: !12, line: 24, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_ctx_st", file: !12, line: 22, size: 64, elements: !74)
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "cipher", scope: !73, file: !12, line: 23, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !78)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "EVP_CIPHER", file: !12, line: 20, baseType: !79)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "evp_cipher_st", file: !12, line: 18, size: 64, elements: !80)
!80 = !{!81}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !79, file: !12, line: 19, baseType: !22, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "slicing_cheat", scope: !55, file: !12, line: 31, baseType: !5, size: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "SSL3_RECORD", file: !12, line: 11, baseType: !85)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssl3_record_st", file: !12, line: 6, size: 256, elements: !86)
!86 = !{!87, !88, !90, !91}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !85, file: !12, line: 7, baseType: !6, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !85, file: !12, line: 8, baseType: !89, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !85, file: !12, line: 9, baseType: !5, size: 32, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !85, file: !12, line: 10, baseType: !89, size: 64, offset: 192)
!92 = !DILocalVariable(name: "s", arg: 1, scope: !49, file: !12, line: 68, type: !52)
!93 = !DILocation(line: 0, scope: !49)
!94 = !DILocalVariable(name: "rec", arg: 2, scope: !49, file: !12, line: 69, type: !83)
!95 = !DILocalVariable(name: "block_size", arg: 3, scope: !49, file: !12, line: 70, type: !6)
!96 = !DILocalVariable(name: "mac_size", arg: 4, scope: !49, file: !12, line: 70, type: !6)
!97 = !DILocation(line: 73, column: 60, scope: !49)
!98 = !DILocalVariable(name: "overhead", scope: !49, file: !12, line: 73, type: !99)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!100 = !DILocation(line: 75, column: 9, scope: !101)
!101 = distinct !DILexicalBlock(scope: !49, file: !12, line: 75, column: 9)
!102 = !DILocation(line: 75, column: 9, scope: !49)
!103 = !DILocation(line: 80, column: 22, scope: !104)
!104 = distinct !DILexicalBlock(scope: !105, file: !12, line: 80, column: 13)
!105 = distinct !DILexicalBlock(scope: !101, file: !12, line: 75, column: 33)
!106 = !DILocation(line: 80, column: 42, scope: !104)
!107 = !DILocation(line: 80, column: 35, scope: !104)
!108 = !DILocation(line: 80, column: 13, scope: !105)
!109 = !DILocation(line: 81, column: 13, scope: !104)
!110 = !DILocation(line: 83, column: 14, scope: !105)
!111 = !DILocation(line: 83, column: 19, scope: !105)
!112 = !DILocation(line: 84, column: 14, scope: !105)
!113 = !DILocation(line: 84, column: 20, scope: !105)
!114 = !DILocation(line: 85, column: 14, scope: !105)
!115 = !DILocation(line: 85, column: 21, scope: !105)
!116 = !DILocation(line: 86, column: 5, scope: !105)
!117 = !DILocation(line: 86, column: 32, scope: !118)
!118 = distinct !DILexicalBlock(scope: !101, file: !12, line: 86, column: 16)
!119 = !DILocation(line: 86, column: 25, scope: !118)
!120 = !DILocation(line: 86, column: 16, scope: !101)
!121 = !DILocation(line: 87, column: 9, scope: !118)
!122 = !DILocation(line: 88, column: 27, scope: !49)
!123 = !DILocation(line: 88, column: 37, scope: !49)
!124 = !DILocation(line: 88, column: 44, scope: !49)
!125 = !DILocation(line: 88, column: 22, scope: !49)
!126 = !DILocalVariable(name: "padding_length", scope: !49, file: !12, line: 72, type: !6)
!127 = !DILocation(line: 97, column: 13, scope: !128)
!128 = distinct !DILexicalBlock(scope: !49, file: !12, line: 97, column: 9)
!129 = !DILocation(line: 97, column: 21, scope: !128)
!130 = !DILocation(line: 97, column: 53, scope: !128)
!131 = !DILocation(line: 97, column: 60, scope: !128)
!132 = !DILocation(line: 97, column: 57, scope: !128)
!133 = !DILocation(line: 97, column: 9, scope: !49)
!134 = !DILocation(line: 98, column: 12, scope: !135)
!135 = distinct !DILexicalBlock(scope: !136, file: !12, line: 98, column: 12)
!136 = distinct !DILexicalBlock(scope: !128, file: !12, line: 97, column: 68)
!137 = !DILocation(line: 98, column: 12, scope: !136)
!138 = !DILocalVariable(name: "to_check", scope: !49, file: !12, line: 72, type: !6)
!139 = !DILocation(line: 99, column: 13, scope: !135)
!140 = !DILocation(line: 101, column: 31, scope: !141)
!141 = distinct !DILexicalBlock(scope: !136, file: !12, line: 101, column: 13)
!142 = !DILocation(line: 101, column: 35, scope: !141)
!143 = !DILocation(line: 101, column: 28, scope: !141)
!144 = !DILocation(line: 101, column: 14, scope: !141)
!145 = !DILocation(line: 101, column: 73, scope: !141)
!146 = !DILocation(line: 101, column: 79, scope: !141)
!147 = !DILocation(line: 102, column: 30, scope: !141)
!148 = !DILocation(line: 101, column: 13, scope: !136)
!149 = !DILocation(line: 103, column: 16, scope: !150)
!150 = distinct !DILexicalBlock(scope: !141, file: !12, line: 102, column: 36)
!151 = !DILocation(line: 103, column: 20, scope: !150)
!152 = !DILocation(line: 103, column: 26, scope: !150)
!153 = !DILocation(line: 104, column: 9, scope: !150)
!154 = !DILocation(line: 105, column: 17, scope: !155)
