; ModuleID = 'crypt_cbc-k.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.mbedtls_des_context = type { [32 x i32] }
%struct.smack_value = type { i8* }
%struct.mbedtls_des3_context = type { [96 x i32] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@__const.crypt_cbc_wrapper_t.iv = private unnamed_addr constant <{ i8, [15 x i8] }> <{ i8 97, [15 x i8] zeroinitializer }>, align 16, !psr.id !0
@odd_parity_table = internal constant [128 x i8] c"\01\02\04\07\08\0B\0D\0E\10\13\15\16\19\1A\1C\1F #%&)*,/12478;=>@CEFIJLOQRTWX[]^abdghkmnpsuvyz|\7F\80\83\85\86\89\8A\8C\8F\91\92\94\97\98\9B\9D\9E\A1\A2\A4\A7\A8\AB\AD\AE\B0\B3\B5\B6\B9\BA\BC\BF\C1\C2\C4\C7\C8\CB\CD\CE\D0\D3\D5\D6\D9\DA\DC\DF\E0\E3\E5\E6\E9\EA\EC\EF\F1\F2\F4\F7\F8\FB\FD\FE", align 16, !dbg !1, !psr.id !73

!3258 = !DILocation(line: 1013, column: 13, scope: !3186)
!3259 = !{!"2014"}
!3260 = !DILocation(line: 1015, column: 13, scope: !3187)
!3261 = !{!"2015"}
!3262 = !{!"2016"}
!3263 = !{!"2017"}
!3264 = !{!"2018"}
!3265 = !DILocation(line: 976, column: 17, scope: !3068)
!3266 = !{!"2019"}
!3267 = !{!"2020"}
!3268 = !DILocation(line: 1018, column: 17, scope: !3269)
!3269 = distinct !DILexicalBlock(scope: !3021, file: !4, line: 1018, column: 13)
!3270 = !{!"2021"}
!3271 = !DILocation(line: 1018, column: 40, scope: !3269)
!3272 = !{!"2022"}
!3273 = !DILocation(line: 1019, column: 25, scope: !3269)
!3274 = !{!"2023"}
!3275 = !DILocation(line: 1019, column: 30, scope: !3269)
!3276 = !{!"2024"}
!3277 = !{!"2025"}
!3278 = !{!"2026"}
!3279 = !DILocation(line: 1019, column: 17, scope: !3269)
!3280 = !{!"2027"}
!3281 = !DILocation(line: 1019, column: 56, scope: !3269)
!3282 = !{!"2028"}
!3283 = !DILocation(line: 1019, column: 63, scope: !3269)
!3284 = !{!"2029"}
!3285 = !DILocation(line: 1020, column: 17, scope: !3269)
!3286 = !{!"2030"}
!3287 = !DILocation(line: 1020, column: 40, scope: !3269)
!3288 = !{!"2031"}
!3289 = !DILocation(line: 1021, column: 25, scope: !3269)
!3290 = !{!"2032"}
!3291 = !DILocation(line: 1021, column: 30, scope: !3269)
!3292 = !{!"2033"}
!3293 = !{!"2034"}
!3294 = !{!"2035"}
!3295 = !DILocation(line: 1021, column: 17, scope: !3269)
!3296 = !{!"2036"}
!3297 = !DILocation(line: 1021, column: 56, scope: !3269)
!3298 = !{!"2037"}
!3299 = !DILocation(line: 1018, column: 13, scope: !3021)
!3300 = !{!"2038"}
!3301 = !DILocation(line: 1023, column: 25, scope: !3302)
!3302 = distinct !DILexicalBlock(scope: !3303, file: !4, line: 1023, column: 17)
!3303 = distinct !DILexicalBlock(scope: !3269, file: !4, line: 1022, column: 9)
!3304 = !{!"2039"}
!3305 = !DILocation(line: 1023, column: 17, scope: !3303)
!3306 = !{!"2040"}
!3307 = !{!"2041"}
!3308 = !DILocation(line: 1024, column: 17, scope: !3302)
!3309 = !{!"2042"}
!3310 = !{!"2043"}
!3311 = !{!"2044"}
!3312 = !DILocation(line: 1027, column: 13, scope: !3303)
!3313 = !{!"2045"}
!3314 = !DILocation(line: 1030, column: 21, scope: !3315)
!3315 = distinct !DILexicalBlock(scope: !3021, file: !4, line: 1030, column: 13)
!3316 = !{!"2046"}
!3317 = !DILocation(line: 1030, column: 13, scope: !3021)
!3318 = !{!"2047"}
!3319 = !{!"2048"}
!3320 = !DILocation(line: 1031, column: 13, scope: !3315)
!3321 = !{!"2049"}
!3322 = !{!"2050"}
!3323 = !DILocation(line: 1032, column: 5, scope: !3021)
!3324 = !{!"2051"}
!3325 = !DILocation(line: 939, column: 25, scope: !3016)
!3326 = !{!"2052"}
!3327 = !{!"2053"}
!3328 = !DILocation(line: 939, column: 5, scope: !3016)
!3329 = distinct !{!3329, !3018, !3330, !338}
!3330 = !DILocation(line: 1032, column: 5, scope: !3008)
!3331 = !{!"2054"}
!3332 = !DILocation(line: 1035, column: 17, scope: !3333)
!3333 = distinct !DILexicalBlock(scope: !2738, file: !4, line: 1035, column: 9)
!3334 = !{!"2055"}
!3335 = !DILocation(line: 1035, column: 9, scope: !2738)
!3336 = !{!"2056"}
!3337 = !{!"2057"}
!3338 = !DILocation(line: 1036, column: 9, scope: !3333)
!3339 = !{!"2058"}
!3340 = !{!"2059"}
!3341 = !DILocation(line: 1035, column: 20, scope: !3333)
!3342 = !{!"2060"}
!3343 = !{!"2061"}
!3344 = !{!"2062"}
!3345 = !DILabel(scope: !2738, name: "exit", file: !4, line: 1038)
!3346 = !DILocation(line: 1038, column: 1, scope: !2738)
!3347 = !{!"2063"}
!3348 = !DILocation(line: 1039, column: 5, scope: !2738)
!3349 = !{!"2064"}
!3350 = !DILocation(line: 1040, column: 5, scope: !2738)
!3351 = !{!"2065"}
!3352 = !DILocation(line: 1042, column: 13, scope: !3353)
!3353 = distinct !DILexicalBlock(scope: !2738, file: !4, line: 1042, column: 9)
!3354 = !{!"2066"}
!3355 = !DILocation(line: 1042, column: 9, scope: !2738)
!3356 = !{!"2067"}
!3357 = !{!"2068"}
!3358 = !DILocation(line: 1043, column: 9, scope: !3353)
!3359 = !{!"2069"}
!3360 = !{!"2070"}
!3361 = !{!"2071"}
!3362 = !DILocation(line: 1044, column: 5, scope: !2738)
!3363 = !{!"2072"}
!3364 = !{!"2073"}
!3365 = !DILocation(line: 1045, column: 1, scope: !2738)
!3366 = !{!"2074"}
!3367 = distinct !DISubprogram(name: "mbedtls_platform_zeroize", scope: !102, file: !102, line: 67, type: !3368, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !101, retainedNodes: !5)
!3368 = !DISubroutineType(types: !3369)
!3369 = !{null, !7, !120}
!3370 = !DILocalVariable(name: "buf", arg: 1, scope: !3367, file: !102, line: 67, type: !7)
!3371 = !DILocation(line: 0, scope: !3367)
!3372 = !{!"2075"}
!3373 = !DILocalVariable(name: "len", arg: 2, scope: !3367, file: !102, line: 67, type: !120)
!3374 = !{!"2076"}
!3375 = !DILocation(line: 69, column: 5, scope: !3367)
!3376 = !{!"2077"}
!3377 = !DILocation(line: 69, column: 5, scope: !3378)
!3378 = distinct !DILexicalBlock(scope: !3367, file: !102, line: 69, column: 5)
!3379 = !{!"2078"}
!3380 = !DILocation(line: 71, column: 13, scope: !3381)
!3381 = distinct !DILexicalBlock(scope: !3367, file: !102, line: 71, column: 9)
!3382 = !{!"2079"}
!3383 = !DILocation(line: 71, column: 9, scope: !3367)
!3384 = !{!"2080"}
!3385 = !DILocation(line: 72, column: 9, scope: !3381)
!3386 = !{!"2081"}
!3387 = !{!"2082"}
!3388 = !DILocation(line: 75, column: 1, scope: !3367)
!3389 = !{!"2083"}
!3390 = distinct !DISubprogram(name: "mbedtls_platform_gmtime_r", scope: !102, file: !102, line: 107, type: !3391, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !101, retainedNodes: !5)
!3391 = !DISubroutineType(types: !3392)
!3392 = !{!3393, !3412, !3393}
!3393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3394, size: 64)
!3394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !3395, line: 7, size: 448, elements: !3396)
!3395 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!3396 = !{!3397, !3398, !3399, !3400, !3401, !3402, !3403, !3404, !3405, !3406, !3408}
!3397 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !3394, file: !3395, line: 9, baseType: !119, size: 32)
!3398 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !3394, file: !3395, line: 10, baseType: !119, size: 32, offset: 32)
!3399 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !3394, file: !3395, line: 11, baseType: !119, size: 32, offset: 64)
!3400 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !3394, file: !3395, line: 12, baseType: !119, size: 32, offset: 96)
!3401 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !3394, file: !3395, line: 13, baseType: !119, size: 32, offset: 128)
!3402 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !3394, file: !3395, line: 14, baseType: !119, size: 32, offset: 160)
!3403 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !3394, file: !3395, line: 15, baseType: !119, size: 32, offset: 192)
!3404 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !3394, file: !3395, line: 16, baseType: !119, size: 32, offset: 224)
!3405 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !3394, file: !3395, line: 17, baseType: !119, size: 32, offset: 256)
!3406 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !3394, file: !3395, line: 23, baseType: !3407, size: 64, offset: 320)
!3407 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!3408 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !3394, file: !3395, line: 24, baseType: !3409, size: 64, offset: 384)
!3409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3410, size: 64)
!3410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3411)
!3411 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!3412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3413, size: 64)
!3413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !3414)
!3414 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbedtls_time_t", file: !3415, line: 39, baseType: !3416)
!3415 = !DIFile(filename: "../mbedtls/include/mbedtls/platform_time.h", directory: "/home/luwei/bech-back/Mbed-tls/DES")
!3416 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !3417, line: 7, baseType: !3418)
!3417 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!3418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !11, line: 160, baseType: !3407)
!3419 = !DILocalVariable(name: "tt", arg: 1, scope: !3390, file: !102, line: 107, type: !3412)
!3420 = !DILocation(line: 0, scope: !3390)
!3421 = !{!"2084"}
!3422 = !DILocalVariable(name: "tm_buf", arg: 2, scope: !3390, file: !102, line: 108, type: !3393)
!3423 = !{!"2085"}
!3424 = !DILocation(line: 118, column: 13, scope: !3390)
!3425 = !{!"2086"}
!3426 = !DILocation(line: 118, column: 5, scope: !3390)
!3427 = !{!"2087"}
!3428 = distinct !DISubprogram(name: "mbedtls_xor", scope: !3429, file: !3429, line: 123, type: !3430, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !101, retainedNodes: !5)
!3429 = !DIFile(filename: "../mbedtls/library/common.h", directory: "/home/luwei/bech-back/Mbed-tls/DES")
!3430 = !DISubroutineType(types: !3431)
!3431 = !{null, !123, !124, !124, !120}
!3432 = !DILocalVariable(name: "r", arg: 1, scope: !3428, file: !3429, line: 123, type: !123)
!3433 = !DILocation(line: 0, scope: !3428)
!3434 = !{!"2088"}
!3435 = !DILocalVariable(name: "a", arg: 2, scope: !3428, file: !3429, line: 123, type: !124)
!3436 = !{!"2089"}
!3437 = !DILocalVariable(name: "b", arg: 3, scope: !3428, file: !3429, line: 123, type: !124)
!3438 = !{!"2090"}
!3439 = !DILocalVariable(name: "n", arg: 4, scope: !3428, file: !3429, line: 123, type: !120)
!3440 = !{!"2091"}
!3441 = !DILocalVariable(name: "i", scope: !3428, file: !3429, line: 125, type: !120)
!3442 = !{!"2092"}
!3443 = !DILocation(line: 126, column: 11, scope: !3444)
!3444 = distinct !DILexicalBlock(scope: !3428, file: !3429, line: 126, column: 5)
!3445 = !{!"2093"}
!3446 = !DILocation(line: 0, scope: !3444)
!3447 = !{!"2094"}
!3448 = !{!"2095"}
!3449 = !DILocation(line: 126, column: 22, scope: !3450)
!3450 = distinct !DILexicalBlock(scope: !3444, file: !3429, line: 126, column: 5)
!3451 = !{!"2096"}
!3452 = !DILocation(line: 126, column: 28, scope: !3450)
!3453 = !{!"2097"}
!3454 = !DILocation(line: 126, column: 5, scope: !3444)
!3455 = !{!"2098"}
!3456 = !DILocation(line: 128, column: 54, scope: !3457)
!3457 = distinct !DILexicalBlock(scope: !3450, file: !3429, line: 127, column: 5)
!3458 = !{!"2099"}
!3459 = !DILocation(line: 128, column: 22, scope: !3457)
!3460 = !{!"2100"}
!3461 = !DILocation(line: 128, column: 94, scope: !3457)
!3462 = !{!"2101"}
!3463 = !DILocation(line: 128, column: 62, scope: !3457)
!3464 = !{!"2102"}
!3465 = !DILocation(line: 128, column: 60, scope: !3457)
!3466 = !{!"2103"}
!3467 = !DILocalVariable(name: "x", scope: !3457, file: !3429, line: 128, type: !8)
!3468 = !DILocation(line: 0, scope: !3457)
!3469 = !{!"2104"}
!3470 = !DILocation(line: 129, column: 41, scope: !3457)
!3471 = !{!"2105"}
!3472 = !DILocation(line: 129, column: 9, scope: !3457)
!3473 = !{!"2106"}
!3474 = !DILocation(line: 130, column: 5, scope: !3457)
!3475 = !{!"2107"}
!3476 = !DILocation(line: 126, column: 36, scope: !3450)
!3477 = !{!"2108"}
!3478 = !{!"2109"}
!3479 = !DILocation(line: 126, column: 5, scope: !3450)
!3480 = distinct !{!3480, !3454, !3481, !338}
