; ModuleID = 'crypt_cbc.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.mbedtls_des_context = type { [32 x i32] }
%struct.smack_value = type { i8* }
%struct.mbedtls_des3_context = type { [96 x i32] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@__const.crypt_cbc_wrapper_t.iv = private unnamed_addr constant <{ i8, [15 x i8] }> <{ i8 97, [15 x i8] zeroinitializer }>, align 16
@odd_parity_table = internal constant [128 x i8] c"\01\02\04\07\08\0B\0D\0E\10\13\15\16\19\1A\1C\1F #%&)*,/12478;=>@CEFIJLOQRTWX[]^abdghkmnpsuvyz|\7F\80\83\85\86\89\8A\8C\8F\91\92\94\97\98\9B\9D\9E\A1\A2\A4\A7\A8\AB\AD\AE\B0\B3\B5\B6\B9\BA\BC\BF\C1\C2\C4\C7\C8\CB\CD\CE\D0\D3\D5\D6\D9\DA\DC\DF\E0\E3\E5\E6\E9\EA\EC\EF\F1\F2\F4\F7\F8\FB\FD\FE", align 16, !dbg !0

!1226 = distinct !DILexicalBlock(scope: !1223, file: !3, line: 1003, column: 21)
!1227 = !DILocation(line: 1003, column: 21, scope: !1223)
!1228 = !DILocation(line: 1004, column: 62, scope: !1226)
!1229 = !DILocation(line: 1004, column: 66, scope: !1226)
!1230 = !DILocation(line: 1004, column: 71, scope: !1226)
!1231 = !DILocation(line: 1004, column: 27, scope: !1226)
!1232 = !DILocation(line: 1004, column: 21, scope: !1226)
!1233 = !DILocation(line: 1006, column: 64, scope: !1226)
!1234 = !DILocation(line: 1006, column: 68, scope: !1226)
!1235 = !DILocation(line: 1006, column: 73, scope: !1226)
!1236 = !DILocation(line: 1006, column: 27, scope: !1226)
!1237 = !DILocation(line: 0, scope: !1226)
!1238 = !DILocation(line: 1007, column: 25, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1223, file: !3, line: 1007, column: 21)
!1240 = !DILocation(line: 1007, column: 21, scope: !1223)
!1241 = !DILocation(line: 1008, column: 21, scope: !1239)
!1242 = !DILocation(line: 1010, column: 17, scope: !1223)
!1243 = !DILocation(line: 1011, column: 17, scope: !1223)
!1244 = !DILocation(line: 1012, column: 17, scope: !1223)
!1245 = !DILocation(line: 1013, column: 13, scope: !1223)
!1246 = !DILocation(line: 999, column: 35, scope: !1220)
!1247 = !DILocation(line: 999, column: 13, scope: !1220)
!1248 = distinct !{!1248, !1221, !1249, !225}
!1249 = !DILocation(line: 1013, column: 13, scope: !1216)
!1250 = !DILocation(line: 1015, column: 13, scope: !1217)
!1251 = !DILocation(line: 976, column: 17, scope: !1162)
!1252 = !DILocation(line: 1018, column: 17, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 1018, column: 13)
!1254 = !DILocation(line: 1018, column: 40, scope: !1253)
!1255 = !DILocation(line: 1019, column: 25, scope: !1253)
!1256 = !DILocation(line: 1019, column: 30, scope: !1253)
!1257 = !DILocation(line: 1019, column: 17, scope: !1253)
!1258 = !DILocation(line: 1019, column: 56, scope: !1253)
!1259 = !DILocation(line: 1019, column: 63, scope: !1253)
!1260 = !DILocation(line: 1020, column: 17, scope: !1253)
!1261 = !DILocation(line: 1020, column: 40, scope: !1253)
!1262 = !DILocation(line: 1021, column: 25, scope: !1253)
!1263 = !DILocation(line: 1021, column: 30, scope: !1253)
!1264 = !DILocation(line: 1021, column: 17, scope: !1253)
!1265 = !DILocation(line: 1021, column: 56, scope: !1253)
!1266 = !DILocation(line: 1018, column: 13, scope: !1145)
!1267 = !DILocation(line: 1023, column: 25, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1269, file: !3, line: 1023, column: 17)
!1269 = distinct !DILexicalBlock(scope: !1253, file: !3, line: 1022, column: 9)
!1270 = !DILocation(line: 1023, column: 17, scope: !1269)
!1271 = !DILocation(line: 1024, column: 17, scope: !1268)
!1272 = !DILocation(line: 1027, column: 13, scope: !1269)
!1273 = !DILocation(line: 1030, column: 21, scope: !1274)
!1274 = distinct !DILexicalBlock(scope: !1145, file: !3, line: 1030, column: 13)
!1275 = !DILocation(line: 1030, column: 13, scope: !1145)
!1276 = !DILocation(line: 1031, column: 13, scope: !1274)
!1277 = !DILocation(line: 1032, column: 5, scope: !1145)
!1278 = !DILocation(line: 939, column: 25, scope: !1142)
!1279 = !DILocation(line: 939, column: 5, scope: !1142)
!1280 = distinct !{!1280, !1143, !1281, !225}
!1281 = !DILocation(line: 1032, column: 5, scope: !1139)
!1282 = !DILocation(line: 1035, column: 17, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 1035, column: 9)
!1284 = !DILocation(line: 1035, column: 9, scope: !1014)
!1285 = !DILocation(line: 1036, column: 9, scope: !1283)
!1286 = !DILocation(line: 1035, column: 20, scope: !1283)
!1287 = !DILabel(scope: !1014, name: "exit", file: !3, line: 1038)
!1288 = !DILocation(line: 1038, column: 1, scope: !1014)
!1289 = !DILocation(line: 1039, column: 5, scope: !1014)
!1290 = !DILocation(line: 1040, column: 5, scope: !1014)
!1291 = !DILocation(line: 1042, column: 13, scope: !1292)
!1292 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 1042, column: 9)
!1293 = !DILocation(line: 1042, column: 9, scope: !1014)
!1294 = !DILocation(line: 1043, column: 9, scope: !1292)
!1295 = !DILocation(line: 1044, column: 5, scope: !1014)
!1296 = !DILocation(line: 1045, column: 1, scope: !1014)
!1297 = distinct !DISubprogram(name: "mbedtls_platform_zeroize", scope: !75, file: !75, line: 67, type: !1298, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !74, retainedNodes: !4)
!1298 = !DISubroutineType(types: !1299)
!1299 = !{null, !6, !83}
!1300 = !DILocalVariable(name: "buf", arg: 1, scope: !1297, file: !75, line: 67, type: !6)
!1301 = !DILocation(line: 0, scope: !1297)
!1302 = !DILocalVariable(name: "len", arg: 2, scope: !1297, file: !75, line: 67, type: !83)
!1303 = !DILocation(line: 69, column: 5, scope: !1297)
!1304 = !DILocation(line: 69, column: 5, scope: !1305)
!1305 = distinct !DILexicalBlock(scope: !1297, file: !75, line: 69, column: 5)
!1306 = !DILocation(line: 71, column: 13, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !1297, file: !75, line: 71, column: 9)
!1308 = !DILocation(line: 71, column: 9, scope: !1297)
!1309 = !DILocation(line: 72, column: 9, scope: !1307)
!1310 = !DILocation(line: 73, column: 1, scope: !1297)
!1311 = distinct !DISubprogram(name: "mbedtls_platform_gmtime_r", scope: !75, file: !75, line: 105, type: !1312, scopeLine: 107, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !74, retainedNodes: !4)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!1314, !1333, !1314}
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !1316, line: 7, size: 448, elements: !1317)
!1316 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!1317 = !{!1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1329}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !1315, file: !1316, line: 9, baseType: !82, size: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !1315, file: !1316, line: 10, baseType: !82, size: 32, offset: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !1315, file: !1316, line: 11, baseType: !82, size: 32, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !1315, file: !1316, line: 12, baseType: !82, size: 32, offset: 96)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !1315, file: !1316, line: 13, baseType: !82, size: 32, offset: 128)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !1315, file: !1316, line: 14, baseType: !82, size: 32, offset: 160)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !1315, file: !1316, line: 15, baseType: !82, size: 32, offset: 192)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !1315, file: !1316, line: 16, baseType: !82, size: 32, offset: 224)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !1315, file: !1316, line: 17, baseType: !82, size: 32, offset: 256)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !1315, file: !1316, line: 23, baseType: !1328, size: 64, offset: 320)
!1328 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !1315, file: !1316, line: 24, baseType: !1330, size: 64, offset: 384)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1332)
!1332 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1335)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbedtls_time_t", file: !1336, line: 39, baseType: !1337)
!1336 = !DIFile(filename: "../mbedtls/include/mbedtls/platform_time.h", directory: "/home/luwei/bech/Mbed/des")
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1338, line: 7, baseType: !1339)
!1338 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!1339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !10, line: 160, baseType: !1328)
!1340 = !DILocalVariable(name: "tt", arg: 1, scope: !1311, file: !75, line: 105, type: !1333)
!1341 = !DILocation(line: 0, scope: !1311)
!1342 = !DILocalVariable(name: "tm_buf", arg: 2, scope: !1311, file: !75, line: 106, type: !1314)
!1343 = !DILocation(line: 116, column: 13, scope: !1311)
!1344 = !DILocation(line: 116, column: 5, scope: !1311)
!1345 = distinct !DISubprogram(name: "mbedtls_xor", scope: !1346, file: !1346, line: 123, type: !1347, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !74, retainedNodes: !4)
!1346 = !DIFile(filename: "../mbedtls/library/common.h", directory: "/home/luwei/bech/Mbed/des")
!1347 = !DISubroutineType(types: !1348)
!1348 = !{null, !104, !105, !105, !83}
!1349 = !DILocalVariable(name: "r", arg: 1, scope: !1345, file: !1346, line: 123, type: !104)
!1350 = !DILocation(line: 0, scope: !1345)
!1351 = !DILocalVariable(name: "a", arg: 2, scope: !1345, file: !1346, line: 123, type: !105)
!1352 = !DILocalVariable(name: "b", arg: 3, scope: !1345, file: !1346, line: 123, type: !105)
!1353 = !DILocalVariable(name: "n", arg: 4, scope: !1345, file: !1346, line: 123, type: !83)
!1354 = !DILocalVariable(name: "i", scope: !1345, file: !1346, line: 125, type: !83)
!1355 = !DILocation(line: 126, column: 11, scope: !1356)
!1356 = distinct !DILexicalBlock(scope: !1345, file: !1346, line: 126, column: 5)
!1357 = !DILocation(line: 0, scope: !1356)
!1358 = !DILocation(line: 126, column: 22, scope: !1359)
!1359 = distinct !DILexicalBlock(scope: !1356, file: !1346, line: 126, column: 5)
!1360 = !DILocation(line: 126, column: 28, scope: !1359)
!1361 = !DILocation(line: 126, column: 5, scope: !1356)
!1362 = !DILocation(line: 128, column: 54, scope: !1363)
!1363 = distinct !DILexicalBlock(scope: !1359, file: !1346, line: 127, column: 5)
!1364 = !DILocation(line: 128, column: 22, scope: !1363)
!1365 = !DILocation(line: 128, column: 94, scope: !1363)
!1366 = !DILocation(line: 128, column: 62, scope: !1363)
!1367 = !DILocation(line: 128, column: 60, scope: !1363)
!1368 = !DILocalVariable(name: "x", scope: !1363, file: !1346, line: 128, type: !7)
!1369 = !DILocation(line: 0, scope: !1363)
!1370 = !DILocation(line: 129, column: 41, scope: !1363)
!1371 = !DILocation(line: 129, column: 9, scope: !1363)
!1372 = !DILocation(line: 130, column: 5, scope: !1363)
!1373 = !DILocation(line: 126, column: 36, scope: !1359)
!1374 = !DILocation(line: 126, column: 5, scope: !1359)
!1375 = distinct !{!1375, !1361, !1376, !225}
!1376 = !DILocation(line: 130, column: 5, scope: !1356)
!1377 = !DILocation(line: 131, column: 5, scope: !1345)
!1378 = !DILocation(line: 131, column: 15, scope: !1379)
!1379 = distinct !DILexicalBlock(scope: !1380, file: !1346, line: 131, column: 5)
!1380 = distinct !DILexicalBlock(scope: !1345, file: !1346, line: 131, column: 5)
!1381 = !DILocation(line: 131, column: 5, scope: !1380)
!1382 = !DILocation(line: 133, column: 16, scope: !1383)
!1383 = distinct !DILexicalBlock(scope: !1379, file: !1346, line: 132, column: 5)
