; ModuleID = 'api_mul.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.br_ec_impl = type { i32, i8* (i32, i64*)*, i8* (i32, i64*)*, i64 (i32, i64*)*, i32 (i8*, i64, i8*, i64, i32)*, i64 (i8*, i8*, i64, i32)*, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* }
%struct.smack_value = type { i8* }
%struct.p256_jacobian = type { [20 x i32], [20 x i32], [20 x i32] }

@br_ec_p256_m15 = dso_local constant %struct.br_ec_impl { i32 8388608, i8* (i32, i64*)* @api_generator, i8* (i32, i64*)* @api_order, i64 (i32, i64*)* @api_xoff, i32 (i8*, i64, i8*, i64, i32)* @api_mul, i64 (i8*, i8*, i64, i32)* @api_mulgen, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* @api_muladd }, align 8, !dbg !0
@F256 = internal constant [20 x i32] [i32 8191, i32 8191, i32 8191, i32 8191, i32 8191, i32 8191, i32 8191, i32 31, i32 0, i32 0, i32 0, i32 0, i32 0, i32 0, i32 1024, i32 0, i32 0, i32 8184, i32 8191, i32 511], align 16, !dbg !30

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "br_ec_p256_m15", scope: !2, file: !3, line: 2116, type: !43, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !18, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../BearSSL/src/ec/ec_p256_m15.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m15")
!4 = !{}
!5 = !{!6, !11, !16, !17}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !7, line: 26, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !9, line: 42, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !13, line: 26, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !9, line: 41, baseType: !15)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!18 = !{!0, !19, !25, !30, !36, !38}
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "P256_G", scope: !2, file: !3, line: 1993, type: !21, isLocal: true, isDefinition: true)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 520, elements: !23)
!22 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !16)
!23 = !{!24}
!24 = !DISubrange(count: 65)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "P256_N", scope: !2, file: !3, line: 2003, type: !27, isLocal: true, isDefinition: true)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 256, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 32)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "F256", scope: !2, file: !3, line: 992, type: !32, isLocal: true, isDefinition: true)
!32 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 640, elements: !34)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!34 = !{!35}
!35 = !DISubrange(count: 20)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "P256_B", scope: !2, file: !3, line: 1001, type: !32, isLocal: true, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "Gwin", scope: !2, file: !3, line: 1823, type: !40, isLocal: true, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 9600, elements: !41)
!41 = !{!42, !35}
!42 = !DISubrange(count: 15)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !45, line: 415, baseType: !46)
!45 = !DIFile(filename: "../BearSSL/inc/bearssl_ec.h", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m15")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 270, size: 448, elements: !47)
!47 = !{!48, !49, !58, !59, !63, !68, !72}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !46, file: !45, line: 279, baseType: !6, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !46, file: !45, line: 292, baseType: !50, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !15, !54}
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !46, file: !45, line: 306, baseType: !50, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !46, file: !45, line: 318, baseType: !60, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!55, !15, !54}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !46, file: !45, line: 350, baseType: !64, size: 64, offset: 256)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!6, !67, !55, !53, !55, !15}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !46, file: !45, line: 366, baseType: !69, size: 64, offset: 320)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!55, !67, !53, !55, !15}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !46, file: !45, line: 412, baseType: !73, size: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DISubroutineType(types: !75)
!75 = !{!6, !67, !53, !55, !53, !55, !53, !55, !15}
!76 = distinct !DICompileUnit(language: DW_LANG_C99, file: !77, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!77 = !DIFile(filename: "api_mul.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m15")
!78 = distinct !DICompileUnit(language: DW_LANG_C99, file: !79, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!79 = !DIFile(filename: "../BearSSL/src/codec/ccopy.c", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m15")
!80 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!81 = !{i32 7, !"Dwarf Version", i32 4}
!82 = !{i32 2, !"Debug Info Version", i32 3}
!83 = !{i32 1, !"wchar_size", i32 4}
!84 = distinct !DISubprogram(name: "api_mul_wrapper", scope: !77, file: !77, line: 7, type: !85, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !76, retainedNodes: !4)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !67, !55, !53, !55, !15}
!87 = !DILocalVariable(name: "G", arg: 1, scope: !84, file: !77, line: 7, type: !67)
!88 = !DILocation(line: 0, scope: !84)
!89 = !DILocalVariable(name: "Glen", arg: 2, scope: !84, file: !77, line: 7, type: !55)
!90 = !DILocalVariable(name: "kb", arg: 3, scope: !84, file: !77, line: 8, type: !53)
!91 = !DILocalVariable(name: "kblen", arg: 4, scope: !84, file: !77, line: 8, type: !55)
!92 = !DILocalVariable(name: "curve", arg: 5, scope: !84, file: !77, line: 8, type: !15)
!93 = !DILocation(line: 9, column: 12, scope: !84)
!94 = !DILocation(line: 9, column: 2, scope: !84)
!95 = !DILocation(line: 10, column: 12, scope: !84)
!96 = !DILocation(line: 10, column: 2, scope: !84)
!97 = !DILocation(line: 11, column: 12, scope: !84)
!98 = !DILocation(line: 11, column: 2, scope: !84)
!99 = !DILocation(line: 12, column: 12, scope: !84)
!100 = !DILocation(line: 12, column: 2, scope: !84)
!101 = !DILocation(line: 13, column: 12, scope: !84)
!102 = !DILocation(line: 13, column: 2, scope: !84)
!103 = !DILocation(line: 15, column: 12, scope: !84)
!104 = !DILocation(line: 15, column: 2, scope: !84)
!105 = !DILocalVariable(name: "iec", scope: !84, file: !77, line: 16, type: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !45, line: 415, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 270, size: 448, elements: !110)
!110 = !{!111, !112, !113, !114, !115, !116, !117}
!111 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !109, file: !45, line: 279, baseType: !6, size: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !109, file: !45, line: 292, baseType: !50, size: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !109, file: !45, line: 306, baseType: !50, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !109, file: !45, line: 318, baseType: !60, size: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !109, file: !45, line: 350, baseType: !64, size: 64, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !109, file: !45, line: 366, baseType: !69, size: 64, offset: 320)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !109, file: !45, line: 412, baseType: !73, size: 64, offset: 384)
!118 = !DILocation(line: 18, column: 7, scope: !84)
!119 = !DILocation(line: 18, column: 2, scope: !84)
!120 = !DILocation(line: 19, column: 1, scope: !84)
!121 = distinct !DISubprogram(name: "api_mul_wrapper_t", scope: !77, file: !77, line: 30, type: !122, scopeLine: 30, spFlags: DISPFlagDefinition, unit: !76, retainedNodes: !4)
!122 = !DISubroutineType(types: !123)
!123 = !{null}
!124 = !DILocation(line: 32, column: 21, scope: !121)
!125 = !DILocalVariable(name: "G", scope: !121, file: !77, line: 32, type: !67)
!126 = !DILocation(line: 0, scope: !121)
!127 = !DILocation(line: 33, column: 17, scope: !121)
!128 = !DILocalVariable(name: "Glen", scope: !121, file: !77, line: 33, type: !55)
!129 = !DILocation(line: 34, column: 28, scope: !121)
!130 = !DILocalVariable(name: "kb", scope: !121, file: !77, line: 34, type: !53)
!131 = !DILocation(line: 35, column: 18, scope: !121)
!132 = !DILocalVariable(name: "kblen", scope: !121, file: !77, line: 35, type: !55)
!133 = !DILocalVariable(name: "curve", scope: !121, file: !77, line: 36, type: !15)
!134 = !DILocalVariable(name: "iec", scope: !121, file: !77, line: 38, type: !106)
!135 = !DILocation(line: 40, column: 7, scope: !121)
!136 = !DILocation(line: 40, column: 2, scope: !121)
!137 = !DILocation(line: 41, column: 1, scope: !121)
!138 = distinct !DISubprogram(name: "br_ccopy", scope: !79, file: !79, line: 29, type: !139, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !78, retainedNodes: !4)
!139 = !DISubroutineType(types: !140)
!140 = !{null, !6, !17, !141, !55}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!143 = !DILocalVariable(name: "ctl", arg: 1, scope: !138, file: !79, line: 29, type: !6)
!144 = !DILocation(line: 0, scope: !138)
!145 = !DILocalVariable(name: "dst", arg: 2, scope: !138, file: !79, line: 29, type: !17)
!146 = !DILocalVariable(name: "src", arg: 3, scope: !138, file: !79, line: 29, type: !141)
!147 = !DILocalVariable(name: "len", arg: 4, scope: !138, file: !79, line: 29, type: !55)
!148 = !DILocalVariable(name: "d", scope: !138, file: !79, line: 31, type: !67)
!149 = !DILocalVariable(name: "s", scope: !138, file: !79, line: 32, type: !53)
!150 = !DILocation(line: 36, column: 2, scope: !138)
!151 = !DILocation(line: 36, column: 13, scope: !138)
!152 = !DILocation(line: 36, column: 16, scope: !138)
!153 = !DILocation(line: 39, column: 10, scope: !154)
!154 = distinct !DILexicalBlock(scope: !138, file: !79, line: 36, column: 21)
!155 = !DILocation(line: 39, column: 7, scope: !154)
!156 = !DILocalVariable(name: "x", scope: !154, file: !79, line: 37, type: !6)
!157 = !DILocation(line: 0, scope: !154)
!158 = !DILocation(line: 40, column: 7, scope: !154)
!159 = !DILocalVariable(name: "y", scope: !154, file: !79, line: 37, type: !6)
!160 = !DILocation(line: 41, column: 8, scope: !154)
!161 = !DILocation(line: 41, column: 6, scope: !154)
!162 = !DILocation(line: 42, column: 5, scope: !154)
!163 = distinct !{!163, !150, !164, !165}
!164 = !DILocation(line: 43, column: 2, scope: !138)
!165 = !{!"llvm.loop.mustprogress"}
!166 = !DILocation(line: 44, column: 1, scope: !138)
!167 = distinct !DISubprogram(name: "MUX", scope: !168, file: !168, line: 770, type: !169, scopeLine: 771, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !78, retainedNodes: !4)
!168 = !DIFile(filename: "../BearSSL/src/inner.h", directory: "/home/luwei/bech-back/BearSSL/EC_p256_m15")
!169 = !DISubroutineType(types: !170)
!170 = !{!6, !6, !6, !6}
!171 = !DILocalVariable(name: "ctl", arg: 1, scope: !167, file: !168, line: 770, type: !6)
!172 = !DILocation(line: 0, scope: !167)
!173 = !DILocalVariable(name: "x", arg: 2, scope: !167, file: !168, line: 770, type: !6)
!174 = !DILocalVariable(name: "y", arg: 3, scope: !167, file: !168, line: 770, type: !6)
!175 = !DILocation(line: 772, column: 14, scope: !167)
!176 = !DILocation(line: 772, column: 24, scope: !167)
!177 = !DILocation(line: 772, column: 19, scope: !167)
!178 = !DILocation(line: 772, column: 11, scope: !167)
!179 = !DILocation(line: 772, column: 2, scope: !167)
!180 = distinct !DISubprogram(name: "api_generator", scope: !3, file: !3, line: 2011, type: !51, scopeLine: 2012, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!181 = !DILocalVariable(name: "curve", arg: 1, scope: !180, file: !3, line: 2011, type: !15)
!182 = !DILocation(line: 0, scope: !180)
!183 = !DILocalVariable(name: "len", arg: 2, scope: !180, file: !3, line: 2011, type: !54)
!184 = !DILocation(line: 2014, column: 7, scope: !180)
!185 = !DILocation(line: 2015, column: 2, scope: !180)
!186 = distinct !DISubprogram(name: "api_order", scope: !3, file: !3, line: 2019, type: !51, scopeLine: 2020, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!187 = !DILocalVariable(name: "curve", arg: 1, scope: !186, file: !3, line: 2019, type: !15)
!188 = !DILocation(line: 0, scope: !186)
!189 = !DILocalVariable(name: "len", arg: 2, scope: !186, file: !3, line: 2019, type: !54)
!190 = !DILocation(line: 2022, column: 7, scope: !186)
!191 = !DILocation(line: 2023, column: 2, scope: !186)
!192 = distinct !DISubprogram(name: "api_xoff", scope: !3, file: !3, line: 2027, type: !61, scopeLine: 2028, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!193 = !DILocalVariable(name: "curve", arg: 1, scope: !192, file: !3, line: 2027, type: !15)
!194 = !DILocation(line: 0, scope: !192)
!195 = !DILocalVariable(name: "len", arg: 2, scope: !192, file: !3, line: 2027, type: !54)
!196 = !DILocation(line: 2030, column: 7, scope: !192)
!197 = !DILocation(line: 2031, column: 2, scope: !192)
!198 = distinct !DISubprogram(name: "api_mul", scope: !3, file: !3, line: 2035, type: !65, scopeLine: 2037, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!199 = !DILocalVariable(name: "G", arg: 1, scope: !198, file: !3, line: 2035, type: !67)
!200 = !DILocation(line: 0, scope: !198)
!201 = !DILocalVariable(name: "Glen", arg: 2, scope: !198, file: !3, line: 2035, type: !55)
!202 = !DILocalVariable(name: "x", arg: 3, scope: !198, file: !3, line: 2036, type: !53)
!203 = !DILocalVariable(name: "xlen", arg: 4, scope: !198, file: !3, line: 2036, type: !55)
!204 = !DILocalVariable(name: "curve", arg: 5, scope: !198, file: !3, line: 2036, type: !15)
!205 = !DILocalVariable(name: "P", scope: !198, file: !3, line: 2039, type: !206)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "p256_jacobian", file: !3, line: 1249, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 1245, size: 1920, elements: !208)
!208 = !{!209, !211, !212}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !207, file: !3, line: 1246, baseType: !210, size: 640)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 640, elements: !34)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !207, file: !3, line: 1247, baseType: !210, size: 640, offset: 640)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !207, file: !3, line: 1248, baseType: !210, size: 640, offset: 1280)
!213 = !DILocation(line: 2039, column: 16, scope: !198)
!214 = !DILocation(line: 2042, column: 11, scope: !215)
!215 = distinct !DILexicalBlock(scope: !198, file: !3, line: 2042, column: 6)
!216 = !DILocation(line: 2042, column: 6, scope: !198)
!217 = !DILocation(line: 2043, column: 3, scope: !218)
!218 = distinct !DILexicalBlock(scope: !215, file: !3, line: 2042, column: 18)
!219 = !DILocation(line: 2045, column: 6, scope: !198)
!220 = !DILocalVariable(name: "r", scope: !198, file: !3, line: 2038, type: !6)
!221 = !DILocation(line: 2046, column: 2, scope: !198)
!222 = !DILocation(line: 2047, column: 2, scope: !198)
!223 = !DILocation(line: 2048, column: 2, scope: !198)
!224 = !DILocation(line: 2049, column: 2, scope: !198)
!225 = !DILocation(line: 2050, column: 1, scope: !198)
!226 = distinct !DISubprogram(name: "api_mulgen", scope: !3, file: !3, line: 2053, type: !70, scopeLine: 2055, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!227 = !DILocalVariable(name: "R", arg: 1, scope: !226, file: !3, line: 2053, type: !67)
!228 = !DILocation(line: 0, scope: !226)
!229 = !DILocalVariable(name: "x", arg: 2, scope: !226, file: !3, line: 2054, type: !53)
!230 = !DILocalVariable(name: "xlen", arg: 3, scope: !226, file: !3, line: 2054, type: !55)
!231 = !DILocalVariable(name: "curve", arg: 4, scope: !226, file: !3, line: 2054, type: !15)
!232 = !DILocalVariable(name: "P", scope: !226, file: !3, line: 2056, type: !206)
!233 = !DILocation(line: 2056, column: 16, scope: !226)
!234 = !DILocation(line: 2059, column: 2, scope: !226)
!235 = !DILocation(line: 2060, column: 2, scope: !226)
!236 = !DILocation(line: 2061, column: 2, scope: !226)
!237 = !DILocation(line: 2062, column: 2, scope: !226)
!238 = distinct !DISubprogram(name: "api_muladd", scope: !3, file: !3, line: 2066, type: !74, scopeLine: 2069, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!239 = !DILocalVariable(name: "A", arg: 1, scope: !238, file: !3, line: 2066, type: !67)
!240 = !DILocation(line: 0, scope: !238)
!241 = !DILocalVariable(name: "B", arg: 2, scope: !238, file: !3, line: 2066, type: !53)
!242 = !DILocalVariable(name: "len", arg: 3, scope: !238, file: !3, line: 2066, type: !55)
!243 = !DILocalVariable(name: "x", arg: 4, scope: !238, file: !3, line: 2067, type: !53)
!244 = !DILocalVariable(name: "xlen", arg: 5, scope: !238, file: !3, line: 2067, type: !55)
!245 = !DILocalVariable(name: "y", arg: 6, scope: !238, file: !3, line: 2068, type: !53)
!246 = !DILocalVariable(name: "ylen", arg: 7, scope: !238, file: !3, line: 2068, type: !55)
!247 = !DILocalVariable(name: "curve", arg: 8, scope: !238, file: !3, line: 2068, type: !15)
!248 = !DILocalVariable(name: "P", scope: !238, file: !3, line: 2070, type: !206)
!249 = !DILocation(line: 2070, column: 16, scope: !238)
!250 = !DILocalVariable(name: "Q", scope: !238, file: !3, line: 2070, type: !206)
!251 = !DILocation(line: 2070, column: 19, scope: !238)
!252 = !DILocation(line: 2075, column: 10, scope: !253)
!253 = distinct !DILexicalBlock(scope: !238, file: !3, line: 2075, column: 6)
!254 = !DILocation(line: 2075, column: 6, scope: !238)
!255 = !DILocation(line: 2076, column: 3, scope: !256)
!256 = distinct !DILexicalBlock(scope: !253, file: !3, line: 2075, column: 17)
!257 = !DILocation(line: 2078, column: 6, scope: !238)
!258 = !DILocalVariable(name: "r", scope: !238, file: !3, line: 2071, type: !6)
!259 = !DILocation(line: 2079, column: 2, scope: !238)
!260 = !DILocation(line: 2080, column: 8, scope: !261)
!261 = distinct !DILexicalBlock(scope: !238, file: !3, line: 2080, column: 6)
!262 = !DILocation(line: 2080, column: 6, scope: !238)
!263 = !DILocation(line: 2081, column: 3, scope: !264)
!264 = distinct !DILexicalBlock(scope: !261, file: !3, line: 2080, column: 17)
