; ModuleID = 'arcfour.bc'
source_filename = "arcfour.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.gcry_cipher_spec = type { i32, %struct.anon, i8*, i8**, %struct.gcry_cipher_oid_spec*, i64, i64, i64, i32 (i8*, i8*, i32, %struct.cipher_bulk_ops*)*, i32 (i8*, i8*, i8*)*, i32 (i8*, i8*, i8*)*, void (i8*, i8*, i8*, i64)*, void (i8*, i8*, i8*, i64)*, i32 (i32, i32, void (i8*, i32, i8*, i8*)*)*, i32 (i8*, i32, i8*, i64)*, void (i8*, i8*, i64)* }
%struct.anon = type { i8, [3 x i8] }
%struct.gcry_cipher_oid_spec = type { i8*, i32 }
%struct.cipher_bulk_ops = type { void (i8*, i8*, i8*, i8*, i64)*, void (i8*, i8*, i8*, i8*, i64)*, void (i8*, i8*, i8*, i8*, i64, i32)*, void (i8*, i8*, i8*, i8*, i64)*, void (i8*, i8*, i8*, i8*, i64)*, void (i8*, i8*, i8*, i8*, i64)*, void (i8*, i8*, i8*, i8*, i64)*, i64 (%struct.gcry_cipher_handle*, i8*, i8*, i64, i32)*, i64 (%struct.gcry_cipher_handle*, i8*, i64)*, void (i8*, i8*, i8*, i8*, i64, i32)*, i64 (%struct.gcry_cipher_handle*, i8*, i8*, i64, i32)* }
%struct.gcry_cipher_handle = type { i32, i64, i64, %struct.gcry_cipher_spec*, i32, %struct.cipher_mode_ops, %struct.cipher_bulk_ops, i32, i32, %struct.anon.0, %union.anon, %union.anon.1, [16 x i8], i32, [12 x i8], %union.anon.2, %union.cipher_context_alignment_t }

!522 = !DIEnumerator(name: "GPG_ERR_ENFILE", value: 32843, isUnsigned: true)
!523 = !DIEnumerator(name: "GPG_ERR_ENOANO", value: 32844, isUnsigned: true)
!524 = !DIEnumerator(name: "GPG_ERR_ENOBUFS", value: 32845, isUnsigned: true)
!525 = !DIEnumerator(name: "GPG_ERR_ENOCSI", value: 32846, isUnsigned: true)
!526 = !DIEnumerator(name: "GPG_ERR_ENODATA", value: 32847, isUnsigned: true)
!527 = !DIEnumerator(name: "GPG_ERR_ENODEV", value: 32848, isUnsigned: true)
!528 = !DIEnumerator(name: "GPG_ERR_ENOENT", value: 32849, isUnsigned: true)
!529 = !DIEnumerator(name: "GPG_ERR_ENOEXEC", value: 32850, isUnsigned: true)
!530 = !DIEnumerator(name: "GPG_ERR_ENOLCK", value: 32851, isUnsigned: true)
!531 = !DIEnumerator(name: "GPG_ERR_ENOLINK", value: 32852, isUnsigned: true)
!532 = !DIEnumerator(name: "GPG_ERR_ENOMEDIUM", value: 32853, isUnsigned: true)
!533 = !DIEnumerator(name: "GPG_ERR_ENOMEM", value: 32854, isUnsigned: true)
!534 = !DIEnumerator(name: "GPG_ERR_ENOMSG", value: 32855, isUnsigned: true)
!535 = !DIEnumerator(name: "GPG_ERR_ENONET", value: 32856, isUnsigned: true)
!536 = !DIEnumerator(name: "GPG_ERR_ENOPKG", value: 32857, isUnsigned: true)
!537 = !DIEnumerator(name: "GPG_ERR_ENOPROTOOPT", value: 32858, isUnsigned: true)
!538 = !DIEnumerator(name: "GPG_ERR_ENOSPC", value: 32859, isUnsigned: true)
!539 = !DIEnumerator(name: "GPG_ERR_ENOSR", value: 32860, isUnsigned: true)
!540 = !DIEnumerator(name: "GPG_ERR_ENOSTR", value: 32861, isUnsigned: true)
!541 = !DIEnumerator(name: "GPG_ERR_ENOSYS", value: 32862, isUnsigned: true)
!542 = !DIEnumerator(name: "GPG_ERR_ENOTBLK", value: 32863, isUnsigned: true)
!543 = !DIEnumerator(name: "GPG_ERR_ENOTCONN", value: 32864, isUnsigned: true)
!544 = !DIEnumerator(name: "GPG_ERR_ENOTDIR", value: 32865, isUnsigned: true)
!545 = !DIEnumerator(name: "GPG_ERR_ENOTEMPTY", value: 32866, isUnsigned: true)
!546 = !DIEnumerator(name: "GPG_ERR_ENOTNAM", value: 32867, isUnsigned: true)
!547 = !DIEnumerator(name: "GPG_ERR_ENOTSOCK", value: 32868, isUnsigned: true)
!548 = !DIEnumerator(name: "GPG_ERR_ENOTSUP", value: 32869, isUnsigned: true)
!549 = !DIEnumerator(name: "GPG_ERR_ENOTTY", value: 32870, isUnsigned: true)
!550 = !DIEnumerator(name: "GPG_ERR_ENOTUNIQ", value: 32871, isUnsigned: true)
!551 = !DIEnumerator(name: "GPG_ERR_ENXIO", value: 32872, isUnsigned: true)
!552 = !DIEnumerator(name: "GPG_ERR_EOPNOTSUPP", value: 32873, isUnsigned: true)
!553 = !DIEnumerator(name: "GPG_ERR_EOVERFLOW", value: 32874, isUnsigned: true)
!554 = !DIEnumerator(name: "GPG_ERR_EPERM", value: 32875, isUnsigned: true)
!555 = !DIEnumerator(name: "GPG_ERR_EPFNOSUPPORT", value: 32876, isUnsigned: true)
!556 = !DIEnumerator(name: "GPG_ERR_EPIPE", value: 32877, isUnsigned: true)
!557 = !DIEnumerator(name: "GPG_ERR_EPROCLIM", value: 32878, isUnsigned: true)
!558 = !DIEnumerator(name: "GPG_ERR_EPROCUNAVAIL", value: 32879, isUnsigned: true)
!559 = !DIEnumerator(name: "GPG_ERR_EPROGMISMATCH", value: 32880, isUnsigned: true)
!560 = !DIEnumerator(name: "GPG_ERR_EPROGUNAVAIL", value: 32881, isUnsigned: true)
!561 = !DIEnumerator(name: "GPG_ERR_EPROTO", value: 32882, isUnsigned: true)
!562 = !DIEnumerator(name: "GPG_ERR_EPROTONOSUPPORT", value: 32883, isUnsigned: true)
!563 = !DIEnumerator(name: "GPG_ERR_EPROTOTYPE", value: 32884, isUnsigned: true)
!564 = !DIEnumerator(name: "GPG_ERR_ERANGE", value: 32885, isUnsigned: true)
!565 = !DIEnumerator(name: "GPG_ERR_EREMCHG", value: 32886, isUnsigned: true)
!566 = !DIEnumerator(name: "GPG_ERR_EREMOTE", value: 32887, isUnsigned: true)
!567 = !DIEnumerator(name: "GPG_ERR_EREMOTEIO", value: 32888, isUnsigned: true)
!568 = !DIEnumerator(name: "GPG_ERR_ERESTART", value: 32889, isUnsigned: true)
!569 = !DIEnumerator(name: "GPG_ERR_EROFS", value: 32890, isUnsigned: true)
!570 = !DIEnumerator(name: "GPG_ERR_ERPCMISMATCH", value: 32891, isUnsigned: true)
!571 = !DIEnumerator(name: "GPG_ERR_ESHUTDOWN", value: 32892, isUnsigned: true)
!572 = !DIEnumerator(name: "GPG_ERR_ESOCKTNOSUPPORT", value: 32893, isUnsigned: true)
!573 = !DIEnumerator(name: "GPG_ERR_ESPIPE", value: 32894, isUnsigned: true)
!574 = !DIEnumerator(name: "GPG_ERR_ESRCH", value: 32895, isUnsigned: true)
!575 = !DIEnumerator(name: "GPG_ERR_ESRMNT", value: 32896, isUnsigned: true)
!576 = !DIEnumerator(name: "GPG_ERR_ESTALE", value: 32897, isUnsigned: true)
!577 = !DIEnumerator(name: "GPG_ERR_ESTRPIPE", value: 32898, isUnsigned: true)
!578 = !DIEnumerator(name: "GPG_ERR_ETIME", value: 32899, isUnsigned: true)
!579 = !DIEnumerator(name: "GPG_ERR_ETIMEDOUT", value: 32900, isUnsigned: true)
!580 = !DIEnumerator(name: "GPG_ERR_ETOOMANYREFS", value: 32901, isUnsigned: true)
!581 = !DIEnumerator(name: "GPG_ERR_ETXTBSY", value: 32902, isUnsigned: true)
!582 = !DIEnumerator(name: "GPG_ERR_EUCLEAN", value: 32903, isUnsigned: true)
!583 = !DIEnumerator(name: "GPG_ERR_EUNATCH", value: 32904, isUnsigned: true)
!584 = !DIEnumerator(name: "GPG_ERR_EUSERS", value: 32905, isUnsigned: true)
!585 = !DIEnumerator(name: "GPG_ERR_EWOULDBLOCK", value: 32906, isUnsigned: true)
!586 = !DIEnumerator(name: "GPG_ERR_EXDEV", value: 32907, isUnsigned: true)
!587 = !DIEnumerator(name: "GPG_ERR_EXFULL", value: 32908, isUnsigned: true)
!588 = !DIEnumerator(name: "GPG_ERR_CODE_DIM", value: 65536, isUnsigned: true)
!589 = !{!590, !602}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "ARCFOUR_context", file: !3, line: 51, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3, line: 48, size: 8256, elements: !593)
!593 = !{!594, !600, !601}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "sbox", scope: !592, file: !3, line: 49, baseType: !595, size: 8192)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 8192, elements: !598)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !597, line: 88, baseType: !7)
!597 = !DIFile(filename: "../src/types.h", directory: "/home/luwei/libgcrypt-1.10.1/cipher")
!598 = !{!599}
!599 = !DISubrange(count: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "idx_i", scope: !592, file: !3, line: 50, baseType: !596, size: 32, offset: 8192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "idx_j", scope: !592, file: !3, line: 50, baseType: !596, size: 32, offset: 8224)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!603 = !{!0, !604, !618, !623, !631, !633}
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "initialized", scope: !606, file: !3, line: 134, type: !617, isLocal: true, isDefinition: true)
!606 = distinct !DISubprogram(name: "do_arcfour_setkey", scope: !3, file: !3, line: 132, type: !607, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !616)
!607 = !DISubroutineType(types: !608)
!608 = !{!609, !602, !612, !7}
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcry_err_code_t", file: !610, line: 128, baseType: !611)
!610 = !DIFile(filename: "../src/gcrypt.h", directory: "/home/luwei/libgcrypt-1.10.1/cipher")
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpg_err_code_t", file: !6, line: 729, baseType: !5)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !597, line: 62, baseType: !615)
!615 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!616 = !{}
!617 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "selftest_failed", scope: !606, file: !3, line: 135, type: !620, isLocal: true, isDefinition: true)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!622 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "key_1", scope: !625, file: !3, line: 194, type: !628, isLocal: true, isDefinition: true)
!625 = distinct !DISubprogram(name: "selftest", scope: !3, file: !3, line: 187, type: !626, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !616)
!626 = !DISubroutineType(types: !627)
!627 = !{!620}
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, size: 40, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 5)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "plaintext_1", scope: !625, file: !3, line: 196, type: !628, isLocal: true, isDefinition: true)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "ciphertext_1", scope: !625, file: !3, line: 198, type: !628, isLocal: true, isDefinition: true)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcry_cipher_spec_t", file: !636, line: 199, baseType: !637)
!636 = !DIFile(filename: "../src/cipher-proto.h", directory: "/home/luwei/libgcrypt-1.10.1/cipher")
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcry_cipher_spec", file: !636, line: 178, size: 960, elements: !638)
!638 = !{!639, !640, !645, !646, !648, !656, !660, !661, !662, !921, !926, !928, !933, !935, !944, !949}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "algo", scope: !637, file: !636, line: 180, baseType: !617, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !637, file: !636, line: 184, baseType: !641, size: 32, offset: 32)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !637, file: !636, line: 181, size: 32, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "disabled", scope: !641, file: !636, line: 182, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "fips", scope: !641, file: !636, line: 183, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !637, file: !636, line: 185, baseType: !620, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "aliases", scope: !637, file: !636, line: 186, baseType: !647, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "oids", scope: !637, file: !636, line: 187, baseType: !649, size: 64, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcry_cipher_oid_spec_t", file: !636, line: 174, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcry_cipher_oid_spec", file: !636, line: 170, size: 128, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !652, file: !636, line: 172, baseType: !620, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !652, file: !636, line: 173, baseType: !617, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "blocksize", scope: !637, file: !636, line: 188, baseType: !657, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !658, line: 46, baseType: !659)
!658 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.0/include/stddef.h", directory: "")
!659 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !637, file: !636, line: 189, baseType: !657, size: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "contextsize", scope: !637, file: !636, line: 190, baseType: !657, size: 64, offset: 384)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "setkey", scope: !637, file: !636, line: 191, baseType: !663, size: 64, offset: 448)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcry_cipher_setkey_t", file: !636, line: 135, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DISubroutineType(types: !666)
!666 = !{!609, !602, !667, !7, !669}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_bulk_ops", file: !671, line: 146, size: 704, elements: !672)
!671 = !DIFile(filename: "./cipher-internal.h", directory: "/home/luwei/libgcrypt-1.10.1/cipher")
!672 = !{!673, !680, !681, !685, !686, !687, !688, !689, !915, !919, !920}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "cfb_enc", scope: !670, file: !671, line: 148, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !602, !677, !602, !678, !657}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "cfb_dec", scope: !670, file: !671, line: 150, baseType: !674, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "cbc_enc", scope: !670, file: !671, line: 152, baseType: !682, size: 64, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DISubroutineType(types: !684)
!684 = !{null, !602, !677, !602, !678, !657, !617}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "cbc_dec", scope: !670, file: !671, line: 154, baseType: !674, size: 64, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ofb_enc", scope: !670, file: !671, line: 156, baseType: !674, size: 64, offset: 256)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_enc", scope: !670, file: !671, line: 158, baseType: !674, size: 64, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ctr32le_enc", scope: !670, file: !671, line: 160, baseType: !674, size: 64, offset: 384)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ocb_crypt", scope: !670, file: !671, line: 162, baseType: !690, size: 64, offset: 448)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!657, !693, !602, !678, !657, !617}
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcry_cipher_hd_t", file: !610, line: 905, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcry_cipher_handle", file: !671, line: 210, size: 7296, elements: !696)
!696 = !{!697, !698, !699, !700, !702, !703, !722, !724, !725, !726, !734, !771, !776, !777, !778, !914}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "magic", scope: !695, file: !671, line: 212, baseType: !617, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "actual_handle_size", scope: !695, file: !671, line: 213, baseType: !657, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "handle_offset", scope: !695, file: !671, line: 214, baseType: !657, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !695, file: !671, line: 215, baseType: !701, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "algo", scope: !695, file: !671, line: 219, baseType: !617, size: 32, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "mode_ops", scope: !695, file: !671, line: 222, baseType: !704, size: 384, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_mode_ops_t", file: !671, line: 139, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_mode_ops", file: !671, line: 122, size: 384, elements: !706)
!706 = !{!707, !711, !712, !716, !717, !721}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt", scope: !705, file: !671, line: 124, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DISubroutineType(types: !710)
!710 = !{!609, !693, !677, !657, !667, !657}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "decrypt", scope: !705, file: !671, line: 127, baseType: !708, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "setiv", scope: !705, file: !671, line: 130, baseType: !713, size: 64, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DISubroutineType(types: !715)
!715 = !{!609, !693, !667, !657}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "authenticate", scope: !705, file: !671, line: 133, baseType: !713, size: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "get_tag", scope: !705, file: !671, line: 135, baseType: !718, size: 64, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DISubroutineType(types: !720)
!720 = !{!609, !693, !677, !657}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "check_tag", scope: !705, file: !671, line: 137, baseType: !713, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "bulk", scope: !695, file: !671, line: 227, baseType: !723, size: 704, offset: 704)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_bulk_ops_t", file: !671, line: 169, baseType: !670)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !695, file: !671, line: 229, baseType: !617, size: 32, offset: 1408)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !695, file: !671, line: 230, baseType: !7, size: 32, offset: 1440)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "marks", scope: !695, file: !671, line: 238, baseType: !727, size: 32, offset: 1472)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !695, file: !671, line: 232, size: 32, elements: !728)
!728 = !{!729, !730, !731, !732, !733}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !727, file: !671, line: 233, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !727, file: !671, line: 234, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !727, file: !671, line: 235, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "finalize", scope: !727, file: !671, line: 236, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "allow_weak_key", scope: !727, file: !671, line: 237, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "u_iv", scope: !695, file: !671, line: 248, baseType: !735, size: 128, offset: 1536)
!735 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !695, file: !671, line: 245, size: 128, elements: !736)
!736 = !{!737, !769}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "iv_align", scope: !735, file: !671, line: 246, baseType: !738, size: 128)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_context_alignment_t", file: !671, line: 187, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !671, line: 180, size: 128, elements: !740)
!740 = !{!741, !764, !768}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "foo", scope: !739, file: !671, line: 182, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "PROPERLY_ALIGNED_TYPE", file: !597, line: 134, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !597, line: 125, size: 64, elements: !744)
!744 = !{!745, !746, !748, !752, !754, !760, !762}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !743, file: !597, line: 127, baseType: !617, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !743, file: !597, line: 128, baseType: !747, size: 16)
!747 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !743, file: !597, line: 129, baseType: !749, size: 8)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 8, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 1)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !743, file: !597, line: 130, baseType: !753, size: 64)
!753 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !743, file: !597, line: 131, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !597, line: 105, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !757, line: 27, baseType: !758)
!757 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !759, line: 45, baseType: !659)
!759 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!760 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !743, file: !597, line: 132, baseType: !761, size: 32)
!761 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !743, file: !597, line: 133, baseType: !763, size: 64)
!763 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bar", scope: !739, file: !671, line: 184, baseType: !765, size: 128, align: 128)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !622, size: 128, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 16)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !739, file: !671, line: 186, baseType: !749, size: 8)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !735, file: !671, line: 247, baseType: !770, size: 128)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 128, elements: !766)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "u_ctr", scope: !695, file: !671, line: 256, baseType: !772, size: 128, offset: 1664)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !695, file: !671, line: 253, size: 128, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "iv_align", scope: !772, file: !671, line: 254, baseType: !738, size: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !772, file: !671, line: 255, baseType: !770, size: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "lastiv", scope: !695, file: !671, line: 259, baseType: !770, size: 128, offset: 1792)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !695, file: !671, line: 260, baseType: !617, size: 32, offset: 1920)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "u_mode", scope: !695, file: !671, line: 439, baseType: !779, size: 5120, offset: 2048)
!779 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !695, file: !671, line: 262, size: 5120, elements: !780)
!780 = !{!781, !792, !821, !836, !841, !875, !894, !899, !909}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "ccm", scope: !779, file: !671, line: 278, baseType: !782, size: 512)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !779, file: !671, line: 264, size: 512, elements: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "encryptlen", scope: !782, file: !671, line: 265, baseType: !755, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "aadlen", scope: !782, file: !671, line: 266, baseType: !755, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "authlen", scope: !782, file: !671, line: 267, baseType: !7, size: 32, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "macbuf", scope: !782, file: !671, line: 270, baseType: !770, size: 128, offset: 160)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mac_unused", scope: !782, file: !671, line: 271, baseType: !617, size: 32, offset: 288)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "s0", scope: !782, file: !671, line: 273, baseType: !770, size: 128, offset: 320)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "nonce", scope: !782, file: !671, line: 275, baseType: !7, size: 1, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lengths", scope: !782, file: !671, line: 276, baseType: !7, size: 1, offset: 449, flags: DIFlagBitField, extraData: i64 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "poly1305", scope: !779, file: !671, line: 292, baseType: !793, size: 736)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !779, file: !671, line: 281, size: 736, elements: !794)
!794 = !{!795, !799, !800, !801, !802}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "aadcount", scope: !793, file: !671, line: 283, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 64, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 2)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "datacount", scope: !793, file: !671, line: 286, baseType: !796, size: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "aad_finalized", scope: !793, file: !671, line: 288, baseType: !7, size: 1, offset: 128, flags: DIFlagBitField, extraData: i64 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "bytecount_over_limits", scope: !793, file: !671, line: 289, baseType: !7, size: 1, offset: 129, flags: DIFlagBitField, extraData: i64 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !793, file: !671, line: 291, baseType: !803, size: 576, offset: 160)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "poly1305_context_t", file: !804, line: 49, baseType: !805)
!804 = !DIFile(filename: "././poly1305-internal.h", directory: "/home/luwei/libgcrypt-1.10.1/cipher")
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "poly1305_context_s", file: !804, line: 44, size: 576, elements: !806)
!806 = !{!807, !818, !820}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !805, file: !804, line: 46, baseType: !808, size: 416)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "POLY1305_STATE", file: !804, line: 42, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !804, line: 37, size: 416, elements: !810)
!810 = !{!811, !815, !816}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "k", scope: !809, file: !804, line: 39, baseType: !812, size: 128)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 128, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 4)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !809, file: !804, line: 40, baseType: !812, size: 128, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !809, file: !804, line: 41, baseType: !817, size: 160, offset: 256)
!817 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 160, elements: !629)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !805, file: !804, line: 47, baseType: !819, size: 128, offset: 416)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 128, elements: !766)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "leftover", scope: !805, file: !804, line: 48, baseType: !7, size: 32, offset: 544)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "cmac", scope: !779, file: !671, line: 295, baseType: !822, size: 640)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcry_cmac_context_t", file: !671, line: 206, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !671, line: 191, size: 640, elements: !824)
!824 = !{!825, !830, !833, !834, !835}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "u_iv", scope: !823, file: !671, line: 196, baseType: !826, size: 128)
!826 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !823, file: !671, line: 193, size: 128, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "iv_align", scope: !826, file: !671, line: 194, baseType: !738, size: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "iv", scope: !826, file: !671, line: 195, baseType: !770, size: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "subkeys", scope: !823, file: !671, line: 199, baseType: !831, size: 256, offset: 128)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 256, elements: !832)
!832 = !{!798, !767}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "macbuf", scope: !823, file: !671, line: 202, baseType: !770, size: 128, offset: 384)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "mac_unused", scope: !823, file: !671, line: 204, baseType: !617, size: 32, offset: 512)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !823, file: !671, line: 205, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "eax", scope: !779, file: !671, line: 304, baseType: !837, size: 1280)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !779, file: !671, line: 298, size: 1280, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "cmac_header", scope: !837, file: !671, line: 300, baseType: !822, size: 640)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "cmac_ciphertext", scope: !837, file: !671, line: 303, baseType: !822, size: 640, offset: 640)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "gcm", scope: !779, file: !671, line: 358, baseType: !842, size: 5120)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !779, file: !671, line: 307, size: 5120, elements: !843)
!843 = !{!844, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !863, !867, !873, !874}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "u_tag", scope: !842, file: !671, line: 312, baseType: !845, size: 128)
!845 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !842, file: !671, line: 309, size: 128, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "iv_align", scope: !845, file: !671, line: 310, baseType: !738, size: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !845, file: !671, line: 311, baseType: !770, size: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "macbuf", scope: !842, file: !671, line: 315, baseType: !770, size: 128, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "mac_unused", scope: !842, file: !671, line: 316, baseType: !617, size: 32, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "aadlen", scope: !842, file: !671, line: 319, baseType: !796, size: 64, offset: 288)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "datalen", scope: !842, file: !671, line: 320, baseType: !796, size: 64, offset: 352)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "tagiv", scope: !842, file: !671, line: 323, baseType: !770, size: 128, offset: 416)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "ghash_data_finalized", scope: !842, file: !671, line: 325, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ghash_aad_finalized", scope: !842, file: !671, line: 326, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "datalen_over_limits", scope: !842, file: !671, line: 328, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "disallow_encryption_because_of_setiv_in_fips_mode", scope: !842, file: !671, line: 329, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "u_ghash_key", scope: !842, file: !671, line: 337, baseType: !859, size: 128, offset: 640)
!859 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !842, file: !671, line: 334, size: 128, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "iv_align", scope: !859, file: !671, line: 335, baseType: !738, size: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !859, file: !671, line: 336, baseType: !770, size: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_table", scope: !842, file: !671, line: 343, baseType: !864, size: 4096, offset: 768)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !755, size: 4096, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "ghash_fn", scope: !842, file: !671, line: 351, baseType: !868, size: 64, offset: 4864)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "ghash_fn_t", file: !671, line: 117, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!7, !693, !872, !612, !657}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "polyval_fn", scope: !842, file: !671, line: 354, baseType: !868, size: 64, offset: 4928)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "siv_keylen", scope: !842, file: !671, line: 357, baseType: !7, size: 32, offset: 4992)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ocb", scope: !779, file: !671, line: 401, baseType: !876, size: 3136)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !779, file: !671, line: 361, size: 3136, elements: !877)
!877 = !{!878, !879, !880, !881, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "L_star", scope: !876, file: !671, line: 365, baseType: !770, size: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "L_dollar", scope: !876, file: !671, line: 366, baseType: !770, size: 128, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "L0L1", scope: !876, file: !671, line: 367, baseType: !770, size: 128, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "L", scope: !876, file: !671, line: 368, baseType: !882, size: 2048, offset: 384)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 2048, elements: !883)
!883 = !{!767, !767}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !876, file: !671, line: 373, baseType: !770, size: 128, offset: 2432)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "aad_offset", scope: !876, file: !671, line: 376, baseType: !770, size: 128, offset: 2560)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "aad_sum", scope: !876, file: !671, line: 381, baseType: !770, size: 128, offset: 2688)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "aad_leftover", scope: !876, file: !671, line: 384, baseType: !770, size: 128, offset: 2816)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "data_nblocks", scope: !876, file: !671, line: 387, baseType: !755, size: 64, offset: 2944)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "aad_nblocks", scope: !876, file: !671, line: 388, baseType: !755, size: 64, offset: 3008)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "aad_nleftover", scope: !876, file: !671, line: 391, baseType: !615, size: 8, offset: 3072)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "taglen", scope: !876, file: !671, line: 395, baseType: !615, size: 8, offset: 3080)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "data_finalized", scope: !876, file: !671, line: 399, baseType: !7, size: 1, offset: 3088, flags: DIFlagBitField, extraData: i64 3088)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "aad_finalized", scope: !876, file: !671, line: 400, baseType: !7, size: 1, offset: 3089, flags: DIFlagBitField, extraData: i64 3088)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "xts", scope: !779, file: !671, line: 408, baseType: !895, size: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !779, file: !671, line: 404, size: 64, elements: !896)
!896 = !{!897}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "tweak_context", scope: !895, file: !671, line: 407, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "siv", scope: !779, file: !671, line: 433, baseType: !900, size: 1280)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !779, file: !671, line: 411, size: 1280, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "dec_tag", scope: !900, file: !671, line: 413, baseType: !770, size: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "s2v_d", scope: !900, file: !671, line: 416, baseType: !770, size: 128, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "aad_count", scope: !900, file: !671, line: 419, baseType: !7, size: 8, offset: 256, flags: DIFlagBitField, extraData: i64 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "dec_tag_set", scope: !900, file: !671, line: 422, baseType: !7, size: 1, offset: 264, flags: DIFlagBitField, extraData: i64 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "s2v_cmac", scope: !900, file: !671, line: 427, baseType: !822, size: 640, offset: 384)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "s2v_zero_block", scope: !900, file: !671, line: 428, baseType: !770, size: 128, offset: 1024)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_context", scope: !900, file: !671, line: 432, baseType: !898, size: 64, offset: 1152)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "wrap", scope: !779, file: !671, line: 438, baseType: !910, size: 32)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !779, file: !671, line: 436, size: 32, elements: !911)
!911 = !{!912}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "plen", scope: !910, file: !671, line: 437, baseType: !913, size: 32)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 32, elements: !813)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !695, file: !671, line: 446, baseType: !738, size: 128, offset: 7168)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ocb_auth", scope: !670, file: !671, line: 164, baseType: !916, size: 64, offset: 512)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{!657, !693, !678, !657}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "xts_crypt", scope: !670, file: !671, line: 165, baseType: !682, size: 64, offset: 576)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_crypt", scope: !670, file: !671, line: 167, baseType: !690, size: 64, offset: 640)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt", scope: !637, file: !636, line: 192, baseType: !922, size: 64, offset: 512)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcry_cipher_encrypt_t", file: !636, line: 141, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = !DISubroutineType(types: !925)
!925 = !{!7, !602, !677, !667}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "decrypt", scope: !637, file: !636, line: 193, baseType: !927, size: 64, offset: 576)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcry_cipher_decrypt_t", file: !636, line: 146, baseType: !923)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "stencrypt", scope: !637, file: !636, line: 194, baseType: !929, size: 64, offset: 640)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcry_cipher_stencrypt_t", file: !636, line: 151, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !602, !677, !667, !657}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "stdecrypt", scope: !637, file: !636, line: 195, baseType: !934, size: 64, offset: 704)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcry_cipher_stdecrypt_t", file: !636, line: 157, baseType: !930)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "selftest", scope: !637, file: !636, line: 196, baseType: !936, size: 64, offset: 768)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "selftest_func_t", file: !636, line: 42, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DISubroutineType(types: !939)
!939 = !{!611, !617, !617, !940}
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "selftest_report_func_t", file: !636, line: 36, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !620, !617, !620, !620}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "set_extra_info", scope: !637, file: !636, line: 197, baseType: !945, size: 64, offset: 832)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_set_extra_info_t", file: !636, line: 163, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!611, !602, !617, !678, !657}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "setiv", scope: !637, file: !636, line: 198, baseType: !950, size: 64, offset: 896)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_setiv_func_t", file: !636, line: 167, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !602, !612, !657}
!954 = !{i32 7, !"Dwarf Version", i32 4}
!955 = !{i32 2, !"Debug Info Version", i32 3}
!956 = !{i32 1, !"wchar_size", i32 4}
!957 = !{!"Ubuntu clang version 12.0.0-3ubuntu1~20.04.5"}
!958 = distinct !DISubprogram(name: "arcfour_setkey", scope: !3, file: !3, line: 176, type: !959, scopeLine: 178, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !616)
!959 = !DISubroutineType(types: !960)
!960 = !{!609, !602, !612, !7, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!962 = !DILocalVariable(name: "context", arg: 1, scope: !958, file: !3, line: 176, type: !602)
!963 = !DILocation(line: 176, column: 24, scope: !958)
!964 = !DILocalVariable(name: "key", arg: 2, scope: !958, file: !3, line: 176, type: !612)
!965 = !DILocation(line: 176, column: 45, scope: !958)
!966 = !DILocalVariable(name: "keylen", arg: 3, scope: !958, file: !3, line: 176, type: !7)
!967 = !DILocation(line: 176, column: 63, scope: !958)
!968 = !DILocalVariable(name: "bulk_ops", arg: 4, scope: !958, file: !3, line: 177, type: !961)
!969 = !DILocation(line: 177, column: 37, scope: !958)
!970 = !DILocalVariable(name: "ctx", scope: !958, file: !3, line: 179, type: !590)
!971 = !DILocation(line: 179, column: 20, scope: !958)
!972 = !DILocation(line: 179, column: 46, scope: !958)
!973 = !DILocation(line: 179, column: 26, scope: !958)
!974 = !DILocalVariable(name: "rc", scope: !958, file: !3, line: 180, type: !609)
!975 = !DILocation(line: 180, column: 19, scope: !958)
!976 = !DILocation(line: 180, column: 43, scope: !958)
!977 = !DILocation(line: 180, column: 48, scope: !958)
!978 = !DILocation(line: 180, column: 53, scope: !958)
!979 = !DILocation(line: 180, column: 24, scope: !958)
!980 = !DILocation(line: 181, column: 9, scope: !958)
!981 = !DILocation(line: 182, column: 10, scope: !958)
!982 = !DILocation(line: 182, column: 3, scope: !958)
!983 = distinct !DISubprogram(name: "encrypt_stream", scope: !3, file: !3, line: 57, type: !984, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !616)
!984 = !DISubroutineType(types: !985)
!985 = !{null, !602, !872, !612, !657}
!986 = !DILocalVariable(name: "context", arg: 1, scope: !983, file: !3, line: 57, type: !602)
!987 = !DILocation(line: 57, column: 23, scope: !983)
!988 = !DILocalVariable(name: "outbuf", arg: 2, scope: !983, file: !3, line: 58, type: !872)
!989 = !DILocation(line: 58, column: 23, scope: !983)
!990 = !DILocalVariable(name: "inbuf", arg: 3, scope: !983, file: !3, line: 58, type: !612)
!991 = !DILocation(line: 58, column: 43, scope: !983)
!992 = !DILocalVariable(name: "length", arg: 4, scope: !983, file: !3, line: 58, type: !657)
!993 = !DILocation(line: 58, column: 57, scope: !983)
!994 = !DILocation(line: 60, column: 24, scope: !983)
!995 = !DILocation(line: 60, column: 33, scope: !983)
!996 = !DILocation(line: 60, column: 41, scope: !983)
!997 = !DILocation(line: 60, column: 48, scope: !983)
!998 = !DILocation(line: 60, column: 3, scope: !983)
!999 = !DILocation(line: 61, column: 1, scope: !983)
!1000 = !DILocalVariable(name: "context", arg: 1, scope: !606, file: !3, line: 132, type: !602)
!1001 = !DILocation(line: 132, column: 26, scope: !606)
!1002 = !DILocalVariable(name: "key", arg: 2, scope: !606, file: !3, line: 132, type: !612)
!1003 = !DILocation(line: 132, column: 47, scope: !606)
!1004 = !DILocalVariable(name: "keylen", arg: 3, scope: !606, file: !3, line: 132, type: !7)
!1005 = !DILocation(line: 132, column: 65, scope: !606)
