; ModuleID = 'hmac-k.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.br_hmac_context = type { %union.br_hash_compat_context, [64 x i8], i64 }
%union.br_hash_compat_context = type { %struct.br_sha384_context }
%struct.br_sha384_context = type { %struct.br_hash_class_*, [128 x i8], i64, [8 x i64] }
%struct.br_hash_class_ = type { i64, i32, void (%struct.br_hash_class_**)*, void (%struct.br_hash_class_**, i8*, i64)*, void (%struct.br_hash_class_**, i8*)*, i64 (%struct.br_hash_class_**, i8*)*, void (%struct.br_hash_class_**, i8*, i64)* }
%struct.smack_value = type { i8* }

; Function Attrs: noinline nounwind uwtable
define dso_local void @hmac_wrapper(%struct.br_hmac_context* %0, i8* %1, i64 %2, i64 %3, i64 %4, i8* %5) #0 !dbg !23 {
  call void @llvm.dbg.value(metadata %struct.br_hmac_context* %0, metadata !134, metadata !DIExpression()), !dbg !135, !psr.id !136
  call void @llvm.dbg.value(metadata i8* %1, metadata !137, metadata !DIExpression()), !dbg !135, !psr.id !138
  call void @llvm.dbg.value(metadata i64 %2, metadata !139, metadata !DIExpression()), !dbg !135, !psr.id !140
  call void @llvm.dbg.value(metadata i64 %3, metadata !141, metadata !DIExpression()), !dbg !135, !psr.id !142
  call void @llvm.dbg.value(metadata i64 %4, metadata !143, metadata !DIExpression()), !dbg !135, !psr.id !144

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "hmac.c", directory: "/home/luwei/bech-back/BearSSL/hmac")
!2 = !{}
!3 = distinct !DICompileUnit(language: DW_LANG_C99, file: !4, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !5, splitDebugInlining: false, nameTableKind: None)
!4 = !DIFile(filename: "../BearSSL/src/mac/hmac_ct.c", directory: "/home/luwei/bech-back/BearSSL/hmac")
!5 = !{!6, !11, !14, !16, !10}
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !7, line: 26, baseType: !8)
!7 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !9, line: 42, baseType: !10)
!9 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !7, line: 27, baseType: !12)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !9, line: 45, baseType: !13)
!13 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !15, line: 46, baseType: !13)
!15 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!18 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!19 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!20 = !{i32 7, !"Dwarf Version", i32 4}
!21 = !{i32 2, !"Debug Info Version", i32 3}
!22 = !{i32 1, !"wchar_size", i32 4}
!23 = distinct !DISubprogram(name: "hmac_wrapper", scope: !1, file: !1, line: 3, type: !24, scopeLine: 5, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!24 = !DISubroutineType(types: !25)
!25 = !{null, !26, !54, !14, !14, !14, !62}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_hmac_context", file: !29, line: 116, baseType: !30)
!29 = !DIFile(filename: "../BearSSL/inc/bearssl_hmac.h", directory: "/home/luwei/bech-back/BearSSL/hmac")
!30 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 110, size: 2240, elements: !31)
!31 = !{!32, !132, !133}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "dig", scope: !30, file: !29, line: 112, baseType: !33, size: 1664)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_hash_compat_context", file: !34, line: 1086, baseType: !35)
!34 = !DIFile(filename: "../BearSSL/inc/bearssl_hash.h", directory: "/home/luwei/bech-back/BearSSL/hmac")
!35 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !34, line: 1077, size: 1664, elements: !36)
!36 = !{!37, !71, !85, !96, !107, !109, !121, !123}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !35, file: !34, line: 1078, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_hash_class", file: !34, line: 221, baseType: !41)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "br_hash_class_", file: !34, line: 222, size: 448, elements: !42)
!42 = !{!43, !44, !45, !50, !56, !63, !67}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "context_size", scope: !41, file: !34, line: 227, baseType: !14, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !41, file: !34, line: 257, baseType: !6, size: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !41, file: !34, line: 269, baseType: !46, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !41, file: !34, line: 285, baseType: !51, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{null, !49, !54, !14}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !41, file: !34, line: 300, baseType: !57, size: 64, offset: 256)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DISubroutineType(types: !59)
!59 = !{null, !60, !62}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !38)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !41, file: !34, line: 316, baseType: !64, size: 64, offset: 320)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!11, !60, !62}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "set_state", scope: !41, file: !34, line: 327, baseType: !68, size: 64, offset: 384)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !49, !54, !11}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "md5", scope: !35, file: !34, line: 1079, baseType: !72, size: 768)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_md5_context", file: !34, line: 399, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 389, size: 768, elements: !74)
!74 = !{!75, !76, !80, !81}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !73, file: !34, line: 393, baseType: !38, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !73, file: !34, line: 395, baseType: !77, size: 512, offset: 64)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 512, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !73, file: !34, line: 396, baseType: !11, size: 64, offset: 576)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !73, file: !34, line: 397, baseType: !82, size: 128, offset: 640)
!82 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 128, elements: !83)
!83 = !{!84}
!84 = !DISubrange(count: 4)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "sha1", scope: !35, file: !34, line: 1080, baseType: !86, size: 832)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha1_context", file: !34, line: 494, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 484, size: 832, elements: !88)
!88 = !{!89, !90, !91, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !87, file: !34, line: 488, baseType: !38, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !87, file: !34, line: 490, baseType: !77, size: 512, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !87, file: !34, line: 491, baseType: !11, size: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !87, file: !34, line: 492, baseType: !93, size: 160, offset: 640)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 160, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 5)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "sha224", scope: !35, file: !34, line: 1081, baseType: !97, size: 896)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha224_context", file: !34, line: 589, baseType: !98)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 579, size: 896, elements: !99)
!99 = !{!100, !101, !102, !103}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !98, file: !34, line: 583, baseType: !38, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !98, file: !34, line: 585, baseType: !77, size: 512, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !98, file: !34, line: 586, baseType: !11, size: 64, offset: 576)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !98, file: !34, line: 587, baseType: !104, size: 256, offset: 640)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !6, size: 256, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 8)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !35, file: !34, line: 1082, baseType: !108, size: 896)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha256_context", file: !34, line: 683, baseType: !97)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sha384", scope: !35, file: !34, line: 1083, baseType: !110, size: 1664)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha384_context", file: !34, line: 792, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 782, size: 1664, elements: !112)
!112 = !{!113, !114, !118, !119}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !111, file: !34, line: 786, baseType: !38, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !111, file: !34, line: 788, baseType: !115, size: 1024, offset: 64)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 1024, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !111, file: !34, line: 789, baseType: !11, size: 64, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !111, file: !34, line: 790, baseType: !120, size: 512, offset: 1152)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 512, elements: !105)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "sha512", scope: !35, file: !34, line: 1084, baseType: !122, size: 1664)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha512_context", file: !34, line: 886, baseType: !110)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "md5sha1", scope: !35, file: !34, line: 1085, baseType: !124, size: 960)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_md5sha1_context", file: !34, line: 1006, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 995, size: 960, elements: !126)
!126 = !{!127, !128, !129, !130, !131}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !125, file: !34, line: 999, baseType: !38, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !125, file: !34, line: 1001, baseType: !77, size: 512, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !125, file: !34, line: 1002, baseType: !11, size: 64, offset: 576)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "val_md5", scope: !125, file: !34, line: 1003, baseType: !82, size: 128, offset: 640)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "val_sha1", scope: !125, file: !34, line: 1004, baseType: !93, size: 160, offset: 768)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "kso", scope: !30, file: !29, line: 113, baseType: !77, size: 512, offset: 1664)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !30, file: !29, line: 114, baseType: !14, size: 64, offset: 2176)
!134 = !DILocalVariable(name: "ctx", arg: 1, scope: !23, file: !1, line: 3, type: !26)
!135 = !DILocation(line: 0, scope: !23)
!136 = !{!"0"}
!137 = !DILocalVariable(name: "data", arg: 2, scope: !23, file: !1, line: 4, type: !54)
!138 = !{!"1"}
!139 = !DILocalVariable(name: "len", arg: 3, scope: !23, file: !1, line: 4, type: !14)
!140 = !{!"2"}
!141 = !DILocalVariable(name: "min_len", arg: 4, scope: !23, file: !1, line: 4, type: !14)
!142 = !{!"3"}
!143 = !DILocalVariable(name: "max_len", arg: 5, scope: !23, file: !1, line: 4, type: !14)
!144 = !{!"4"}
!145 = !DILocalVariable(name: "out", arg: 6, scope: !23, file: !1, line: 5, type: !62)
!146 = !{!"5"}
!147 = !DILocation(line: 6, column: 12, scope: !23)
!148 = !{!"6"}
!149 = !DILocation(line: 6, column: 2, scope: !23)
!150 = !{!"7"}
!151 = !DILocation(line: 7, column: 12, scope: !23)
!152 = !{!"8"}
!153 = !DILocation(line: 7, column: 2, scope: !23)
!154 = !{!"9"}
!155 = !DILocation(line: 8, column: 12, scope: !23)
!156 = !{!"10"}
!157 = !DILocation(line: 8, column: 2, scope: !23)
!158 = !{!"11"}
!159 = !DILocation(line: 9, column: 12, scope: !23)
!160 = !{!"12"}
!161 = !DILocation(line: 9, column: 2, scope: !23)
!162 = !{!"13"}
!163 = !DILocation(line: 10, column: 12, scope: !23)
!164 = !{!"14"}
!165 = !DILocation(line: 10, column: 2, scope: !23)
!166 = !{!"15"}
!167 = !DILocation(line: 11, column: 12, scope: !23)
!168 = !{!"16"}
!169 = !DILocation(line: 11, column: 2, scope: !23)
!170 = !{!"17"}
!171 = !DILocation(line: 13, column: 31, scope: !23)
!172 = !{!"18"}
!173 = !DILocation(line: 13, column: 12, scope: !23)
!174 = !{!"19"}
!175 = !DILocation(line: 13, column: 2, scope: !23)
!176 = !{!"20"}
!177 = !DILocation(line: 14, column: 31, scope: !23)
!178 = !{!"21"}
!179 = !{!"22"}
!180 = !DILocation(line: 14, column: 12, scope: !23)
!181 = !{!"23"}
!182 = !DILocation(line: 14, column: 2, scope: !23)
!183 = !{!"24"}
!184 = !DILocation(line: 15, column: 31, scope: !23)
!185 = !{!"25"}
!186 = !DILocation(line: 15, column: 26, scope: !23)
!187 = !{!"26"}
!188 = !DILocation(line: 15, column: 12, scope: !23)
!189 = !{!"27"}
!190 = !DILocation(line: 15, column: 2, scope: !23)
!191 = !{!"28"}
!192 = !DILocation(line: 26, column: 12, scope: !23)
!193 = !{!"29"}
!194 = !DILocation(line: 26, column: 2, scope: !23)
!195 = !{!"30"}
!196 = !DILocation(line: 28, column: 2, scope: !23)
!197 = !{!"31"}
!198 = !DILocation(line: 30, column: 1, scope: !23)
!199 = !{!"32"}
!200 = distinct !DISubprogram(name: "vfct_tmp", scope: !1, file: !1, line: 33, type: !201, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!201 = !DISubroutineType(types: !202)
!202 = !{null, !203, !26, !54, !14, !14, !14, !62}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!204 = !DILocalVariable(name: "k", arg: 1, scope: !200, file: !1, line: 33, type: !203)
!205 = !DILocation(line: 0, scope: !200)
!206 = !{!"33"}
!207 = !DILocalVariable(name: "ctx", arg: 2, scope: !200, file: !1, line: 33, type: !26)
!208 = !{!"34"}
!209 = !DILocalVariable(name: "data", arg: 3, scope: !200, file: !1, line: 34, type: !54)
!210 = !{!"35"}
!211 = !DILocalVariable(name: "len", arg: 4, scope: !200, file: !1, line: 34, type: !14)
!212 = !{!"36"}
!213 = !DILocalVariable(name: "min_len", arg: 5, scope: !200, file: !1, line: 34, type: !14)
!214 = !{!"37"}
!215 = !DILocalVariable(name: "max_len", arg: 6, scope: !200, file: !1, line: 34, type: !14)
!216 = !{!"38"}
!217 = !DILocalVariable(name: "out", arg: 7, scope: !200, file: !1, line: 35, type: !62)
!218 = !{!"39"}
!219 = !DILocation(line: 36, column: 2, scope: !200)
!220 = !{!"40"}
!221 = !DILocation(line: 38, column: 1, scope: !200)
!222 = !{!"41"}
!223 = distinct !DISubprogram(name: "hmac_wrapper_t", scope: !1, file: !1, line: 45, type: !224, scopeLine: 45, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!224 = !DISubroutineType(types: !225)
!225 = !{null}
!226 = !{!"42"}
!227 = !DILocalVariable(name: "cctx", scope: !223, file: !1, line: 46, type: !28)
!228 = !DILocation(line: 46, column: 18, scope: !223)
!229 = !{!"43"}
!230 = !DILocation(line: 46, column: 25, scope: !223)
!231 = !{!"44"}
!232 = !DILocalVariable(name: "ctx", scope: !223, file: !1, line: 47, type: !26)
!233 = !DILocation(line: 0, scope: !223)
!234 = !{!"45"}
!235 = !DILocation(line: 48, column: 21, scope: !223)
!236 = !{!"46"}
!237 = !DILocalVariable(name: "data", scope: !223, file: !1, line: 48, type: !54)
!238 = !{!"47"}
!239 = !DILocation(line: 49, column: 15, scope: !223)
!240 = !{!"48"}
!241 = !DILocalVariable(name: "len", scope: !223, file: !1, line: 49, type: !14)
!242 = !{!"49"}
!243 = !DILocation(line: 50, column: 19, scope: !223)
!244 = !{!"50"}
!245 = !DILocalVariable(name: "min_len", scope: !223, file: !1, line: 50, type: !14)
!246 = !{!"51"}
!247 = !DILocation(line: 51, column: 19, scope: !223)
!248 = !{!"52"}
!249 = !DILocalVariable(name: "max_len", scope: !223, file: !1, line: 51, type: !14)
!250 = !{!"53"}
!251 = !DILocation(line: 52, column: 14, scope: !223)
!252 = !{!"54"}
!253 = !DILocalVariable(name: "out", scope: !223, file: !1, line: 52, type: !62)
!254 = !{!"55"}
!255 = !DILocation(line: 53, column: 26, scope: !223)
!256 = !{!"56"}
!257 = !DILocation(line: 53, column: 21, scope: !223)
!258 = !{!"57"}
!259 = !DILocalVariable(name: "k", scope: !223, file: !1, line: 53, type: !203)
!260 = !{!"58"}
!261 = !DILocation(line: 54, column: 2, scope: !223)
!262 = !{!"59"}
!263 = !DILocation(line: 56, column: 1, scope: !223)
!264 = !{!"60"}
!265 = distinct !DISubprogram(name: "br_hmac_outCT", scope: !4, file: !4, line: 46, type: !266, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !2)
!266 = !DISubroutineType(types: !267)
!267 = !{!14, !268, !54, !14, !14, !14, !62}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_hmac_context", file: !29, line: 116, baseType: !271)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !29, line: 110, size: 2240, elements: !272)
!272 = !{!273, !353, !354}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "dig", scope: !271, file: !29, line: 112, baseType: !274, size: 1664)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_hash_compat_context", file: !34, line: 1086, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !34, line: 1077, size: 1664, elements: !276)
!276 = !{!277, !308, !316, !324, !332, !334, !342, !344}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !275, file: !34, line: 1078, baseType: !278, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_hash_class", file: !34, line: 221, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "br_hash_class_", file: !34, line: 222, size: 448, elements: !282)
!282 = !{!283, !284, !285, !290, !294, !300, !304}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "context_size", scope: !281, file: !34, line: 227, baseType: !14, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !281, file: !34, line: 257, baseType: !6, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !281, file: !34, line: 269, baseType: !286, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "update", scope: !281, file: !34, line: 285, baseType: !291, size: 64, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !289, !54, !14}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !281, file: !34, line: 300, baseType: !295, size: 64, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !298, !62}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !278)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !281, file: !34, line: 316, baseType: !301, size: 64, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DISubroutineType(types: !303)
!303 = !{!11, !298, !62}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "set_state", scope: !281, file: !34, line: 327, baseType: !305, size: 64, offset: 384)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !289, !54, !11}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "md5", scope: !275, file: !34, line: 1079, baseType: !309, size: 768)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_md5_context", file: !34, line: 399, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 389, size: 768, elements: !311)
!311 = !{!312, !313, !314, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !310, file: !34, line: 393, baseType: !278, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !310, file: !34, line: 395, baseType: !77, size: 512, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !310, file: !34, line: 396, baseType: !11, size: 64, offset: 576)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !310, file: !34, line: 397, baseType: !82, size: 128, offset: 640)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sha1", scope: !275, file: !34, line: 1080, baseType: !317, size: 832)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha1_context", file: !34, line: 494, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 484, size: 832, elements: !319)
!319 = !{!320, !321, !322, !323}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !318, file: !34, line: 488, baseType: !278, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !318, file: !34, line: 490, baseType: !77, size: 512, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !318, file: !34, line: 491, baseType: !11, size: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !318, file: !34, line: 492, baseType: !93, size: 160, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "sha224", scope: !275, file: !34, line: 1081, baseType: !325, size: 896)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha224_context", file: !34, line: 589, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 579, size: 896, elements: !327)
!327 = !{!328, !329, !330, !331}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !326, file: !34, line: 583, baseType: !278, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !326, file: !34, line: 585, baseType: !77, size: 512, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !326, file: !34, line: 586, baseType: !11, size: 64, offset: 576)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !326, file: !34, line: 587, baseType: !104, size: 256, offset: 640)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "sha256", scope: !275, file: !34, line: 1082, baseType: !333, size: 896)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha256_context", file: !34, line: 683, baseType: !325)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "sha384", scope: !275, file: !34, line: 1083, baseType: !335, size: 1664)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha384_context", file: !34, line: 792, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 782, size: 1664, elements: !337)
!337 = !{!338, !339, !340, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !336, file: !34, line: 786, baseType: !278, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !336, file: !34, line: 788, baseType: !115, size: 1024, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !336, file: !34, line: 789, baseType: !11, size: 64, offset: 1088)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !336, file: !34, line: 790, baseType: !120, size: 512, offset: 1152)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "sha512", scope: !275, file: !34, line: 1084, baseType: !343, size: 1664)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_sha512_context", file: !34, line: 886, baseType: !335)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "md5sha1", scope: !275, file: !34, line: 1085, baseType: !345, size: 960)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_md5sha1_context", file: !34, line: 1006, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 995, size: 960, elements: !347)
!347 = !{!348, !349, !350, !351, !352}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !346, file: !34, line: 999, baseType: !278, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !346, file: !34, line: 1001, baseType: !77, size: 512, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !346, file: !34, line: 1002, baseType: !11, size: 64, offset: 576)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "val_md5", scope: !346, file: !34, line: 1003, baseType: !82, size: 128, offset: 640)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "val_sha1", scope: !346, file: !34, line: 1004, baseType: !93, size: 160, offset: 768)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "kso", scope: !271, file: !29, line: 113, baseType: !77, size: 512, offset: 1664)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !271, file: !29, line: 114, baseType: !14, size: 64, offset: 2176)
!355 = !{!"61"}
!356 = !{!"62"}
!357 = !{!"63"}
!358 = !{!"64"}
!359 = !DILocalVariable(name: "ctx", arg: 1, scope: !265, file: !4, line: 46, type: !268)
!360 = !DILocation(line: 0, scope: !265)
!361 = !{!"65"}
!362 = !DILocalVariable(name: "data", arg: 2, scope: !265, file: !4, line: 47, type: !54)
!363 = !{!"66"}
!364 = !DILocalVariable(name: "len", arg: 3, scope: !265, file: !4, line: 47, type: !14)
!365 = !{!"67"}
!366 = !DILocalVariable(name: "min_len", arg: 4, scope: !265, file: !4, line: 47, type: !14)
!367 = !{!"68"}
!368 = !DILocalVariable(name: "max_len", arg: 5, scope: !265, file: !4, line: 47, type: !14)
!369 = !{!"69"}
!370 = !DILocalVariable(name: "out", arg: 6, scope: !265, file: !4, line: 48, type: !62)
!371 = !{!"70"}
!372 = !DILocalVariable(name: "hc", scope: !265, file: !4, line: 66, type: !274)
!373 = !DILocation(line: 66, column: 25, scope: !265)
!374 = !{!"71"}
!375 = !DILocalVariable(name: "tmp1", scope: !265, file: !4, line: 71, type: !77)
!376 = !DILocation(line: 71, column: 16, scope: !265)
!377 = !{!"72"}
!378 = !DILocalVariable(name: "tmp2", scope: !265, file: !4, line: 71, type: !77)
!379 = !DILocation(line: 71, column: 26, scope: !265)
!380 = !{!"73"}
!381 = !DILocation(line: 77, column: 12, scope: !265)
!382 = !{!"74"}
!383 = !{!"75"}
!384 = !{!"76"}
!385 = !{!"77"}
!386 = !DILocation(line: 82, column: 11, scope: !265)
!387 = !{!"78"}
!388 = !{!"79"}
!389 = !DILocalVariable(name: "dig", scope: !265, file: !4, line: 65, type: !278)
!390 = !{!"80"}
!391 = !DILocation(line: 83, column: 13, scope: !265)
!392 = !{!"81"}
!393 = !{!"82"}
!394 = !DILocation(line: 83, column: 18, scope: !265)
!395 = !{!"83"}
!396 = !DILocation(line: 83, column: 47, scope: !265)
!397 = !{!"84"}
!398 = !{!"85"}
!399 = !DILocalVariable(name: "be", scope: !265, file: !4, line: 67, type: !400)
!400 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!401 = !{!"86"}
!402 = !DILocalVariable(name: "po", scope: !265, file: !4, line: 68, type: !6)
!403 = !{!"87"}
!404 = !DILocation(line: 85, column: 11, scope: !405)
!405 = distinct !DILexicalBlock(scope: !265, file: !4, line: 85, column: 6)
!406 = !{!"88"}
!407 = !{!"89"}
!408 = !DILocation(line: 85, column: 16, scope: !405)
!409 = !{!"90"}
!410 = !{!"91"}
!411 = !DILocation(line: 85, column: 6, scope: !265)
!412 = !{!"92"}
!413 = !DILocation(line: 86, column: 6, scope: !414)
!414 = distinct !DILexicalBlock(scope: !405, file: !4, line: 85, column: 46)
!415 = !{!"93"}
!416 = !{!"94"}
!417 = !DILocation(line: 87, column: 2, scope: !414)
!418 = !{!"95"}
!419 = !{!"96"}
!420 = !{!"97"}
!421 = !DILocation(line: 88, column: 7, scope: !265)
!422 = !{!"98"}
!423 = !{!"99"}
!424 = !DILocalVariable(name: "bs", scope: !265, file: !4, line: 68, type: !6)
!425 = !{!"100"}
!426 = !DILocation(line: 89, column: 9, scope: !265)
!427 = !{!"101"}
!428 = !DILocalVariable(name: "hlen", scope: !265, file: !4, line: 72, type: !14)
!429 = !{!"102"}
!430 = !DILocation(line: 94, column: 15, scope: !265)
!431 = !{!"103"}
!432 = !{!"104"}
!433 = !DILocation(line: 94, column: 25, scope: !265)
!434 = !{!"105"}
!435 = !DILocation(line: 94, column: 33, scope: !265)
!436 = !{!"106"}
!437 = !DILocation(line: 94, column: 10, scope: !265)
!438 = !{!"107"}
!439 = !{!"ValueTainted"}
!440 = !{!"PointTainted"}
!441 = !DILocalVariable(name: "count", scope: !265, file: !4, line: 70, type: !11)
!442 = !{!"108"}
!443 = !DILocation(line: 95, column: 19, scope: !265)
!444 = !{!"109"}
!445 = !DILocation(line: 95, column: 36, scope: !265)
!446 = !{!"110"}
!447 = !DILocalVariable(name: "bit_len", scope: !265, file: !4, line: 70, type: !11)
!448 = !{!"111"}
!449 = !DILocation(line: 102, column: 18, scope: !265)
!450 = !{!"112"}
!451 = !DILocation(line: 102, column: 56, scope: !265)
!452 = !{!"113"}
!453 = !DILocation(line: 102, column: 42, scope: !265)
!454 = !{!"114"}
