; ModuleID = 'api_mul.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.br_ec_impl = type { i32, i8* (i32, i64*)*, i8* (i32, i64*)*, i64 (i32, i64*)*, i32 (i8*, i64, i8*, i64, i32)*, i64 (i8*, i8*, i64, i32)*, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* }
%struct.smack_value = type { i8* }

@br_ec_c25519_i15 = dso_local constant %struct.br_ec_impl { i32 536870912, i8* (i32, i64*)* @api_generator, i8* (i32, i64*)* @api_order, i64 (i32, i64*)* @api_xoff, i32 (i8*, i64, i8*, i64, i32)* @api_mul, i64 (i8*, i8*, i64, i32)* @api_mulgen, i32 (i8*, i8*, i64, i8*, i64, i8*, i64, i32)* @api_muladd }, align 8, !dbg !0
@C255_P = internal constant [18 x i16] [i16 272, i16 32749, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767, i16 32767], align 16, !dbg !15
@C255_R2 = internal constant <{ i16, i16, [16 x i16] }> <{ i16 272, i16 361, [16 x i16] zeroinitializer }>, align 16, !dbg !26
@C255_A24 = internal constant <{ i16, i16, i16, [15 x i16] }> <{ i16 272, i16 17875, i16 70, [15 x i16] zeroinitializer }>, align 16, !dbg !28
@ORDER = internal constant [32 x i8] c"\7F\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF\FF", align 16, !dbg !13

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "br_ec_c25519_i15", scope: !2, file: !3, line: 390, type: !30, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../BearSSL/src/ec/ec_c25519_i15.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!4 = !{}
!5 = !{!0, !6, !13, !15, !26, !28}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "GEN", scope: !2, file: !3, line: 77, type: !8, isLocal: true, isDefinition: true)
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, elements: !11)
!9 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!10 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!11 = !{!12}
!12 = !DISubrange(count: 32)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "ORDER", scope: !2, file: !3, line: 84, type: !8, isLocal: true, isDefinition: true)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "C255_P", scope: !2, file: !3, line: 33, type: !17, isLocal: true, isDefinition: true)
!17 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 288, elements: !24)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !20, line: 25, baseType: !21)
!20 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !22, line: 40, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!23 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!24 = !{!25}
!25 = !DISubrange(count: 18)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "C255_R2", scope: !2, file: !3, line: 42, type: !17, isLocal: true, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "C255_A24", scope: !2, file: !3, line: 70, type: !17, isLocal: true, isDefinition: true)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !31)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !32, line: 415, baseType: !33)
!32 = !DIFile(filename: "../BearSSL/inc/bearssl_ec.h", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 270, size: 448, elements: !34)
!34 = !{!35, !39, !49, !50, !54, !59, !63}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !33, file: !32, line: 279, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !20, line: 26, baseType: !37)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !22, line: 42, baseType: !38)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !33, file: !32, line: 292, baseType: !40, size: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DISubroutineType(types: !42)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!44 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !47, line: 46, baseType: !48)
!47 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!48 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !33, file: !32, line: 306, baseType: !40, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !33, file: !32, line: 318, baseType: !51, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DISubroutineType(types: !53)
!53 = !{!46, !44, !45}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !33, file: !32, line: 350, baseType: !55, size: 64, offset: 256)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!36, !58, !46, !43, !46, !44}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !33, file: !32, line: 366, baseType: !60, size: 64, offset: 320)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{!46, !58, !43, !46, !44}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !33, file: !32, line: 412, baseType: !64, size: 64, offset: 384)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DISubroutineType(types: !66)
!66 = !{!36, !58, !43, !46, !43, !46, !43, !46, !44}
!67 = distinct !DICompileUnit(language: DW_LANG_C99, file: !68, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!68 = !DIFile(filename: "api_mul.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!69 = distinct !DICompileUnit(language: DW_LANG_C99, file: !70, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!70 = !DIFile(filename: "../BearSSL/src/int/i15_add.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!71 = distinct !DICompileUnit(language: DW_LANG_C99, file: !72, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !73, splitDebugInlining: false, nameTableKind: None)
!72 = !DIFile(filename: "../BearSSL/src/int/i15_decmod.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!73 = !{!36, !74}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !75, line: 26, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !22, line: 41, baseType: !44)
!77 = distinct !DICompileUnit(language: DW_LANG_C99, file: !78, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !79, splitDebugInlining: false, nameTableKind: None)
!78 = !DIFile(filename: "../BearSSL/src/int/i15_encode.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!79 = !{!36, !10}
!80 = distinct !DICompileUnit(language: DW_LANG_C99, file: !81, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !82, splitDebugInlining: false, nameTableKind: None)
!81 = !DIFile(filename: "../BearSSL/src/int/i15_montmul.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!82 = !{!46, !36}
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !84, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!84 = !DIFile(filename: "../BearSSL/src/int/i15_sub.c", directory: "/home/luwei/bech-back/BearSSL/EC_25519_i15")
!85 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!86 = !{i32 7, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{i32 1, !"wchar_size", i32 4}
!89 = distinct !DISubprogram(name: "api_mul_wrapper", scope: !68, file: !68, line: 7, type: !90, scopeLine: 8, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !67, retainedNodes: !4)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !58, !46, !43, !46, !44}
!92 = !DILocalVariable(name: "G", arg: 1, scope: !89, file: !68, line: 7, type: !58)
!93 = !DILocation(line: 0, scope: !89)
!94 = !DILocalVariable(name: "Glen", arg: 2, scope: !89, file: !68, line: 7, type: !46)
!95 = !DILocalVariable(name: "kb", arg: 3, scope: !89, file: !68, line: 8, type: !43)
!96 = !DILocalVariable(name: "kblen", arg: 4, scope: !89, file: !68, line: 8, type: !46)
!97 = !DILocalVariable(name: "curve", arg: 5, scope: !89, file: !68, line: 8, type: !44)
!98 = !DILocation(line: 9, column: 12, scope: !89)
!99 = !DILocation(line: 9, column: 2, scope: !89)
!100 = !DILocation(line: 10, column: 12, scope: !89)
!101 = !DILocation(line: 10, column: 2, scope: !89)
!102 = !DILocation(line: 11, column: 12, scope: !89)
!103 = !DILocation(line: 11, column: 2, scope: !89)
!104 = !DILocation(line: 12, column: 12, scope: !89)
!105 = !DILocation(line: 12, column: 2, scope: !89)
!106 = !DILocation(line: 13, column: 12, scope: !89)
!107 = !DILocation(line: 13, column: 2, scope: !89)
!108 = !DILocation(line: 15, column: 12, scope: !89)
!109 = !DILocation(line: 15, column: 2, scope: !89)
!110 = !DILocalVariable(name: "iec", scope: !89, file: !68, line: 16, type: !111)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_ec_impl", file: !32, line: 415, baseType: !114)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !32, line: 270, size: 448, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121, !122}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "supported_curves", scope: !114, file: !32, line: 279, baseType: !36, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "generator", scope: !114, file: !32, line: 292, baseType: !40, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !114, file: !32, line: 306, baseType: !40, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !114, file: !32, line: 318, baseType: !51, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mul", scope: !114, file: !32, line: 350, baseType: !55, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "mulgen", scope: !114, file: !32, line: 366, baseType: !60, size: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "muladd", scope: !114, file: !32, line: 412, baseType: !64, size: 64, offset: 384)
!123 = !DILocation(line: 18, column: 7, scope: !89)
!124 = !DILocation(line: 18, column: 2, scope: !89)
!125 = !DILocation(line: 19, column: 1, scope: !89)
!126 = distinct !DISubprogram(name: "api_mul_wrapper_t", scope: !68, file: !68, line: 30, type: !127, scopeLine: 30, spFlags: DISPFlagDefinition, unit: !67, retainedNodes: !4)
!127 = !DISubroutineType(types: !128)
!128 = !{null}
!129 = !DILocation(line: 32, column: 21, scope: !126)
!130 = !DILocalVariable(name: "G", scope: !126, file: !68, line: 32, type: !58)
!131 = !DILocation(line: 0, scope: !126)
!132 = !DILocation(line: 33, column: 17, scope: !126)
!133 = !DILocalVariable(name: "Glen", scope: !126, file: !68, line: 33, type: !46)
!134 = !DILocation(line: 34, column: 28, scope: !126)
!135 = !DILocalVariable(name: "kb", scope: !126, file: !68, line: 34, type: !43)
!136 = !DILocation(line: 35, column: 18, scope: !126)
!137 = !DILocalVariable(name: "kblen", scope: !126, file: !68, line: 35, type: !46)
!138 = !DILocalVariable(name: "curve", scope: !126, file: !68, line: 36, type: !44)
!139 = !DILocalVariable(name: "iec", scope: !126, file: !68, line: 38, type: !111)
!140 = !DILocation(line: 40, column: 7, scope: !126)
!141 = !DILocation(line: 40, column: 2, scope: !126)
!142 = !DILocation(line: 41, column: 1, scope: !126)
!143 = distinct !DISubprogram(name: "api_generator", scope: !3, file: !3, line: 92, type: !41, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!144 = !DILocalVariable(name: "curve", arg: 1, scope: !143, file: !3, line: 92, type: !44)
!145 = !DILocation(line: 0, scope: !143)
!146 = !DILocalVariable(name: "len", arg: 2, scope: !143, file: !3, line: 92, type: !45)
!147 = !DILocation(line: 95, column: 7, scope: !143)
!148 = !DILocation(line: 96, column: 2, scope: !143)
!149 = distinct !DISubprogram(name: "api_order", scope: !3, file: !3, line: 100, type: !41, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!150 = !DILocalVariable(name: "curve", arg: 1, scope: !149, file: !3, line: 100, type: !44)
!151 = !DILocation(line: 0, scope: !149)
!152 = !DILocalVariable(name: "len", arg: 2, scope: !149, file: !3, line: 100, type: !45)
!153 = !DILocation(line: 103, column: 7, scope: !149)
!154 = !DILocation(line: 104, column: 2, scope: !149)
!155 = distinct !DISubprogram(name: "api_xoff", scope: !3, file: !3, line: 108, type: !52, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!156 = !DILocalVariable(name: "curve", arg: 1, scope: !155, file: !3, line: 108, type: !44)
!157 = !DILocation(line: 0, scope: !155)
!158 = !DILocalVariable(name: "len", arg: 2, scope: !155, file: !3, line: 108, type: !45)
!159 = !DILocation(line: 111, column: 7, scope: !155)
!160 = !DILocation(line: 112, column: 2, scope: !155)
!161 = distinct !DISubprogram(name: "api_mul", scope: !3, file: !3, line: 179, type: !56, scopeLine: 181, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !4)
!162 = !DILocalVariable(name: "G", arg: 1, scope: !161, file: !3, line: 179, type: !58)
!163 = !DILocation(line: 0, scope: !161)
!164 = !DILocalVariable(name: "Glen", arg: 2, scope: !161, file: !3, line: 179, type: !46)
!165 = !DILocalVariable(name: "kb", arg: 3, scope: !161, file: !3, line: 180, type: !43)
!166 = !DILocalVariable(name: "kblen", arg: 4, scope: !161, file: !3, line: 180, type: !46)
!167 = !DILocalVariable(name: "curve", arg: 5, scope: !161, file: !3, line: 180, type: !44)
!168 = !DILocalVariable(name: "x1", scope: !161, file: !3, line: 188, type: !169)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 288, elements: !24)
!170 = !DILocation(line: 188, column: 11, scope: !161)
