; ModuleID = 'decrypt.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.br_block_cbcdec_class_ = type { i64, i32, i32, void (%struct.br_block_cbcdec_class_**, i8*, i64)*, void (%struct.br_block_cbcdec_class_**, i8*, i8*, i64)* }
%struct.br_block_cbcenc_class_ = type { i64, i32, i32, void (%struct.br_block_cbcenc_class_**, i8*, i64)*, void (%struct.br_block_cbcenc_class_**, i8*, i8*, i64)* }
%struct.br_block_ctr_class_ = type { i64, i32, i32, void (%struct.br_block_ctr_class_**, i8*, i64)*, i32 (%struct.br_block_ctr_class_**, i8*, i32, i8*, i64)* }
%struct.br_block_ctrcbc_class_ = type { i64, i32, i32, void (%struct.br_block_ctrcbc_class_**, i8*, i64)*, void (%struct.br_block_ctrcbc_class_**, i8*, i8*, i8*, i64)*, void (%struct.br_block_ctrcbc_class_**, i8*, i8*, i8*, i64)*, void (%struct.br_block_ctrcbc_class_**, i8*, i8*, i64)*, void (%struct.br_block_ctrcbc_class_**, i8*, i8*, i64)* }
%struct.br_aes_small_cbcdec_keys = type { %struct.br_block_cbcdec_class_*, [60 x i32], i32 }
%struct.br_aes_small_cbcenc_keys = type { %struct.br_block_cbcenc_class_*, [60 x i32], i32 }
%struct.br_aes_small_ctr_keys = type { %struct.br_block_ctr_class_*, [60 x i32], i32 }
%struct.br_aes_small_ctrcbc_keys = type { %struct.br_block_ctrcbc_class_*, [60 x i32], i32 }
%struct.smack_value = type { i8* }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "br_aes_small_cbcdec_vtable", scope: !2, file: !3, line: 61, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../BearSSL/src/symcipher/aes_small_cbcdec.c", directory: "/home/luwei/bech-back/BearSSL/AES_small")
!4 = !{}
!5 = !{!0}
!6 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_block_cbcdec_class", file: !8, line: 449, baseType: !9)
!8 = !DIFile(filename: "../BearSSL/inc/bearssl_block.h", directory: "/home/luwei/bech-back/BearSSL/AES_small")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "br_block_cbcdec_class_", file: !8, line: 450, size: 256, elements: !10)
!10 = !{!11, !15, !17, !18, !26}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "context_size", scope: !9, file: !8, line: 455, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 46, baseType: !14)
!13 = !DIFile(filename: "/usr/lib/llvm-12/lib/clang/12.0.1/include/stddef.h", directory: "")
!14 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !9, file: !8, line: 460, baseType: !16, size: 32, offset: 64)
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "log_block_size", scope: !9, file: !8, line: 466, baseType: !16, size: 32, offset: 96)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !9, file: !8, line: 479, baseType: !19, size: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22, !24, !12}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !9, file: !8, line: 495, baseType: !27, size: 64, offset: 192)
!27 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!28 = !DISubroutineType(types: !29)
!29 = !{null, !30, !32, !32, !12}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "br_aes_small_cbcenc_vtable", scope: !35, file: !36, line: 59, type: !38, isLocal: false, isDefinition: true)
!35 = distinct !DICompileUnit(language: DW_LANG_C99, file: !36, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !37, splitDebugInlining: false, nameTableKind: None)
!36 = !DIFile(filename: "../BearSSL/src/symcipher/aes_small_cbcenc.c", directory: "/home/luwei/bech-back/BearSSL/AES_small")
!37 = !{!33}
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_block_cbcenc_class", file: !8, line: 393, baseType: !40)
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "br_block_cbcenc_class_", file: !8, line: 394, size: 256, elements: !41)
!41 = !{!42, !43, !44, !45, !51}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "context_size", scope: !40, file: !8, line: 399, baseType: !12, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !40, file: !8, line: 404, baseType: !16, size: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "log_block_size", scope: !40, file: !8, line: 410, baseType: !16, size: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !40, file: !8, line: 423, baseType: !46, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!47 = !DISubroutineType(types: !48)
!48 = !{null, !49, !24, !12}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !40, file: !8, line: 439, baseType: !52, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55, !32, !32, !12}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "br_aes_small_ctr_vtable", scope: !59, file: !60, line: 75, type: !64, isLocal: false, isDefinition: true)
!59 = distinct !DICompileUnit(language: DW_LANG_C99, file: !60, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !61, globals: !63, splitDebugInlining: false, nameTableKind: None)
!60 = !DIFile(filename: "../BearSSL/src/symcipher/aes_small_ctr.c", directory: "/home/luwei/bech-back/BearSSL/AES_small")
!61 = !{!62}
!62 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!63 = !{!57}
!64 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !65)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_block_ctr_class", file: !8, line: 506, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "br_block_ctr_class_", file: !8, line: 507, size: 256, elements: !67)
!67 = !{!68, !69, !70, !71, !77}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "context_size", scope: !66, file: !8, line: 512, baseType: !12, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !66, file: !8, line: 517, baseType: !16, size: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "log_block_size", scope: !66, file: !8, line: 523, baseType: !16, size: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !66, file: !8, line: 536, baseType: !72, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !75, !24, !12}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "run", scope: !66, file: !8, line: 562, baseType: !78, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DISubroutineType(types: !80)
!80 = !{!81, !85, !24, !81, !32, !12}
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !82, line: 26, baseType: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !84, line: 42, baseType: !16)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "br_aes_small_ctrcbc_vtable", scope: !89, file: !90, line: 124, type: !93, isLocal: false, isDefinition: true)
!89 = distinct !DICompileUnit(language: DW_LANG_C99, file: !90, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !91, globals: !92, splitDebugInlining: false, nameTableKind: None)
!90 = !DIFile(filename: "../BearSSL/src/symcipher/aes_small_ctrcbc.c", directory: "/home/luwei/bech-back/BearSSL/AES_small")
!91 = !{!81, !62}
!92 = !{!87}
!93 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_block_ctrcbc_class", file: !8, line: 573, baseType: !95)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "br_block_ctrcbc_class_", file: !8, line: 574, size: 448, elements: !96)
!96 = !{!97, !98, !99, !100, !106, !112, !113, !117}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "context_size", scope: !95, file: !8, line: 579, baseType: !12, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !95, file: !8, line: 584, baseType: !16, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "log_block_size", scope: !95, file: !8, line: 590, baseType: !16, size: 32, offset: 96)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !95, file: !8, line: 603, baseType: !101, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DISubroutineType(types: !103)
!103 = !{null, !104, !24, !12}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "encrypt", scope: !95, file: !8, line: 627, baseType: !107, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{null, !110, !32, !32, !32, !12}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "decrypt", scope: !95, file: !8, line: 651, baseType: !107, size: 64, offset: 256)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ctr", scope: !95, file: !8, line: 669, baseType: !114, size: 64, offset: 320)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DISubroutineType(types: !116)
!116 = !{null, !110, !32, !32, !12}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "mac", scope: !95, file: !8, line: 688, baseType: !118, size: 64, offset: 384)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DISubroutineType(types: !120)
!120 = !{null, !110, !32, !24, !12}
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "iS", scope: !123, file: !124, line: 30, type: !127, isLocal: true, isDefinition: true)
!123 = distinct !DICompileUnit(language: DW_LANG_C99, file: !124, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !125, globals: !126, splitDebugInlining: false, nameTableKind: None)
!124 = !DIFile(filename: "../BearSSL/src/symcipher/aes_small_dec.c", directory: "/home/luwei/bech-back/BearSSL/AES_small")
!125 = !{!16}
!126 = !{!121}
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 2048, elements: !129)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!129 = !{!130}
!130 = !DISubrange(count: 256)
!131 = distinct !DICompileUnit(language: DW_LANG_C99, file: !132, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !133, splitDebugInlining: false, nameTableKind: None)
!132 = !DIFile(filename: "../BearSSL/src/symcipher/aes_small_enc.c", directory: "/home/luwei/bech-back/BearSSL/AES_small")
!133 = !{!16, !134}
!134 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!135 = distinct !DICompileUnit(language: DW_LANG_C99, file: !136, producer: "Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!136 = !DIFile(filename: "decrypt.c", directory: "/home/luwei/bech-back/BearSSL/AES_small")
!137 = !{!"Ubuntu clang version 12.0.1-++20211029101322+fed41342a82f-1~exp1~20211029221816.4"}
!138 = !{i32 7, !"Dwarf Version", i32 4}
!139 = !{i32 2, !"Debug Info Version", i32 3}
!140 = !{i32 1, !"wchar_size", i32 4}
!141 = distinct !DISubprogram(name: "br_aes_small_cbcdec_init", scope: !3, file: !3, line: 29, type: !142, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!142 = !DISubroutineType(types: !143)
!143 = !{null, !144, !24, !12}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_aes_small_cbcdec_keys", file: !8, line: 951, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 944, size: 2048, elements: !147)
!147 = !{!148, !149, !153}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !146, file: !8, line: 946, baseType: !23, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "skey", scope: !146, file: !8, line: 948, baseType: !150, size: 1920, offset: 64)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 1920, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 60)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "num_rounds", scope: !146, file: !8, line: 949, baseType: !16, size: 32, offset: 1984)
!154 = !DILocalVariable(name: "ctx", arg: 1, scope: !141, file: !3, line: 29, type: !144)
!155 = !DILocation(line: 0, scope: !141)
!156 = !DILocalVariable(name: "key", arg: 2, scope: !141, file: !3, line: 30, type: !24)
!157 = !DILocalVariable(name: "len", arg: 3, scope: !141, file: !3, line: 30, type: !12)
!158 = !DILocation(line: 32, column: 7, scope: !141)
!159 = !DILocation(line: 32, column: 14, scope: !141)
!160 = !DILocation(line: 33, column: 41, scope: !141)
!161 = !DILocation(line: 33, column: 36, scope: !141)
!162 = !DILocation(line: 33, column: 20, scope: !141)
!163 = !DILocation(line: 33, column: 7, scope: !141)
!164 = !DILocation(line: 33, column: 18, scope: !141)
!165 = !DILocation(line: 34, column: 1, scope: !141)
!166 = distinct !DISubprogram(name: "br_aes_small_cbcdec_run", scope: !3, file: !3, line: 38, type: !167, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!167 = !DISubroutineType(types: !168)
!168 = !{null, !169, !32, !32, !12}
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!171 = !DILocalVariable(name: "ctx", arg: 1, scope: !166, file: !3, line: 38, type: !169)
!172 = !DILocation(line: 0, scope: !166)
!173 = !DILocalVariable(name: "iv", arg: 2, scope: !166, file: !3, line: 39, type: !32)
!174 = !DILocalVariable(name: "data", arg: 3, scope: !166, file: !3, line: 39, type: !32)
!175 = !DILocalVariable(name: "len", arg: 4, scope: !166, file: !3, line: 39, type: !12)
!176 = !DILocalVariable(name: "ivbuf", scope: !166, file: !3, line: 41, type: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!178 = !DILocalVariable(name: "buf", scope: !166, file: !3, line: 41, type: !177)
!179 = !DILocation(line: 45, column: 2, scope: !166)
!180 = !DILocation(line: 45, column: 13, scope: !166)
!181 = !DILocalVariable(name: "tmp", scope: !182, file: !3, line: 46, type: !183)
!182 = distinct !DILexicalBlock(scope: !166, file: !3, line: 45, column: 18)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !62, size: 128, elements: !184)
!184 = !{!185}
!185 = !DISubrange(count: 16)
!186 = !DILocation(line: 46, column: 17, scope: !182)
!187 = !DILocation(line: 49, column: 3, scope: !182)
!188 = !DILocation(line: 50, column: 29, scope: !182)
!189 = !DILocation(line: 50, column: 46, scope: !182)
!190 = !DILocation(line: 50, column: 41, scope: !182)
!191 = !DILocation(line: 50, column: 3, scope: !182)
!192 = !DILocalVariable(name: "i", scope: !182, file: !3, line: 47, type: !134)
!193 = !DILocation(line: 0, scope: !182)
!194 = !DILocation(line: 51, column: 8, scope: !195)
!195 = distinct !DILexicalBlock(scope: !182, file: !3, line: 51, column: 3)
!196 = !DILocation(line: 0, scope: !195)
!197 = !DILocation(line: 51, column: 17, scope: !198)
!198 = distinct !DILexicalBlock(scope: !195, file: !3, line: 51, column: 3)
!199 = !DILocation(line: 51, column: 3, scope: !195)
!200 = !DILocation(line: 52, column: 14, scope: !201)
!201 = distinct !DILexicalBlock(scope: !198, file: !3, line: 51, column: 29)
!202 = !DILocation(line: 52, column: 4, scope: !201)
!203 = !DILocation(line: 52, column: 11, scope: !201)
!204 = !DILocation(line: 53, column: 3, scope: !201)
!205 = !DILocation(line: 51, column: 25, scope: !198)
!206 = !DILocation(line: 51, column: 3, scope: !198)
!207 = distinct !{!207, !199, !208, !209}
!208 = !DILocation(line: 53, column: 3, scope: !195)
!209 = !{!"llvm.loop.mustprogress"}
!210 = !DILocation(line: 54, column: 3, scope: !182)
!211 = !DILocation(line: 55, column: 7, scope: !182)
!212 = !DILocation(line: 56, column: 7, scope: !182)
!213 = distinct !{!213, !179, !214, !209}
!214 = !DILocation(line: 57, column: 2, scope: !166)
!215 = !DILocation(line: 58, column: 1, scope: !166)
!216 = distinct !DISubprogram(name: "br_aes_small_cbcenc_init", scope: !36, file: !36, line: 29, type: !217, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !4)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !219, !24, !12}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_aes_small_cbcenc_keys", file: !8, line: 936, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 929, size: 2048, elements: !222)
!222 = !{!223, !224, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !221, file: !8, line: 931, baseType: !50, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "skey", scope: !221, file: !8, line: 933, baseType: !150, size: 1920, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "num_rounds", scope: !221, file: !8, line: 934, baseType: !16, size: 32, offset: 1984)
!226 = !DILocalVariable(name: "ctx", arg: 1, scope: !216, file: !36, line: 29, type: !219)
!227 = !DILocation(line: 0, scope: !216)
!228 = !DILocalVariable(name: "key", arg: 2, scope: !216, file: !36, line: 30, type: !24)
!229 = !DILocalVariable(name: "len", arg: 3, scope: !216, file: !36, line: 30, type: !12)
!230 = !DILocation(line: 32, column: 7, scope: !216)
!231 = !DILocation(line: 32, column: 14, scope: !216)
!232 = !DILocation(line: 33, column: 41, scope: !216)
!233 = !DILocation(line: 33, column: 36, scope: !216)
!234 = !DILocation(line: 33, column: 20, scope: !216)
!235 = !DILocation(line: 33, column: 7, scope: !216)
!236 = !DILocation(line: 33, column: 18, scope: !216)
!237 = !DILocation(line: 34, column: 1, scope: !216)
!238 = distinct !DISubprogram(name: "br_aes_small_cbcenc_run", scope: !36, file: !36, line: 38, type: !239, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !35, retainedNodes: !4)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !241, !32, !32, !12}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!243 = !DILocalVariable(name: "ctx", arg: 1, scope: !238, file: !36, line: 38, type: !241)
!244 = !DILocation(line: 0, scope: !238)
!245 = !DILocalVariable(name: "iv", arg: 2, scope: !238, file: !36, line: 39, type: !32)
!246 = !DILocalVariable(name: "data", arg: 3, scope: !238, file: !36, line: 39, type: !32)
!247 = !DILocalVariable(name: "len", arg: 4, scope: !238, file: !36, line: 39, type: !12)
!248 = !DILocalVariable(name: "ivbuf", scope: !238, file: !36, line: 41, type: !177)
!249 = !DILocalVariable(name: "buf", scope: !238, file: !36, line: 41, type: !177)
!250 = !DILocation(line: 45, column: 2, scope: !238)
!251 = !DILocation(line: 45, column: 13, scope: !238)
!252 = !DILocalVariable(name: "i", scope: !253, file: !36, line: 46, type: !134)
!253 = distinct !DILexicalBlock(scope: !238, file: !36, line: 45, column: 18)
!254 = !DILocation(line: 0, scope: !253)
!255 = !DILocation(line: 48, column: 8, scope: !256)
!256 = distinct !DILexicalBlock(scope: !253, file: !36, line: 48, column: 3)
!257 = !DILocation(line: 0, scope: !256)
!258 = !DILocation(line: 48, column: 17, scope: !259)
!259 = distinct !DILexicalBlock(scope: !256, file: !36, line: 48, column: 3)
!260 = !DILocation(line: 48, column: 3, scope: !256)
!261 = !DILocation(line: 49, column: 14, scope: !262)
!262 = distinct !DILexicalBlock(scope: !259, file: !36, line: 48, column: 29)
!263 = !DILocation(line: 49, column: 4, scope: !262)
!264 = !DILocation(line: 49, column: 11, scope: !262)
!265 = !DILocation(line: 50, column: 3, scope: !262)
!266 = !DILocation(line: 48, column: 25, scope: !259)
!267 = !DILocation(line: 48, column: 3, scope: !259)
!268 = distinct !{!268, !260, !269, !209}
!269 = !DILocation(line: 50, column: 3, scope: !256)
!270 = !DILocation(line: 51, column: 29, scope: !253)
!271 = !DILocation(line: 51, column: 46, scope: !253)
!272 = !DILocation(line: 51, column: 41, scope: !253)
!273 = !DILocation(line: 51, column: 3, scope: !253)
!274 = !DILocation(line: 52, column: 3, scope: !253)
!275 = !DILocation(line: 53, column: 7, scope: !253)
!276 = !DILocation(line: 54, column: 7, scope: !253)
!277 = distinct !{!277, !250, !278, !209}
!278 = !DILocation(line: 55, column: 2, scope: !238)
!279 = !DILocation(line: 56, column: 1, scope: !238)
!280 = distinct !DISubprogram(name: "br_aes_small_ctr_init", scope: !60, file: !60, line: 29, type: !281, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !59, retainedNodes: !4)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !283, !24, !12}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_aes_small_ctr_keys", file: !8, line: 967, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 960, size: 2048, elements: !286)
!286 = !{!287, !288, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !285, file: !8, line: 962, baseType: !76, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "skey", scope: !285, file: !8, line: 964, baseType: !150, size: 1920, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "num_rounds", scope: !285, file: !8, line: 965, baseType: !16, size: 32, offset: 1984)
!290 = !DILocalVariable(name: "ctx", arg: 1, scope: !280, file: !60, line: 29, type: !283)
!291 = !DILocation(line: 0, scope: !280)
!292 = !DILocalVariable(name: "key", arg: 2, scope: !280, file: !60, line: 30, type: !24)
!293 = !DILocalVariable(name: "len", arg: 3, scope: !280, file: !60, line: 30, type: !12)
!294 = !DILocation(line: 32, column: 7, scope: !280)
!295 = !DILocation(line: 32, column: 14, scope: !280)
!296 = !DILocation(line: 33, column: 41, scope: !280)
!297 = !DILocation(line: 33, column: 36, scope: !280)
!298 = !DILocation(line: 33, column: 20, scope: !280)
!299 = !DILocation(line: 33, column: 7, scope: !280)
!300 = !DILocation(line: 33, column: 18, scope: !280)
!301 = !DILocation(line: 34, column: 1, scope: !280)
!302 = distinct !DISubprogram(name: "br_aes_small_ctr_run", scope: !60, file: !60, line: 51, type: !303, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !59, retainedNodes: !4)
!303 = !DISubroutineType(types: !304)
!304 = !{!81, !305, !24, !81, !32, !12}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!307 = !DILocalVariable(name: "ctx", arg: 1, scope: !302, file: !60, line: 51, type: !305)
!308 = !DILocation(line: 0, scope: !302)
!309 = !DILocalVariable(name: "iv", arg: 2, scope: !302, file: !60, line: 52, type: !24)
!310 = !DILocalVariable(name: "cc", arg: 3, scope: !302, file: !60, line: 52, type: !81)
!311 = !DILocalVariable(name: "data", arg: 4, scope: !302, file: !60, line: 52, type: !32)
!312 = !DILocalVariable(name: "len", arg: 5, scope: !302, file: !60, line: 52, type: !12)
!313 = !DILocalVariable(name: "buf", scope: !302, file: !60, line: 54, type: !177)
!314 = !DILocation(line: 57, column: 2, scope: !302)
!315 = !DILocation(line: 57, column: 13, scope: !302)
!316 = !DILocalVariable(name: "tmp", scope: !317, file: !60, line: 58, type: !183)
!317 = distinct !DILexicalBlock(scope: !302, file: !60, line: 57, column: 18)
!318 = !DILocation(line: 58, column: 17, scope: !317)
!319 = !DILocation(line: 60, column: 3, scope: !317)
!320 = !DILocation(line: 61, column: 14, scope: !317)
!321 = !DILocation(line: 61, column: 18, scope: !317)
!322 = !DILocation(line: 61, column: 27, scope: !317)
!323 = !DILocation(line: 61, column: 3, scope: !317)
!324 = !DILocation(line: 62, column: 29, scope: !317)
!325 = !DILocation(line: 62, column: 46, scope: !317)
!326 = !DILocation(line: 62, column: 41, scope: !317)
!327 = !DILocation(line: 62, column: 52, scope: !317)
!328 = !DILocation(line: 62, column: 3, scope: !317)
!329 = !DILocation(line: 63, column: 11, scope: !330)
!330 = distinct !DILexicalBlock(scope: !317, file: !60, line: 63, column: 7)
!331 = !DILocation(line: 63, column: 7, scope: !317)
!332 = !DILocation(line: 64, column: 16, scope: !333)
!333 = distinct !DILexicalBlock(scope: !330, file: !60, line: 63, column: 18)
!334 = !DILocation(line: 64, column: 4, scope: !333)
!335 = !DILocation(line: 65, column: 4, scope: !333)
!336 = !DILocation(line: 67, column: 15, scope: !317)
!337 = !DILocation(line: 67, column: 3, scope: !317)
!338 = !DILocation(line: 68, column: 7, scope: !317)
!339 = !DILocation(line: 69, column: 7, scope: !317)
!340 = distinct !{!340, !314, !341, !209}
!341 = !DILocation(line: 70, column: 2, scope: !302)
!342 = !DILocation(line: 71, column: 2, scope: !302)
!343 = distinct !DISubprogram(name: "br_enc32be", scope: !344, file: !344, line: 558, type: !345, scopeLine: 559, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, retainedNodes: !4)
!344 = !DIFile(filename: "../BearSSL/src/inner.h", directory: "/home/luwei/bech-back/BearSSL/AES_small")
!345 = !DISubroutineType(types: !346)
!346 = !{null, !32, !81}
!347 = !DILocalVariable(name: "dst", arg: 1, scope: !343, file: !344, line: 558, type: !32)
!348 = !DILocation(line: 0, scope: !343)
!349 = !DILocalVariable(name: "x", arg: 2, scope: !343, file: !344, line: 558, type: !81)
!350 = !DILocalVariable(name: "buf", scope: !343, file: !344, line: 563, type: !177)
!351 = !DILocation(line: 566, column: 29, scope: !343)
!352 = !DILocation(line: 566, column: 11, scope: !343)
!353 = !DILocation(line: 566, column: 2, scope: !343)
!354 = !DILocation(line: 566, column: 9, scope: !343)
!355 = !DILocation(line: 567, column: 29, scope: !343)
!356 = !DILocation(line: 567, column: 11, scope: !343)
!357 = !DILocation(line: 567, column: 2, scope: !343)
!358 = !DILocation(line: 567, column: 9, scope: !343)
!359 = !DILocation(line: 568, column: 29, scope: !343)
!360 = !DILocation(line: 568, column: 11, scope: !343)
!361 = !DILocation(line: 568, column: 2, scope: !343)
!362 = !DILocation(line: 568, column: 9, scope: !343)
!363 = !DILocation(line: 569, column: 11, scope: !343)
!364 = !DILocation(line: 569, column: 2, scope: !343)
!365 = !DILocation(line: 569, column: 9, scope: !343)
!366 = !DILocation(line: 571, column: 1, scope: !343)
!367 = distinct !DISubprogram(name: "xorbuf", scope: !60, file: !60, line: 37, type: !368, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !59, retainedNodes: !4)
!368 = !DISubroutineType(types: !369)
!369 = !{null, !32, !24, !12}
!370 = !DILocalVariable(name: "dst", arg: 1, scope: !367, file: !60, line: 37, type: !32)
!371 = !DILocation(line: 0, scope: !367)
!372 = !DILocalVariable(name: "src", arg: 2, scope: !367, file: !60, line: 37, type: !24)
!373 = !DILocalVariable(name: "len", arg: 3, scope: !367, file: !60, line: 37, type: !12)
!374 = !DILocalVariable(name: "d", scope: !367, file: !60, line: 39, type: !177)
!375 = !DILocalVariable(name: "s", scope: !367, file: !60, line: 40, type: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!377 = !DILocation(line: 44, column: 2, scope: !367)
!378 = !DILocation(line: 44, column: 13, scope: !367)
!379 = !DILocation(line: 44, column: 16, scope: !367)
!380 = !DILocation(line: 45, column: 15, scope: !381)
!381 = distinct !DILexicalBlock(scope: !367, file: !60, line: 44, column: 21)
!382 = !DILocation(line: 45, column: 12, scope: !381)
!383 = !DILocation(line: 45, column: 6, scope: !381)
!384 = !DILocation(line: 45, column: 9, scope: !381)
!385 = distinct !{!385, !377, !386, !209}
!386 = !DILocation(line: 46, column: 2, scope: !367)
!387 = !DILocation(line: 47, column: 1, scope: !367)
!388 = distinct !DISubprogram(name: "br_aes_small_ctrcbc_init", scope: !90, file: !90, line: 29, type: !389, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !89, retainedNodes: !4)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !391, !24, !12}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "br_aes_small_ctrcbc_keys", file: !8, line: 983, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !8, line: 976, size: 2048, elements: !394)
!394 = !{!395, !396, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !393, file: !8, line: 978, baseType: !105, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "skey", scope: !393, file: !8, line: 980, baseType: !150, size: 1920, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "num_rounds", scope: !393, file: !8, line: 981, baseType: !16, size: 32, offset: 1984)
!398 = !DILocalVariable(name: "ctx", arg: 1, scope: !388, file: !90, line: 29, type: !391)
!399 = !DILocation(line: 0, scope: !388)
!400 = !DILocalVariable(name: "key", arg: 2, scope: !388, file: !90, line: 30, type: !24)
!401 = !DILocalVariable(name: "len", arg: 3, scope: !388, file: !90, line: 30, type: !12)
!402 = !DILocation(line: 32, column: 7, scope: !388)
!403 = !DILocation(line: 32, column: 14, scope: !388)
!404 = !DILocation(line: 33, column: 41, scope: !388)
!405 = !DILocation(line: 33, column: 36, scope: !388)
!406 = !DILocation(line: 33, column: 20, scope: !388)
!407 = !DILocation(line: 33, column: 7, scope: !388)
!408 = !DILocation(line: 33, column: 18, scope: !388)
!409 = !DILocation(line: 34, column: 1, scope: !388)
!410 = distinct !DISubprogram(name: "br_aes_small_ctrcbc_encrypt", scope: !90, file: !90, line: 107, type: !411, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !89, retainedNodes: !4)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !413, !32, !32, !32, !12}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!415 = !DILocalVariable(name: "ctx", arg: 1, scope: !410, file: !90, line: 107, type: !413)
!416 = !DILocation(line: 0, scope: !410)
!417 = !DILocalVariable(name: "ctr", arg: 2, scope: !410, file: !90, line: 108, type: !32)
!418 = !DILocalVariable(name: "cbcmac", arg: 3, scope: !410, file: !90, line: 108, type: !32)
!419 = !DILocalVariable(name: "data", arg: 4, scope: !410, file: !90, line: 108, type: !32)
!420 = !DILocalVariable(name: "len", arg: 5, scope: !410, file: !90, line: 108, type: !12)
!421 = !DILocation(line: 110, column: 2, scope: !410)
!422 = !DILocation(line: 111, column: 2, scope: !410)
!423 = !DILocation(line: 112, column: 1, scope: !410)
!424 = distinct !DISubprogram(name: "br_aes_small_ctrcbc_decrypt", scope: !90, file: !90, line: 116, type: !411, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !89, retainedNodes: !4)
!425 = !DILocalVariable(name: "ctx", arg: 1, scope: !424, file: !90, line: 116, type: !413)
!426 = !DILocation(line: 0, scope: !424)
!427 = !DILocalVariable(name: "ctr", arg: 2, scope: !424, file: !90, line: 117, type: !32)
!428 = !DILocalVariable(name: "cbcmac", arg: 3, scope: !424, file: !90, line: 117, type: !32)
!429 = !DILocalVariable(name: "data", arg: 4, scope: !424, file: !90, line: 117, type: !32)
!430 = !DILocalVariable(name: "len", arg: 5, scope: !424, file: !90, line: 117, type: !12)
!431 = !DILocation(line: 119, column: 2, scope: !424)
!432 = !DILocation(line: 120, column: 2, scope: !424)
!433 = !DILocation(line: 121, column: 1, scope: !424)
!434 = distinct !DISubprogram(name: "br_aes_small_ctrcbc_ctr", scope: !90, file: !90, line: 51, type: !435, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !89, retainedNodes: !4)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !413, !32, !32, !12}
!437 = !DILocalVariable(name: "ctx", arg: 1, scope: !434, file: !90, line: 51, type: !413)
!438 = !DILocation(line: 0, scope: !434)
!439 = !DILocalVariable(name: "ctr", arg: 2, scope: !434, file: !90, line: 52, type: !32)
!440 = !DILocalVariable(name: "data", arg: 3, scope: !434, file: !90, line: 52, type: !32)
!441 = !DILocalVariable(name: "len", arg: 4, scope: !434, file: !90, line: 52, type: !12)
!442 = !DILocalVariable(name: "buf", scope: !434, file: !90, line: 54, type: !177)
!443 = !DILocalVariable(name: "bctr", scope: !434, file: !90, line: 54, type: !177)
!444 = !DILocation(line: 59, column: 24, scope: !434)
!445 = !DILocation(line: 59, column: 8, scope: !434)
!446 = !DILocalVariable(name: "cc3", scope: !434, file: !90, line: 55, type: !81)
!447 = !DILocation(line: 60, column: 24, scope: !434)
!448 = !DILocation(line: 60, column: 8, scope: !434)
