; ModuleID = 'crypt_cbc.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.mbedtls_des_context = type { [32 x i32] }
%struct.smack_value = type { i8* }
%struct.mbedtls_des3_context = type { [96 x i32] }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i8* }

@__const.crypt_cbc_wrapper_t.iv = private unnamed_addr constant <{ i8, [15 x i8] }> <{ i8 97, [15 x i8] zeroinitializer }>, align 16
@odd_parity_table = internal constant [128 x i8] c"\01\02\04\07\08\0B\0D\0E\10\13\15\16\19\1A\1C\1F #%&)*,/12478;=>@CEFIJLOQRTWX[]^abdghkmnpsuvyz|\7F\80\83\85\86\89\8A\8C\8F\91\92\94\97\98\9B\9D\9E\A1\A2\A4\A7\A8\AB\AD\AE\B0\B3\B5\B6\B9\BA\BC\BF\C1\C2\C4\C7\C8\CB\CD\CE\D0\D3\D5\D6\D9\DA\DC\DF\E0\E3\E5\E6\E9\EA\EC\EF\F1\F2\F4\F7\F8\FB\FD\FE", align 16, !dbg !0

!1218 = distinct !DILexicalBlock(scope: !1215, file: !3, line: 1003, column: 21)
!1219 = !DILocation(line: 1003, column: 21, scope: !1215)
!1220 = !DILocation(line: 1004, column: 62, scope: !1218)
!1221 = !DILocation(line: 1004, column: 66, scope: !1218)
!1222 = !DILocation(line: 1004, column: 71, scope: !1218)
!1223 = !DILocation(line: 1004, column: 27, scope: !1218)
!1224 = !DILocation(line: 1004, column: 21, scope: !1218)
!1225 = !DILocation(line: 1006, column: 64, scope: !1218)
!1226 = !DILocation(line: 1006, column: 68, scope: !1218)
!1227 = !DILocation(line: 1006, column: 73, scope: !1218)
!1228 = !DILocation(line: 1006, column: 27, scope: !1218)
!1229 = !DILocation(line: 0, scope: !1218)
!1230 = !DILocation(line: 1007, column: 25, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1215, file: !3, line: 1007, column: 21)
!1232 = !DILocation(line: 1007, column: 21, scope: !1215)
!1233 = !DILocation(line: 1008, column: 21, scope: !1231)
!1234 = !DILocation(line: 1010, column: 17, scope: !1215)
!1235 = !DILocation(line: 1011, column: 17, scope: !1215)
!1236 = !DILocation(line: 1012, column: 17, scope: !1215)
!1237 = !DILocation(line: 1013, column: 13, scope: !1215)
!1238 = !DILocation(line: 999, column: 35, scope: !1212)
!1239 = !DILocation(line: 999, column: 13, scope: !1212)
!1240 = distinct !{!1240, !1213, !1241, !217}
!1241 = !DILocation(line: 1013, column: 13, scope: !1208)
!1242 = !DILocation(line: 1015, column: 13, scope: !1209)
!1243 = !DILocation(line: 976, column: 17, scope: !1154)
!1244 = !DILocation(line: 1018, column: 17, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 1018, column: 13)
!1246 = !DILocation(line: 1018, column: 40, scope: !1245)
!1247 = !DILocation(line: 1019, column: 25, scope: !1245)
!1248 = !DILocation(line: 1019, column: 30, scope: !1245)
!1249 = !DILocation(line: 1019, column: 17, scope: !1245)
!1250 = !DILocation(line: 1019, column: 56, scope: !1245)
!1251 = !DILocation(line: 1019, column: 63, scope: !1245)
!1252 = !DILocation(line: 1020, column: 17, scope: !1245)
!1253 = !DILocation(line: 1020, column: 40, scope: !1245)
!1254 = !DILocation(line: 1021, column: 25, scope: !1245)
!1255 = !DILocation(line: 1021, column: 30, scope: !1245)
!1256 = !DILocation(line: 1021, column: 17, scope: !1245)
!1257 = !DILocation(line: 1021, column: 56, scope: !1245)
!1258 = !DILocation(line: 1018, column: 13, scope: !1137)
!1259 = !DILocation(line: 1023, column: 25, scope: !1260)
!1260 = distinct !DILexicalBlock(scope: !1261, file: !3, line: 1023, column: 17)
!1261 = distinct !DILexicalBlock(scope: !1245, file: !3, line: 1022, column: 9)
!1262 = !DILocation(line: 1023, column: 17, scope: !1261)
!1263 = !DILocation(line: 1024, column: 17, scope: !1260)
!1264 = !DILocation(line: 1027, column: 13, scope: !1261)
!1265 = !DILocation(line: 1030, column: 21, scope: !1266)
!1266 = distinct !DILexicalBlock(scope: !1137, file: !3, line: 1030, column: 13)
!1267 = !DILocation(line: 1030, column: 13, scope: !1137)
!1268 = !DILocation(line: 1031, column: 13, scope: !1266)
!1269 = !DILocation(line: 1032, column: 5, scope: !1137)
!1270 = !DILocation(line: 939, column: 25, scope: !1134)
!1271 = !DILocation(line: 939, column: 5, scope: !1134)
!1272 = distinct !{!1272, !1135, !1273, !217}
!1273 = !DILocation(line: 1032, column: 5, scope: !1131)
!1274 = !DILocation(line: 1035, column: 17, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 1035, column: 9)
!1276 = !DILocation(line: 1035, column: 9, scope: !1006)
!1277 = !DILocation(line: 1036, column: 9, scope: !1275)
!1278 = !DILocation(line: 1035, column: 20, scope: !1275)
!1279 = !DILabel(scope: !1006, name: "exit", file: !3, line: 1038)
!1280 = !DILocation(line: 1038, column: 1, scope: !1006)
!1281 = !DILocation(line: 1039, column: 5, scope: !1006)
!1282 = !DILocation(line: 1040, column: 5, scope: !1006)
!1283 = !DILocation(line: 1042, column: 13, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 1042, column: 9)
!1285 = !DILocation(line: 1042, column: 9, scope: !1006)
!1286 = !DILocation(line: 1043, column: 9, scope: !1284)
!1287 = !DILocation(line: 1044, column: 5, scope: !1006)
!1288 = !DILocation(line: 1045, column: 1, scope: !1006)
!1289 = distinct !DISubprogram(name: "mbedtls_platform_zeroize", scope: !75, file: !75, line: 67, type: !1290, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !74, retainedNodes: !4)
!1290 = !DISubroutineType(types: !1291)
!1291 = !{null, !6, !93}
!1292 = !DILocalVariable(name: "buf", arg: 1, scope: !1289, file: !75, line: 67, type: !6)
!1293 = !DILocation(line: 0, scope: !1289)
!1294 = !DILocalVariable(name: "len", arg: 2, scope: !1289, file: !75, line: 67, type: !93)
!1295 = !DILocation(line: 69, column: 5, scope: !1289)
!1296 = !DILocation(line: 69, column: 5, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1289, file: !75, line: 69, column: 5)
!1298 = !DILocation(line: 71, column: 13, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1289, file: !75, line: 71, column: 9)
!1300 = !DILocation(line: 71, column: 9, scope: !1289)
!1301 = !DILocation(line: 72, column: 9, scope: !1299)
!1302 = !DILocation(line: 75, column: 1, scope: !1289)
!1303 = distinct !DISubprogram(name: "mbedtls_platform_gmtime_r", scope: !75, file: !75, line: 107, type: !1304, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !74, retainedNodes: !4)
!1304 = !DISubroutineType(types: !1305)
!1305 = !{!1306, !1325, !1306}
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !1308, line: 7, size: 448, elements: !1309)
!1308 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_tm.h", directory: "")
!1309 = !{!1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1321}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !1307, file: !1308, line: 9, baseType: !92, size: 32)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !1307, file: !1308, line: 10, baseType: !92, size: 32, offset: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !1307, file: !1308, line: 11, baseType: !92, size: 32, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !1307, file: !1308, line: 12, baseType: !92, size: 32, offset: 96)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !1307, file: !1308, line: 13, baseType: !92, size: 32, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !1307, file: !1308, line: 14, baseType: !92, size: 32, offset: 160)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !1307, file: !1308, line: 15, baseType: !92, size: 32, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !1307, file: !1308, line: 16, baseType: !92, size: 32, offset: 224)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !1307, file: !1308, line: 17, baseType: !92, size: 32, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_gmtoff", scope: !1307, file: !1308, line: 23, baseType: !1320, size: 64, offset: 320)
!1320 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_zone", scope: !1307, file: !1308, line: 24, baseType: !1322, size: 64, offset: 384)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1324)
!1324 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1327)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbedtls_time_t", file: !1328, line: 39, baseType: !1329)
!1328 = !DIFile(filename: "../mbedtls/include/mbedtls/platform_time.h", directory: "/home/luwei/bech-back/Mbed-tls/DES")
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1330, line: 7, baseType: !1331)
!1330 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !10, line: 160, baseType: !1320)
!1332 = !DILocalVariable(name: "tt", arg: 1, scope: !1303, file: !75, line: 107, type: !1325)
!1333 = !DILocation(line: 0, scope: !1303)
!1334 = !DILocalVariable(name: "tm_buf", arg: 2, scope: !1303, file: !75, line: 108, type: !1306)
!1335 = !DILocation(line: 118, column: 13, scope: !1303)
!1336 = !DILocation(line: 118, column: 5, scope: !1303)
!1337 = distinct !DISubprogram(name: "mbedtls_xor", scope: !1338, file: !1338, line: 123, type: !1339, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !74, retainedNodes: !4)
!1338 = !DIFile(filename: "../mbedtls/library/common.h", directory: "/home/luwei/bech-back/Mbed-tls/DES")
!1339 = !DISubroutineType(types: !1340)
!1340 = !{null, !96, !97, !97, !93}
!1341 = !DILocalVariable(name: "r", arg: 1, scope: !1337, file: !1338, line: 123, type: !96)
!1342 = !DILocation(line: 0, scope: !1337)
!1343 = !DILocalVariable(name: "a", arg: 2, scope: !1337, file: !1338, line: 123, type: !97)
!1344 = !DILocalVariable(name: "b", arg: 3, scope: !1337, file: !1338, line: 123, type: !97)
!1345 = !DILocalVariable(name: "n", arg: 4, scope: !1337, file: !1338, line: 123, type: !93)
!1346 = !DILocalVariable(name: "i", scope: !1337, file: !1338, line: 125, type: !93)
!1347 = !DILocation(line: 126, column: 11, scope: !1348)
!1348 = distinct !DILexicalBlock(scope: !1337, file: !1338, line: 126, column: 5)
!1349 = !DILocation(line: 0, scope: !1348)
!1350 = !DILocation(line: 126, column: 22, scope: !1351)
!1351 = distinct !DILexicalBlock(scope: !1348, file: !1338, line: 126, column: 5)
!1352 = !DILocation(line: 126, column: 28, scope: !1351)
!1353 = !DILocation(line: 126, column: 5, scope: !1348)
!1354 = !DILocation(line: 128, column: 54, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !1351, file: !1338, line: 127, column: 5)
!1356 = !DILocation(line: 128, column: 22, scope: !1355)
!1357 = !DILocation(line: 128, column: 94, scope: !1355)
!1358 = !DILocation(line: 128, column: 62, scope: !1355)
!1359 = !DILocation(line: 128, column: 60, scope: !1355)
!1360 = !DILocalVariable(name: "x", scope: !1355, file: !1338, line: 128, type: !7)
!1361 = !DILocation(line: 0, scope: !1355)
!1362 = !DILocation(line: 129, column: 41, scope: !1355)
!1363 = !DILocation(line: 129, column: 9, scope: !1355)
!1364 = !DILocation(line: 130, column: 5, scope: !1355)
!1365 = !DILocation(line: 126, column: 36, scope: !1351)
!1366 = !DILocation(line: 126, column: 5, scope: !1351)
!1367 = distinct !{!1367, !1353, !1368, !217}
!1368 = !DILocation(line: 130, column: 5, scope: !1348)
!1369 = !DILocation(line: 131, column: 5, scope: !1337)
!1370 = !DILocation(line: 131, column: 15, scope: !1371)
!1371 = distinct !DILexicalBlock(scope: !1372, file: !1338, line: 131, column: 5)
!1372 = distinct !DILexicalBlock(scope: !1337, file: !1338, line: 131, column: 5)
!1373 = !DILocation(line: 131, column: 5, scope: !1372)
!1374 = !DILocation(line: 133, column: 16, scope: !1375)
